{
    "dataset_name": "fuzb-9jre",
    "columns": [
        {
            "column_name": "Biblioid",
            "number_non_empty_cells": 1406,
            "number_empty_cells": 0,
            "number_distinct_values": 1402,
            "frequent_values": [
                "143",
                "1555",
                "1556",
                "1557",
                "1369"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 1329,
                    "max_value": 1830,
                    "min_value": 5,
                    "mean": 788.3920240782543,
                    "stddev": 496.13290164925843
                },
                {
                    "type": "TEXT",
                    "count": 77,
                    "shortest_values": [
                        "7_A",
                        "7_B",
                        "79_A",
                        "79_B",
                        "98_B"
                    ],
                    "longest_values": [
                        "1112_A",
                        "1160_B",
                        "1046_A",
                        "1046_B",
                        "1046_C"
                    ],
                    "average_length": 5.116883116883117
                }
            ]
        },
        {
            "column_name": "Borough",
            "number_non_empty_cells": 1406,
            "number_empty_cells": 0,
            "number_distinct_values": 6,
            "frequent_values": [
                "M",
                "R",
                "K",
                "Q",
                "X"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1406,
                    "shortest_values": [
                        "M",
                        "Y",
                        "K",
                        "X",
                        "Q"
                    ],
                    "longest_values": [
                        "R",
                        "Q",
                        "X",
                        "K",
                        "Y"
                    ],
                    "average_length": 1.0
                }
            ]
        },
        {
            "column_name": "Author",
            "number_non_empty_cells": 1406,
            "number_empty_cells": 0,
            "number_distinct_values": 226,
            "frequent_values": [
                "Historical Perspectives, Inc.",
                "Greenhouse Consultants, Inc.",
                "Geismar, Joan H.",
                "Historical Perspectives, Inc",
                "John Milner Associates, Inc."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1406,
                    "shortest_values": [
                        "URS",
                        "VHB",
                        "AHRS",
                        "AKRF",
                        "AECOM"
                    ],
                    "longest_values": [
                        "Diana diZerega Wall, Nan A. Rothschild, Meredith B. Linn, and Cynthia R. Copeland, Institute for the Exploration of Seneca Village History, Inc",
                        "Brooklyn College Archaeological Research Center, Brooklyn College (H. Arthur Bankoff and Alyssa Loorya)",
                        "Louis Berger & Associates, The Cultural Resource Group, & Lookwood, Kessler & Bartlett, Inc.",
                        "New York City Landmarks Preservation Commission   [Sherene Baugher, Ed Lenik, Daniel Pagano]",
                        "U.S. Army Corps of Engineers, New York District [Christopher Ricciardi, Kirsten Davis]"
                    ],
                    "average_length": 28.998577524893314
                }
            ]
        },
        {
            "column_name": "Date",
            "number_non_empty_cells": 1404,
            "number_empty_cells": 2,
            "number_distinct_values": 47,
            "frequent_values": [
                "2008",
                "2007",
                "1991",
                "1990",
                "2009"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 1396,
                    "max_value": 2019,
                    "min_value": 1973,
                    "mean": 1999.6138968481375,
                    "stddev": 10.057032579186323
                },
                {
                    "type": "TEXT",
                    "count": 8,
                    "shortest_values": [
                        "n.    .",
                        "1986    .",
                        "1988    ."
                    ],
                    "longest_values": [
                        "1988    .",
                        "1986    .",
                        "n.    ."
                    ],
                    "average_length": 7.75
                }
            ]
        },
        {
            "column_name": "Title",
            "number_non_empty_cells": 1405,
            "number_empty_cells": 1,
            "number_distinct_values": 1355,
            "frequent_values": [
                "The History and Archaeology of City Hall Park, NY, NY.",
                "The Broad Financial Center Mitigation Final Report, Volumes I, II, III, & IV.  The Excavation of Augustine Heerman's Warehouse and Associated 17th Century Dutch West India Company Deposits.  For: Fox & Fowle Architects, P.C. & HRO International, Ltd. 100",
                "Archaeological Documentary Study, Crotona Park East, West Farms,  Proposed Rezoning, Bronx, NY",
                "Lower East Side Rezoning 07DCP078M Phase IA Archaeological Assessment, Part I Historical Background and Lot Histories, Part II Lot Histories Catalogue, Part III Plates",
                "Cultural Resources Survey Testing and Mitigation Phases, 60 Wall Street Site, New York City.  (Volumes 1 to 4.  Appendix)  CEQR 83-332M   [Multiple authors]"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1405,
                    "shortest_values": [
                        ",",
                        "Archaeology Site File/Literature Search Report.",
                        "Inwood Rezoning Phase IA Archaeological Assesment",
                        "Historic Structure Report: The Bartow-Pell Stable.",
                        "South Ferry Terminal Project, Volume II: Appendices"
                    ],
                    "longest_values": [
                        "Phase IA Archaeological Documentary Study for the Reconstruction and Construction of a Bicycle Pedestrian Path Within a Portion of the Bronx River Greenway, Located Between Unionport Road and Allerton Avenue, in Bronx Park, Parts of Block 4333, Lot 1; Block 4336, Lot 1, the Bronx, New York",
                        "Phase IA Archaeological Documentary Study, Seward Park, Mixed Use Development Project, Block 346, Lot 40; Block 347, Lot 71; Block 352, Lots 1 and 28; Block 353, Lot 44; Block 354, Lots 1 and 2; Block 409, Lot 56; and Block 410, Lot 38, Lower East Side, New York, New York",
                        "Phase IB Archaeological Investigation for Essex Crossing (Seward Park Mixed-Use Development Project) Block 346, Lot 40; Block 347, Lot 7; Block 352, Lots 1 and 28; Block 353, Lot 44; Block 354, Lots 1 and 12; Block 409, Lot 56; and Block 410, Lot 38, New York, New York",
                        "Supplemental Phase IB and Phase 2 Archaeological and Historical Investigations of Riverside Galleria (formerly Waterfront Commons) Block 7620 Lot 1, Block 7632 Lots 1. 6. 50, 150, and 151 and Richmond Valley Road Extension, Lots 100, and 110, Staten Island, New York",
                        "Phase IA Archaeological Documentary Study Saw Mill Creek Wetland Mitigation Bank Block 1780, Lots 1, 69, 210, 260, 275,a nd 300; Block 1790, Lot 100, Block 1815, Lots 74, 75, 85, 125, 135, 150, 204, 220, 235, 251, 300, 325, and 375, Staten Island, New York"
                    ],
                    "average_length": 152.37580071174378
                }
            ]
        },
        {
            "column_name": "Report Abstract",
            "number_non_empty_cells": 1401,
            "number_empty_cells": 5,
            "number_distinct_values": 1338,
            "frequent_values": [
                "Project cataloging and analyzing material collected from a previous excavation in City Hall Park. Human and faunal remains, in addition to architecture, were analyzed.  In depth site history presented as well as extensive catalog of artifacts and that were found. Analysis focuses upon the burials and the massive and continual trash dumping that occurred throughout the site in the 18th century.",
                "Project between Pearl, Pine, William and Wall Streets in the Financial District.  Report on the testing and mitigation of material from residential and commercial occupation.  Testing confirmed that no remnants of the late-17th century fortification wall, for which Wall Street is named, exist on the site.  19th- and 20th-century water system parts and construction elements were uncovered, as were 19th-century building foundations and a well.  The site's archaeological potential would have been better understood if the building records had been scrutinized to a closer degree before excavation.  All artifacts were catalogued and stored for further research.",
                "Project in area bounded generally by East 13th Street, Avenue D/Pitt Street, 3rd Avenue/Bowery, and Delancey Street/Grand Street in the Lower East Side/East Village areas.  Though renovated, several 19th-century buildings exist on these lots and remains from the 19th to early-20th centuries such as privies, cisterns and Jewish ritual baths may exist underground.  In all, 262 sites in the project area are sensitive for archaeological remains.  Because this is a rezoning project on private property, no testing can be recommended despite the sensitivity of the area.  Many very detailed maps and photographs are included.",
                "Project on Pearl and Whitehall Streets in the Financial District.  Five major time phases with corresponding archaeological material were uncovered, from a period spanning from 1640 through the mid-19th century.  Remains are mainly those of a mid-17th century warehouse.  The first of the four volumes of this report details the historical context, site reconstruction, and some artifact analysis; the second volume deals with artifact analysis, faunal analysis and conclusions; and the third and fourth contain data and notes.",
                "Project in the Crotona Park East/West Farms neighborhoods in the Bronx. Potential for 19th century privies, cisterns, and wells, and in some cases burials from the Dutch Reformed Church and Hedger-Edwards cemeteries . Archaeological testing is recommended."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1401,
                    "shortest_values": [
                        "Appendices of Vol 1",
                        "Site photos and presentations",
                        "Overview of the history of the site.",
                        "Monitoring of attic space within bridge.",
                        "Project in Hanover Square. Mortar analysis."
                    ],
                    "longest_values": [
                        "Project area includes East 53rd Street between Second and Third Avenues, East 42nd Street between Second and Third Avenues, East 14th Street between Second and Third Avenues, Broome Street between Chrystie Street and the Bowery, and Grand Street between Chrystie Street and the Bowery. As there is a moderate chance of encountering findings of significance on East 53rd, 42nd, and Broome Streets, recommendations include that of new boring tests to evaluate the sensitivity of the site while particularly archaeologically rich areas would be further studied. The 14th Street site is considered unlikely to harbor archaeological remains though if boring tests were to indicate otherwise, this could refer to a rare Native American site that would be National Register eligible. Were a finding confirmed on this site, it is recommended that archaeological sites either be avoided in construction of the Second Avenue Subway or, if this were not possible, that proper recovery efforts be made to preserve findings. The Grand Street site is considered likely to hold remains from the Revolutionary War period. Additional soil boring tests are recommended.",
                        "Project on one of four sites: East 59th Street and 1st Avenue, 54th Street and 2nd Avenue, 61st Street between 1st and 2nd Avenues, and 59th Street and 2nd Avenue.  The 59th Street and 1st Avenue site, which is the preferred site for the project, is not sensitive for archaeological material; therefore no testing is needed.  Possible remnants of the 2nd Avenue subway and a tavern might exist at the 54th Street site; careful monitoring and archaeological consultation are recommended.  At 61st Street, the remains of an ink factory might exist; therefore archaeological testing is recommended.  The 59th Street and 2nd Avenue site does not warrant testing, because construction likely affected any present remains.  Maps and color photographs are included.  An addendum to the first report was made in order to include an additional site, between 55th and 56th Streets and from 1st to 3rd Avenues.  Mid-19th-century privies, wells and cisterns, as well as the remains of the 2nd Avenue subway, may exist on the site; as a result, potential construction at this site should be monitored.",
                        "Project roughly between Canal Street, Broadway, Park Place and St. James Place/Bowery in Manhattan.  Research and borings indicate that 19th- and 20th-century construction may have protected archaeological remains deeper below the surface.  On the \"Courthouse Block\" section of the project area, the remains of commercial development, tanyards, and residential development from the mid-18th to early-19th centuries may exist on the site, as well as those of a 19th-century slum and the East River outlet of the Collect Pond.  On the \"Broadway Block\" section, remains of an 18th-century African burial ground may exist.  18th- and 19th-century domestic and commercial remains, including backyard features, may also exist on the site.  This part of the site also has the potential to contain prehistoric remains, based on possible proximity to other deposits.  Testing is recommended, as is consideration of several existing structures for inclusion in the National Register of Historic Places.",
                        "Project by Goethals Bridge in Staten Island, New York.  Because of prehistoric and historic era materials found during earlier archaeological survey and testing  and this site’s proximity to Old Place Neck Site, a Woodland period Native American settlement, further testing and excavation was performed to see if this area was connected to the “Old Place” settlement and to better understand the context of the archaeological materials found. This testing found that prehistoric remains here were likely an extension of Old Place Neck site finds, and also indicated that the site was inhabited during other prehistoric and historic periods, including a wealth of remains from the mid-19th century.  While all useful information has likely been obtained from analysis of historic period use, further analysis and archaeological investigation of prehistoric use are recommended, and the site is recommended as eligible for listing in the National Register of Historic Places.",
                        "This report is the final volume in an assessment of the potential for preserved ancient landscape and submerged cultural remains within the New York and New Jersey Port District. This survey was undertaken as part of a proposal to deepen harbor waterways, including the Newark Bay, Claremont, Port Jersey, Anchorage, Stapleton, and Ambrose Channel. The survey implemented probing techniques to analyze site stratigraphy, date and examine sediment layers and to test for archaeological sensitivity in the region. This volume includes research on modern development within the harbor and documents the effects of recent improvements on the potential underwater sites. Furthermore, the report documents the integrity environmental and prehistoric remains within the region. \nThis document contains two reports, one which listed above and Report no.108 detailing geomorphological and archaeological studies carried out at Governors Island as part of the same project."
                    ],
                    "average_length": 412.3104925053533
                }
            ]
        },
        {
            "column_name": "Key Words",
            "number_non_empty_cells": 1087,
            "number_empty_cells": 319,
            "number_distinct_values": 936,
            "frequent_values": [
                "19th century residential shaft features",
                "City Hall Park, faunal analysis, 18th century burials, Lower Manhattan",
                "soil borings",
                "19th century backyard features",
                "landfill, Common Council, Montgomery Charter, Sunken Ship"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1087,
                    "shortest_values": [
                        "LIRR",
                        "Inwood",
                        "cistern",
                        "Crotona",
                        "Stables"
                    ],
                    "longest_values": [
                        "Conference House, Christopher Billop, Burial Ridge, Billop's Ridge, Oakwood Beach Water Pollution Control Project, Ward's Point Conservation Area, Ward's Point Archaeological Site, Munsee Indians, McDonald Court, Cole/Decker House, Appleby Estate, Archer Estate, Biddle Property, Arthur Kill, Raritan Bay, Prince's Bay, Chemical Lane, Pottery Farm, Smoking Point, Sandy Brook, Lemon Creek, Sandy Ground, Wort Farm, Canada Hill Site, Decker's Swamp, Sand Ridges, Eugenia Billop, Thomas Farmar Billop, Raritans, Captain Christopher Billop, Manor of Bentley, Mary Billop, Ann Billop, Katherine Farmar, Sarah Leonard, Frances Willett, Jenny Seaman, Lord Howe, Benjamin Franklin, John Adams, Edward Ruteledge, Joseph Totten, The Battle of Long Island, Samuel Ward, Albert Ryckman, John Manee, James Churchward, Banjamin Drake, John Totten, Edward Wood, Charles Storee, Thomas McFarren, Andrew Prior, Jacob Reckhow, Caleb Ward, Hannah Ward, Elizabeth Ward, Ichabod Cleveland, Apka B. Ward, Maria Ward, Mary Teller, William Teller, Mary Grim, Henry Biddle, Richard Robins, Garrett Garretson, Matthew Decker, Many Ann Garretson, Leonard Parkinson, John B. Simonson, William H. Aspinwall, C. Parker, Henry F. Eldridge, Bentley Manor Company, Charles H. Leland, Harmon National Real Estate Corporation, Richard Christopher, Billop House, John Christopher, Catherine Christopher, Edward Wood, Henry Van Hovenburg, James Van Hovenburg, David Latourette, Peter Ruberty, Elizabeth Christopher, Simpson Johnson, Sarah Johnson, Julian Meerseman, Wallace Lavery, Billop's Ferry, Harriet Butler, Margaret Biddle, William H. Biddle, Charles S. Biddle, Courtlandt P. Butler, Betsy Jackson, Sara A. Biddle, Emma Butler, William Van Alstyne, George T. Brewster, Adelina W. Brewster, Lina Brewster, Mary R. Felch, James Rutan, Mary J. Rutan Woglom, Eliza Terry, Clinton Felch, Catherine Leven, Wood/Leven House, James S. Graham, Richmond Hill Investment Company, Helen M. Lindsey, Willam Rutan, John Mesereau, Henry Winants, Rutan Shipyard, Hannah Wood, Samuel Wood, Theodore Leven, Ann Eliza Leven, William Albert, Richard Dubois, Elizabeth Dubois, Daniel Dubois, Cornelia Dubois, Harriet Denmen, George Denmen, Jacob Springsteel, William Lynecot, Elizabeth Ann Lambert, Thaddeus Fowler, Dr. O.A. Kopetschny, David Clark",
                        "Cherry Point, Dirck Volckersten, \"Dirck the Norman,\" Jacobus Calyer, Captain Pieter Praa, Marie Hey, Oakland Avenue, Jacob Colyer, Griffin Farm, Neziah Bliss, John A. Meserole, Peter Meserole, Newton Creek, Mary Meserole, Eliphalet Nott, Union College, Abraham Messerole, David Provost, Bushwick Creek, New York Railroad, Ravenswood, Hallett's Cove Turnpike, Town of Bushwick, William Kieft, Reyer Lambertsen, Meserole Farm, Keikot Farm, Jean Mesurolle, Francis titus, Colonel Francis Titus Farm, Richard M. Woodhull, Long Island Road, Colonel Williams, Thomas Marrell, Yorkton, S.M. Meeker, Dr. Abraham J. Berry, Edmud D. Driggs, Green Point Ferry, Nassau Water Company, Croton Aqueduct Department, Brooklyn Sewer Department, H.C.H. Havemeyer Sugar Refinery, John Craig Havemeyer, The American Sugar Refining Company, John Englis, Englis' Shipyard, Civil War, Webb's Shipyard, Bell, John English & Sons, Brooklyn Bridge, Greenpoint Terminal, Continental Ironworks Factory, T.P. Rowland, The Monitor, Novelty Iron Works, Motiva Enterprises, Greenpoint Monitor Museum, Orr & Fowler & Co., New York Extract and Dye Wood Works, New York and Boston Dyewood Company, The Cartledge Porcelain Factory, Charles Cartledge, Herbert Fergerson, American Porcelain Manufacturing Company, O'Connell, Eberhard Faber",
                        "Staten Island Historical Society, Rezeau-Van Pelt burial ground, Green Ridge, The Richmond Site, Algonquin, Governor Edmund Andros, Robert Rider, James Hubbard, Arent Prall, James Hans Dye, Louis DuBois, Samuel Grasset, Arent Prall Jr. , Rene Rezeau, William Tillier, Voorlezer's House, French Huguenot church, Church of St. Andrew, Arthur Kill Road, Richmond Road, Center Street, Jacob Rezeau, Charles Garritson, Richard Cole, Right Skinner, Matthias Swame, Presbyterian Church, Dutch Reformed and Presbyterian Church, Bedell Mill, John and Joseph Wood tidemill, Revolutionary War, Wilkins, Cole tavern, Dr. Frost, Dr. Benjamin Parker, Robert Robins, Gilbert White, William White, James Stoutenberg, Simon Swame, John Dunn, Isaac Swaim, Crocheron Brothers, The Stoutenburgh Inn, Abraham Auten, The White Inn, Dubois blacksmith shop, John Commindinger, Union Hotel, Richmond County Hall, Walter Betts, James Guyon, Henry I. Seaman, County Clerk's and Surrogate's Office, Treasure House, Prier Family, Schaeffer Hotel, District Attorney's Office, Flake Family, John Schwiebert, Marsh Carraige Factory, The Dobler Hotel, Bedell-Ketchum Mill Site, Woods Mill Site, Whitlock, Publich School No. 28, Richmond Hill, La Tourette Park, Richmond Creek",
                        "Oakley House, Brooklyn Edison Electric Company, Winant House, Charles H. Selick, Inc., The Hadkins Bottling Co., Owens Illonois Glass Company, Applefield Beverages, Weissglass Goldseal Dairy Corporation, Anchor Pottery, J.R. Stafford's Olive Tar, Seabury's Cough Balsam, J.T. Lane's Liniment, Clark and White, Peter Woglom, John Woglom, Elisha Parker, Peter Mangleson, George Lockhart, Thomas Williams, Peter Wynant, James J. Winant, Peter Perine, Mary Perine, Henry S. Rutan, William Henry Rutan, James Rutan, Abraham R. Luyster, Rachel Rutan, Henry Mason, George W. Woglom, William J. Shea, John Marshall, Malanchon F. Rutan, Matthew Van Zandt, Mary Jane Winant, Henry R. Winant, James Winant Jr., Marietta Winant, Ann McCall, Julianna Winant, Eliza McMullen, Joseph A. Loage, Isaac J. Winant, Isaac Oakley Jr., Gabriel Dissosway, Catherine Rutrie, Alan Rutrie, James H.W. Hotchkins, William Hotchkins, Anderson Bedell, Agnes Woodland, Effie Winant, Amelia Winant, Mary Winant, Ella Keltz, P.L. Cortelyou, Edison Electric Illuminating Company of Brooklyn, William R. Rust, Julia A. Windsor, Marietta Hotchkin, Marie W. Yela, Valia C. Crocheron, Tully & Dinapoli Inc., Mason Mansion",
                        "Arthur Kill Reach, Kill Van Kull Reach, Kreischer Brick Works, American Linoleum Manufacturing Company, Atlantic Terra Cotta Company, Tottenville Copper, Blazing Star Ferry, New Blazing Star Ferry, Carteret Ferry Company, Kirchner Brothers, Staten Island Railway Company, The Baltimore & Ohio, Staten Island Rapid Transit, Prince's Bay, A.C. Brown, J.S. Ellis, Vigliarulo Brothers, Fresh Kills Landfill, Verrazano Bridge, West Shore Expressway, Witte Marine Equipment Company,   Goethals Bridge, Outerbridge Crossing Bridge, Consolidated Edison, Charles F. Vachris pier, Gulfport, William Spencer & Sons pier, Staten Island Oil Co. pier, Carteret Ferry Shipyard wharf, Oakland Chemical Company pier, Moran Towing and Transportation Company, A. Kreusler Stonecutting, Staten Island Shipbuilding Co., M & J Tracy Co., Tottenville Shipyard Co., James O'Boyle Shipyard, Townsend Transportation Co., H.R. Yetman, Transatlantic Shipyard Corp., Stephen H. Cossey pier, Tottenville Holding Co., Seguine, Runyon, & Stie Co., Namee pier, DeHart pier, D.A. Joline, A.C. Brown & Sons Shipyard, Manahata Club"
                    ],
                    "average_length": 83.46458141674333
                }
            ]
        }
    ],
    "key_column_candidates": []
}