{
    "dataset_name": "k233-bk49",
    "columns": [
        {
            "column_name": "Agency Name",
            "number_non_empty_cells": 296,
            "number_empty_cells": 0,
            "number_distinct_values": 37,
            "frequent_values": [
                "Office of the Comptroller (COMPTROLLER)",
                "Department of Health and Mental Hygiene (DOHMH)",
                "Department of Education (DOE)",
                "Office of the Manhattan Borough President (MBPO)",
                "Human Resource Administration (HRA)"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 296,
                    "shortest_values": [
                        "NYC Recovery",
                        "Law Department (LAW)",
                        "Department of Finance (DOF)",
                        "New York City Council (NYCC)",
                        "Department of Education (DOE)"
                    ],
                    "longest_values": [
                        "Department of Information Technology and Telecommunications (DoITT)",
                        "Department of Housing Preservation and Development (HPD)",
                        "Department of Records and Information Services (DORIS)",
                        "Department of Citywide Administrative Services (DCAS)",
                        "Office of Administrative Trials and Hearings (OATH)"
                    ],
                    "average_length": 38.513513513513516
                }
            ]
        },
        {
            "column_name": "Data Set Title",
            "number_non_empty_cells": 296,
            "number_empty_cells": 0,
            "number_distinct_values": 294,
            "frequent_values": [
                "Qualified Provider List",
                "Event Fee Schedule",
                "Data Dashboard",
                "Manhattan River Crossings ",
                "OpenRecords FOIL Responses"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 296,
                    "shortest_values": [
                        "CPRR",
                        "JobStat",
                        "Appeals",
                        "Bed Bugs",
                        "ARTSACP7"
                    ],
                    "longest_values": [
                        "RBIS) Administrative (i.e. local fire house) Risk Based Building inspections completed by inspection type/Number of risk buildings inspected",
                        "Labor Law  §230 and NYC Administrative Code  §6-130 Prevailing Wage Schedule for Building Service Employees",
                        " Monthly Performance Management Reports (includes Corruption Lectures and Customer Service indicators)",
                        "Demographic Profiles of ACS 5 Year Estimates at the Neighborhood Tabulation Area (NTA) level ",
                        "Demographic Profiles of ACS 5 Year Estimates at the Public Use Microdata Areas (PUMA) level"
                    ],
                    "average_length": 32.34121621621622
                }
            ]
        },
        {
            "column_name": "Data Set Description",
            "number_non_empty_cells": 296,
            "number_empty_cells": 0,
            "number_distinct_values": 280,
            "frequent_values": [
                "TBD",
                "Reports the total count of disciplinary responses in SY2015-2016 by school broken down in various categories such as race/ethnicity, gender, grade level, IEP status, ELL, STH and others. In addition, we report out a total count of EMS transports and EMS transports for emotional/psychological conditions for students by district broken down by race, IEP, and age. (Local Law 93)",
                "Program receipt by borough and community district.",
                "Schedule of event fees at rentable DCAS-managed properties",
                "List of all security guard vendors identified as a qualified provider for use by participating schools in DCAS' administration of the Non-Public School Security Guard Reimbursement Program"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 296,
                    "shortest_values": [
                        "TBD",
                        "Grantees",
                        "Arts Report",
                        "HS At a Glance",
                        "Mainframe file."
                    ],
                    "longest_values": [
                        "The City suspends alternate side parking (street cleaning) regulations, for both street cleaning purposes and traffic flow, on the 34 legal and religious holidays. This includes suspension of street cleaning regulations at metered spaces. This policy is implemented jointly by the Department of Transportation, the Department of Sanitation, and the Police Department. On major legal holidays, No Stopping, No Standing, and No Parking regulations are suspended, except where those regulations are normally in effect seven days a week. On all other holidays, only Street Cleaning Rules are suspended. All other regulations remain in effect. Parking meter regulations will be suspended on major legal holidays. ",
                        "EpiQuery: The HIV EpiQuery module includes data on new diagnoses of HIV and AIDS in NYC; persons living with HIV/AIDS (PLWHA) in NYC; and deaths among persons with HIV/AIDS for the calendar years 2006 through 2013. Reported cases and case rates (per 100,000 population) and deaths and crude death rates (per 1,000 PWHA) are available by select variables: demographic (sex, race/ethnicity, age group, and place of birth), HIV transmission risk, and geographic (citywide and by borough, United Hospital Fund (UHF) neighborhood, high-risk neighborhood, and area-based poverty level).",
                        "The NYCgov poverty measure differs from the official U.S. poverty measure. The poverty threshold is based on national spending on food, clothing, shelter and utilities, adjusted for the higher cost of housing in New York City. The income measure incorporates the value of programs intended to alleviate poverty; such as the Supplemental Nutritional Assistance Program (SNAP) and the Earned Income Tax Credit. Annual data files consist of American Community Survey microdata augmented with variables generated by NYC Opportunity to create the NYCgov poverty measure.",
                        "This dataset contains select monthly performance statistics that DOI regularly reports to the Mayor's Office of Operations for 2016. This dataset includes several indicators that are cumulated for the Mayor's Management Reports, such as the including numbers of complaints received by the Agency and the numbers of arrests made.  This dataset also includes monthly statistics on the Agency's outreach efforts (anticorruption and whistleblower lectures) as well customer service indicators (such as the number of emails received by the Agency).  ",
                        "The dataset contains the total number and language breakdown of active and new subscribers to the CoveredNYC/SeguroNYC health insurance enrollment texting campaign. Subscribers receive text messages with a list of locations where they can enroll in health insurance throughout the year, and reminders to enroll during the Open Enrollment period.  Subscribers can text “CoveredNYC” (English campaign) or “SeguroNYC” (Spanish campaign) to 877-877 to find the closest in-person enrollment assistance near them."
                    ],
                    "average_length": 99.71283783783784
                }
            ]
        },
        {
            "column_name": "Update Frequency",
            "number_non_empty_cells": 296,
            "number_empty_cells": 0,
            "number_distinct_values": 16,
            "frequent_values": [
                "Annually",
                "Monthly",
                "Quarterly",
                "Daily",
                "As Needed"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 296,
                    "shortest_values": [
                        "TBD",
                        "Daily",
                        "Weekly",
                        "Monthly",
                        "Annually"
                    ],
                    "longest_values": [
                        "Approximately 3 times per year",
                        "Only published for summer",
                        "Semi-Annually",
                        "Semi-annually",
                        "Quarterly "
                    ],
                    "average_length": 8.08108108108108
                }
            ]
        },
        {
            "column_name": "Release Date",
            "number_non_empty_cells": 296,
            "number_empty_cells": 0,
            "number_distinct_values": 40,
            "frequent_values": [
                "12/31/2018",
                "12/30/2017",
                "11/03/2017",
                "12/01/2017",
                "09/30/2017"
            ],
            "data_types": [
                {
                    "type": "DATE/TIME",
                    "count": 296,
                    "max_value": "2018-12-31 00:00:00",
                    "min_value": "2017-07-30 00:00:00"
                }
            ]
        },
        {
            "column_name": "Date Status",
            "number_non_empty_cells": 296,
            "number_empty_cells": 0,
            "number_distinct_values": 3,
            "frequent_values": [
                "New",
                "No Change",
                "Updated"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 296,
                    "shortest_values": [
                        "New",
                        "Updated",
                        "No Change"
                    ],
                    "longest_values": [
                        "No Change",
                        "Updated",
                        "New"
                    ],
                    "average_length": 4.621621621621622
                }
            ]
        },
        {
            "column_name": "Agency Comment",
            "number_non_empty_cells": 27,
            "number_empty_cells": 269,
            "number_distinct_values": 20,
            "frequent_values": [
                "Need time to process the data.",
                "Delays in system implementation.",
                "Reprioritization to reflect agency needs",
                "Additional data quality review required",
                "Data being reviewed for security concerns."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 27,
                    "shortest_values": [
                        "Staff Turnover",
                        "Staffing resources very tight",
                        "Need time to process the data.",
                        "Delays in system implementation.",
                        "Additional data quality review required"
                    ],
                    "longest_values": [
                        "Restructured from the previously titled Street Furniture and Pavement Markings dataset. Street Furniture is actually multiple datasets. Currently, Bus Stop Shelters, Bicycle Parking, and City Benches datasets are available on the portal. Additional, Street Furniture datasets will be individually added in 2018.",
                        "Administrative Burden. The Office of Vital Stats does not have an automated system to produce this data.  Once there system is up and running the topic will be revisited. ",
                        "Delays in system implementation. Restructured as Reportable Disease Surveillance Data/HIV/AIDS Diagnoses by Neighborhood, Age Group, and Race/Ethnicity",
                        "Additional time is required to assess both proper definitions of operational indicators, and to determine feasibility of transmission of data.",
                        "System does not currently allow data collection at necessary level of detail; automated transmission of data not currently possible."
                    ],
                    "average_length": 74.14814814814815
                }
            ]
        }
    ],
    "key_column_candidates": []
}