{
    "dataset_name": "68rr-d3jr",
    "columns": [
        {
            "column_name": "Service Area",
            "number_non_empty_cells": 59,
            "number_empty_cells": 0,
            "number_distinct_values": 59,
            "frequent_values": [
                "Dental Services",
                "Legal Services",
                "Respite Care",
                "Entitlements Assistance",
                "Job Placement Services"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 59,
                    "shortest_values": [
                        "Shelter",
                        "Housing",
                        "Nursing",
                        "Literacy",
                        "Outreach"
                    ],
                    "longest_values": [
                        "Emergency Preparedness and Response",
                        "Court Appointed Guardian Services",
                        "Alternative Justice Management",
                        "Conflict Resolution/Mediation",
                        "Health Education and Supports"
                    ],
                    "average_length": 18.11864406779661
                }
            ]
        },
        {
            "column_name": "Service Description",
            "number_non_empty_cells": 59,
            "number_empty_cells": 0,
            "number_distinct_values": 59,
            "frequent_values": [
                "Restitution Collections consist of services to secure financial compensation for victims. Restitution Collections providers may be responsible for contacting victims to determine loss amounts, investigating the offender's assets, helping the victim present a restitution request to the appropriate authorities, reporting findings to the court, monitoring payments of restitution and/or employing a variety of legally sanctioned methods (such as tax liens and judgment orders) to recover losses for victims in situations where the offender fails to make payments as agreed. Examples include Restitution Oversight and Restitution Database Management.",
                "Disease Control consists of services to prevent, detect and stop the progress of diseases affecting the general or specific populations. Disease Control services may include immunizations, testing and information. Examples include Disease Prevention services and Testing.",
                "Job/Vocational Training consists of services to develop or enhance skills needed to meet the hiring requirements of industries/employers and participate in the workforce. Job/Vocational Training may be provided to obtain specific credentials or more general skill sets. Examples include Credential Based Training, Customized Training, Entrepreneurial Training, On-the-Job Training and Sheltered Workshops.",
                "Language Skills consists of services to provide educational programming to facilitate the acquisition of language skills. Language Skills services are often provided to clients with limited native language literacy and limited proficiency in speaking, reading and writing English. Language Skills services may also help clients develop basic reading and writing skills in their native language in addition to English. Examples include English as a Second Language (ESL) courses, English for Speakers of Other Languages (ESOL) courses and Basic Education in Native Language (BENL) courses.",
                "Respite Care consists of short-term, temporary care provided by a trained respite worker or nurse for the purpose of supporting parents and other caregivers who may otherwise be overwhelmed by the intensity and constancy of caregiving responsibilities. Respite Care services are often provided for parents of children with special needs and are not intended to substitute for day care while a parent/caregiver is working or attending school, or to replace ongoing nursing or homemaking services. Examples include Group Respite Care, such as a weekend or summer camp program and Individual Respite Care, such as home-based temporary care."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 59,
                    "shortest_values": [
                        "Pregnancy Services consist of services for pregnant women and women with newborns to promote healthy pregnancies and families. Examples include Neo-Natal and Pre-Natal Care.",
                        "Health Education and Supports consist of information and guidance in areas that affect community health. Examples include Health Care Access Services, Health Promotion, and Nutrition Education and Counseling.",
                        "Diagnostic Testing consists of services provided to obtain objective evidence of the presence of a condition and determine diagnosis. Examples include HIV/AIDS Testing, Mental Health Assessment, and Hearing Testing.",
                        "Dental Services consist of preventive and clinical dentistry services provided by dentists, dental hygienists and technicians to prevent and treat oral disease and injury. Examples include Dental Cleaning, Examination, and Treatment.",
                        "Literacy consists of services to provide clients with reading, writing, speaking, and math skills that are critical to academic achievement and/or career development. Examples include Adult Basic Education, Literacy Classes, and Math Courses."
                    ],
                    "longest_values": [
                        "Case Management consists of services to help persons and families achieve or maintain optimum social, psychological, and physical functioning by planning, securing, coordinating, and monitoring services from different organizations and personnel on behalf of those served. Case Management may include services to establish and maintain client engagement in needed services. Services may also include client team communications to facilitate the exchange of information between two or more parties in relation to the status of or service delivery to a client. Examples include Advocacy (Community and Individual), Aftercare, Case Assistance, Case Conferencing, Client Evaluation/Assessment, Client Monitoring, Client Referrals, Counseling, Crisis Intervention/Management, Diversion Services, Intake, Safety Planning, Service/Care Planning and Transition/Discharge Planning.",
                        "Substance Abuse Services consist of health services to support the diagnosis, treatment, and prevention of drug and alcohol abuse and compulsive gambling. Substance Abuse Services may also include services to reduce harms from drug and alcohol use and to improve the health of people who use drugs. Examples include Medically Supervised/Monitored Withdrawal, Medically Managed Detoxification, Inpatient Rehabilitation, Community Residential Treatment, Post Treatment Housing, Recovery Community Centers, Recovery Community Organizing Initiative, Residential Rehabilitation, Intensive Residential Services, Opioid Treatment, Methadone Maintenance, Methadone to Abstinence, Managed Addiction Treatment Services, Medically Supervised Outpatient Services, Outpatient Rehabilitation, Compulsive Gambling Treatment, Overdose Prevention, and Naloxone Treatment.",
                        "Job Placement Services provide clients with access to job placements that will allow clients to participate in the workforce immediately or following appropriate assessment or training. Job Placement types range, including direct employment, post-secondary education, or vocational training. Services may also include building relationships with placement providing organizations, conducting job searches and matching for clients and working with clients to understand workforce interests and goals. Successful placements allow clients to enhance their career options and workforce participation. Examples include Career Exploration, Employer Recruitment, Internship, Job Search, Job Matching, Placement Development, Post Placement Support/Retention Services, Transitional Employment and Volunteering.",
                        "Preventive Services consist of support and intervention provided to promote behaviors, activities, treatment and services in order to prevent harmful outcomes. Preventive Services provide support necessary to avoid the displacement of a child or family, involvement in the criminal and juvenile justice systems, domestic abuse, child abuse and neglect, substance abuse,health issues and disease, untreated mental illness. Preventive Services may include crisis intervention, family mediation, community-based wrap-around and other services aimed at preventing negative outcomes. Examples include Substance Abuse Prevention, Child Abuse Prevention, Disease Prevention, PINS Diversion, Harm Reduction Counseling, Criminal Justice Prevention and Services for those at risk.",
                        "Transportation consists of vehicular services to carry individuals from one place to another. Transportation services may include facilitation of reservations, dispatch, vehicular routing, private transportation, and passenger pick-up for individuals or groups in a secure or non-secure setting. Transportation services are targeted towards persons who require such service because their destination is beyond their walking (or driving) ability and they have no alternative means of transportation, or because public transportation is beyond the individual's abilities. Transportation may also be provided to staff traveling to clients in need of community-based services. Examples include Group Transportation, Individual Transportation, and Secure Transportation."
                    ],
                    "average_length": 443.135593220339
                }
            ]
        }
    ],
    "key_column_candidates": [
        "Service Description"
    ]
}