{
    "dataset_name": "6ctv-n46c",
    "columns": [
        {
            "column_name": "File #",
            "number_non_empty_cells": 1000,
            "number_empty_cells": 0,
            "number_distinct_values": 1000,
            "frequent_values": [
                "Res 0488-2014",
                "Res 0314-2014",
                "T2014-1058",
                "M 0180-2014",
                "Res 0448-2014"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1000,
                    "shortest_values": [
                        "T2015-2283",
                        "T2014-1128",
                        "T2014-1718",
                        "T2014-1705",
                        "T2014-1852"
                    ],
                    "longest_values": [
                        "Int 0311-2014",
                        "Res 0417-2014",
                        "Int 0443-2014",
                        "Res 0410-2014",
                        "Int 0476-2014"
                    ],
                    "average_length": 12.194
                }
            ]
        },
        {
            "column_name": "Law Number",
            "number_non_empty_cells": 23,
            "number_empty_cells": 977,
            "number_distinct_values": 23,
            "frequent_values": [
                "2014/033",
                "2014/054",
                "2014/063",
                "2014/061",
                "2014/066"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 23,
                    "shortest_values": [
                        "2014/063",
                        "2014/065",
                        "2014/020",
                        "2014/038",
                        "2014/062"
                    ],
                    "longest_values": [
                        "2014/061",
                        "2014/067",
                        "2014/059",
                        "2014/058",
                        "2014/068"
                    ],
                    "average_length": 8.0
                }
            ]
        },
        {
            "column_name": "Type",
            "number_non_empty_cells": 1000,
            "number_empty_cells": 0,
            "number_distinct_values": 9,
            "frequent_values": [
                "Resolution",
                "Introduction",
                "Oversight",
                "Communication",
                "Land Use Application"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1000,
                    "shortest_values": [
                        "SLR",
                        "Tour",
                        "Oversight",
                        "Resolution",
                        "Introduction"
                    ],
                    "longest_values": [
                        "Land Use Application",
                        "Land Use Call-Up",
                        "Mayor's Message",
                        "Communication",
                        "Introduction"
                    ],
                    "average_length": 12.146
                }
            ]
        },
        {
            "column_name": "Status",
            "number_non_empty_cells": 1000,
            "number_empty_cells": 0,
            "number_distinct_values": 7,
            "frequent_values": [
                "Committee",
                "Adopted",
                "Filed",
                "Laid Over in Committee",
                "Enacted"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1000,
                    "shortest_values": [
                        "Filed",
                        "Adopted",
                        "Enacted",
                        "Committee",
                        "Laid Over in Committee"
                    ],
                    "longest_values": [
                        "Received, Ordered, Printed and Filed",
                        "Enacted (Mayor's Desk for Signature)",
                        "Laid Over in Committee",
                        "Committee",
                        "Enacted"
                    ],
                    "average_length": 8.643
                }
            ]
        },
        {
            "column_name": "Final Action",
            "number_non_empty_cells": 494,
            "number_empty_cells": 506,
            "number_distinct_values": 81,
            "frequent_values": [
                "06/25/2014 12:00:00 AM",
                "11/25/2014 12:00:00 AM",
                "06/26/2014 12:00:00 AM",
                "07/24/2014 12:00:00 AM",
                "08/21/2014 12:00:00 AM"
            ],
            "data_types": [
                {
                    "type": "DATE/TIME",
                    "count": 494,
                    "max_value": "2014-12-17 00:00:00",
                    "min_value": "2014-05-14 00:00:00"
                }
            ]
        },
        {
            "column_name": "Title",
            "number_non_empty_cells": 1000,
            "number_empty_cells": 0,
            "number_distinct_values": 987,
            "frequent_values": [
                "Resolution approving the new designation and changes in the designation of certain organizations to receive funding in the Expense Budget.",
                "Application No. 20155248 HAM submitted by the New York City Department of Housing Preservation and Development pursuant to Section 577 of the Private Housing Finance Law for a real property tax exemption for properties located at 538-548 West 53rd Street (Block 1081, part of Lot 1), Borough of the Manhattan, Community Board 4, Council District 3.",
                "Application No. C 110122 ZMR, submitted by the Estate of Letizia Sollazzo pursuant to Sections 197-c and 201 of the Charter for the amendment of the Zoning Map, Section No. 20d, eliminating a C1-1 District from within an existing R3-2 District and establishing a C1-2 within an existing R3-2 District, in between Mariner’s Harbor and Elm Park areas, Borough of Staten Island, Community Board 1, Council District 49.",
                "Communication from the Office of Management & Budget - Transfer City funds between various agencies in Fiscal Year 2014 to implement changes to the City's expense budget, pursuant to Section 107(b) of the New York City Charter. (MN-4)",
                "Application No. 20155176 HAM, submitted by the New York City Department of Housing Preservation and Development for approval of an amendment to a previously approved tax exemption pursuant to Section 577 of the Private Housing Finance Law (PHFL) for a property located at 304-306 East 8th Street, Block 390, Lot 9, Borough of Manhattan, Community Board 3, Council District 2."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1000,
                    "shortest_values": [
                        "Oversight: Medicaid Redesign",
                        "Oversight: Afterschool Programs",
                        "Oversight: Hunger in New York City",
                        "Oversight - Aging out of Foster Care.",
                        "Oversight - DSNY’s 2015-16 Snow Plan"
                    ],
                    "longest_values": [
                        "Resolution approving the application submitted by the New York City Department of Housing Preservation and Development (“HPD”) and the decision of the City Planning Commission, ULURP No. C 140386 HAM, approving the designation of the properties located at 726/728 11th Avenue and 553/55 West 51st Street (Block 1080, Part of Lot 103), Borough of Manhattan, as an Urban Development Action Area, approving an Urban Development Action Area Project, and approving the disposition of city-owned properties located at 726/728 11th Avenue and 553/55 West 51st Street (Block 1080, Part of Lot 103) to a devel",
                        "Resolution calling on the Mayor, the Mayor’s Office of Environmental Coordination, the New York City Planning Commission, the New York City Department of City Planning, and all other relevant City agencies to re-examine the standards in the CEQR regulations and the Technical Manual for assessing when a possible adverse impact on a neighborhood’s character or socioeconomic status requires a detailed analysis and possible mitigation, and calling on the relevant agencies, when such significant adverse impacts are identified, consistently to seek mitigation or development alternatives that provide",
                        "A Local Law in relation to the naming of 63 thoroughfares and public places, Rev. Dr. Shellie Sampson, Jr. Way, Borough of the Bronx, Sister Thomas, S.C Way, Borough of the Bronx, Dominican Sisters of Sparkill Place, Borough of the Bronx, Lillie F. Martin Lane, Borough of Brooklyn, El Grito de Lares, Borough of the Bronx, Dashane Santana Way, Borough of Manhattan, Ed Eisenberg Way, Borough of Brooklyn, Bishop Dr. Ezra Nehemiah Williams Way, Borough of Manhattan, Manny “The Wrong Man” Balestrero Way, Borough of Queens, Msgr. John T. Peyton Avenue, Borough of Brooklyn, P. O. Robert M. Ehmer Pla",
                        "Resolution approving the application submitted by the New York City Department of Housing Preservation and Development (“HPD”) and the decision of the City Planning Commission, ULURP No. C 140278 HAK, approving the designation of the properties located at 768/770 Decatur Street and 1696/1712 Broadway (Block 1507, Lots 32, 33, 35, 36, 37, 39 and 41), Borough of Brooklyn, as an Urban Development Action Area, approving an Urban Development Action Area Project, and approving the disposition of city-owned properties located at 768/770 Decatur Street and 1696/1712 Broadway (Block 1507, Lots 32, 33,",
                        "Resolution approving the application submitted by the New York City Department of Housing Preservation and Development (“HPD”) and the decision of the City Planning Commission, ULURP No. C 140185 HAM, approving the designation of property located at 530-548 West 53rd Street (Block 1081, Part of Lot 1), 543-551 West 52nd Street (Block 1081, Part of Lot 1) and 556-560 West 52nd Street (Block 1080, Part of Lot 103), Borough of Manhattan, as an Urban Development Action Area, approving an Urban Development Action Area Project, and approving the disposition of city-owned property located at 530-548"
                    ],
                    "average_length": 238.354
                }
            ]
        }
    ],
    "key_column_candidates": [
        "File #"
    ]
}