{
    "dataset_name": "8pnf-vysd",
    "columns": [
        {
            "column_name": "Agency Name",
            "number_non_empty_cells": 83,
            "number_empty_cells": 0,
            "number_distinct_values": 14,
            "frequent_values": [
                "Office of the Comptroller (COMPTROLLER)",
                "Department of Health and Mental Hygiene (DOHMH)",
                "Department of Education (DOE)",
                "Office of the Manhattan Borough President (MBPO)",
                "Department of Consumer Affairs (DCA)"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 83,
                    "shortest_values": [
                        "Department of Finance (DOF)",
                        "Department of Education (DOE)",
                        "Department of Transportation (DOT)",
                        "Taxi and Limousine Commission (TLC)",
                        "Department of Consumer Affairs (DCA)"
                    ],
                    "longest_values": [
                        "Department of Records and Information Services (DORIS)",
                        "Office of the Manhattan Borough President (MBPO)",
                        "Department of Health and Mental Hygiene (DOHMH)",
                        "Department of Design and Construction (DDC)",
                        "Department of Parks and Recreation (DPR)"
                    ],
                    "average_length": 39.036144578313255
                }
            ]
        },
        {
            "column_name": "Data Set Title",
            "number_non_empty_cells": 83,
            "number_empty_cells": 0,
            "number_distinct_values": 83,
            "frequent_values": [
                "New York City Employees' Retirement System Performance Review",
                "Mobile Services Study",
                "Labor Law Â§220(3-e)  Apprenticeship Prevailing Wage Schedule",
                "Comprehensive Annual Financial Report",
                "pdf Community Board Application"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 83,
                    "shortest_values": [
                        "CPRR",
                        "Appeals",
                        "Bed Bugs",
                        "Benefit Log",
                        "School Data"
                    ],
                    "longest_values": [
                        "Labor Law  Â§230 and NYC Administrative Code  Â§6-130 Prevailing Wage Schedule for Building Service Employees",
                        "New York City Employees' Retirement System Common Investment Meeting Supplemental Material",
                        "New York City Fire Department Pension Fund Common Investment Meeting Supplemental Material",
                        "New York City Police Superior Officers' Variable Supplements Fund Total Fund Overview",
                        "Board of Education Retirement System Common Investment Meeting Supplemental Material"
                    ],
                    "average_length": 39.2289156626506
                }
            ]
        },
        {
            "column_name": "Dataset Description",
            "number_non_empty_cells": 83,
            "number_empty_cells": 0,
            "number_distinct_values": 80,
            "frequent_values": [
                "To Be Determined.",
                "Student Discipline.",
                "Information about the age and race of shelter clients, entrants borough of origin, shelter exits, number of school-age children, school attendance, the placement of families by youngest school-aged child's school address, outreach placements, and prevention enrollments.",
                "Details about claims of non-payment for labor or materials provided to a government contractor or subcontractor.",
                "Master List of all TLC-licensed vehicles."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 83,
                    "shortest_values": [
                        "To Be Determined.",
                        "Student Discipline.",
                        "MATH Data Files by Grade.",
                        "List of Baby Friendly Hospitals.",
                        "School Data for years 2015-2017."
                    ],
                    "longest_values": [
                        "The City suspends alternate side parking (street cleaning) regulations, for both street cleaning purposes and traffic flow, on the 34 legal and religious holidays. This includes suspension of street cleaning regulations at metered spaces. This policy is implemented jointly by the Department of Transportation, the Department of Sanitation, and the Police Department. On major legal holidays, No Stopping, No Standing, and No Parking regulations are suspended, except where those regulations are normally in effect seven days a week. On all other holidays, only Street Cleaning Rules are suspended. All other regulations remain in effect. Parking meter regulations will be suspended on major legal holidays.",
                        "Comprehensive Annual Financial Report for the City of New York, which includes the Comptroller's letter of transmittal, independent auditor's report, management's discussion and analysis of the financial activities of New York City, government-wide and fund financial statements, fiduciary fund statements, general and capital fund schedules of revenues and expenditures, and additional financial trends and statistical information.",
                        "Estimated number of adults who reported experiencing noise disruption three or more times per week, rounded to the nearest 1,000. Disruptive noise exposure is any ambient noise from outside the home that disrupts activities - such as watching television, listening to the radio, having a conversation, or sleeping - of the person who hears it.",
                        "Information on individuals and families by case type; the ethnicity of shelter clients; the number of shelter entrants by borough; the number of shelter exits; how many school aged children are in shelter; the placements of chronically street homeless individuals; and prevention enrollments.",
                        "Information about the age and race of shelter clients, entrants borough of origin, shelter exits, number of school-age children, school attendance, the placement of families by youngest school-aged child's school address, outreach placements, and prevention enrollments."
                    ],
                    "average_length": 104.89156626506023
                }
            ]
        },
        {
            "column_name": "Update Frequency",
            "number_non_empty_cells": 83,
            "number_empty_cells": 0,
            "number_distinct_values": 9,
            "frequent_values": [
                "Annually",
                "Quarterly",
                "Monthly",
                "As Needed",
                "Semi-annually"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 83,
                    "shortest_values": [
                        "Weekly",
                        "Monthly",
                        "Annually",
                        "As Needed",
                        "Quarterly"
                    ],
                    "longest_values": [
                        "Approximately 3 times per year",
                        "To Be Determined",
                        "Semi-annually",
                        "Historical",
                        "Quarterly"
                    ],
                    "average_length": 9.156626506024097
                }
            ]
        },
        {
            "column_name": "Release Date",
            "number_non_empty_cells": 83,
            "number_empty_cells": 0,
            "number_distinct_values": 16,
            "frequent_values": [
                "11/03/2017",
                "12/31/2018",
                "12/01/2017",
                "12/30/2017",
                "10/20/2017"
            ],
            "data_types": [
                {
                    "type": "DATE/TIME",
                    "count": 83,
                    "max_value": "2018-12-31 00:00:00",
                    "min_value": "2017-07-30 00:00:00"
                }
            ]
        },
        {
            "column_name": "Agency Comment",
            "number_non_empty_cells": 83,
            "number_empty_cells": 0,
            "number_distinct_values": 41,
            "frequent_values": [
                "Report format (PDF) not compatible with Open Data portal requirements. Report is publicly accessible: https://comptroller.nyc.gov/services/financial-matters/pension/library/.",
                "This data was a one time survey conducted by the agency and to release the data will be an administrative burden to the agency.",
                "Dataset does not meet qualifications for “data” as defined by the Local Law 11 of 2012.",
                "NYC bond data now being provided in the Quarterly Bond Update listed under newly identified data sets.",
                "Schedule format (PDF) not compatible with Open Data portal requirements. Schedule is publicly accessible: https://comptroller.nyc.gov/services/for-the-public/nyc-wage-standards/wage-schedules/."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 83,
                    "shortest_values": [
                        "Data not owned by agency.",
                        "Does not meet Open Data requirements.",
                        "Data set is no longer being maintained.",
                        "Duplicate Data Set entry for DHS Data Dashboard.",
                        "Duplicate entry. Please refer to the Math Results."
                    ],
                    "longest_values": [
                        "DOF is the collection agency for 15 Mayoral agencies. CPRR is the repository for the collection of payments made to the City. These payments span across many areas of collection (i.e., parking tickets, property taxes, ECB violations, elevator repairs, FDNY charges, HPD charges, Sanitation charges, DEP charges, etc.). Some data is tax secret and/or private, while other data is already posted onto the Open Data portal (see parking summons data set and property tax dataset). Further, DOF is not the custodial agency for the majority of the payments collected. We do not have any knowledge of why the payment is being collected, the calculations used to arrive at those payment amounts, any penalties assessed, miscellaneous fees, etc. This data comes from the system of record for these payments, not CPRR. For example, STARS is the system of record for parking summons fees. CPRR is responsible for collecting the payment, but has no understanding of the underlying data attached to that payment. STARS data regarding the payment is already distilled and provided within our parking data sets currently on the OD portal. In the alternative, lets say a request is received by DOF regarding elevator charges attached to a property tax bill. DOF is unable to provide any knowledge or understanding as to the nature of that charge. We are only provided with the amount owed by the charging agency. The requestor is referred to DOB for explanation as to the charge and the resulting amount. It is our recommendation that each system of record be responsible for the data surrounding payments and not CPRR. Each agency should have the right to determine what data they provide to the public.",
                        "Several datasets already exist on NYC OpenData to support this and updated daily. Drivers: Medallion Drivers - Active: https://data.cityofnewyork.us/Transportation/Medallion-Drivers-Active/jb3k-j3gpMedallion Drivers - Trained: https://data.cityofnewyork.us/Transportation/Medallion-Drivers-Trained/td5q-ry6dSHL Drivers - Active: https://data.cityofnewyork.us/Transportation/Street-Hail-Livery-Drivers-Active/5tub-eh45For Hire Vehicle Drivers - Active: https://data.cityofnewyork.us/Transportation/For-Hire-Vehicles-FHV-Active-Drivers/xjfq-wh2dFor Hire Vehicles - Active and Inactive: https://data.cityofnewyork.us/Transportation/For-Hire-Vehicles-FHV-Active-and-Inactive-Vehicles/8wbx-tsch.",
                        "The data compiled for this research study do not meet the standard for \"Open Data\" because,-they originate from publicly available or proprietary data sources not maintained by DCA; the research was conducted by third parties; the data was processed and aggregated and therefore represents internal work product; the report is publicly available https://www1.nyc.gov/assets/dca/CitywideFinancialServicesStudy/Research-Brief.pdf)-data visualization tool is publicly available (https://www1.nyc.gov/assets/dca/CitywideFinancialServicesStudy/index.html).",
                        "DOF is the collection agency for these mechanic's liens. We do not generate these liens at DOF. Each agency provides DOF with certain necessary lien information in order to collect against those liens. However, this is all information provided to DOF from the agency that placed the lien onto the vendor. If there are necessary data points that fall outside of the report we currently publish, DOF will be unable to accommodate the request as that data does not belong to DOF, but rather the agency executing the mechanic lien.  .",
                        "The data compiled for this research study do not meet the standard for \"Open Data\" because, they originate from publicly available or proprietary data sources not maintained by DCA; the research was conducted by third parties; the data was processed and aggregated and therefore represents internal work product; the final report is publicly available (https://www1.nyc.gov/assets/dca/MobileServicesStudy/Research-Brief.pdf)-data visualization tool is publicly available (https://www1.nyc.gov/assets/dca/MobileServicesStudy/)."
                    ],
                    "average_length": 186.24096385542168
                }
            ]
        }
    ],
    "key_column_candidates": [
        "Data Set Title"
    ]
}