{
    "dataset_name": "by6m-6zpb",
    "columns": [
        {
            "column_name": "dbn",
            "number_non_empty_cells": 744,
            "number_empty_cells": 0,
            "number_distinct_values": 436,
            "frequent_values": [
                "31R450",
                "31R440",
                "28Q505",
                "31R445",
                "27Q480"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 744,
                    "shortest_values": [
                        "dbn",
                        "18K617",
                        "18K589",
                        "18K576",
                        "18K569"
                    ],
                    "longest_values": [
                        "32K556",
                        "09X263",
                        "08X405",
                        "08X432",
                        "08X452"
                    ],
                    "average_length": 5.995967741935484
                }
            ]
        },
        {
            "column_name": "program",
            "number_non_empty_cells": 744,
            "number_empty_cells": 0,
            "number_distinct_values": 638,
            "frequent_values": [
                "Zoned",
                "Dance",
                "Instrumental Music",
                "Drama",
                "Vocal Music"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 744,
                    "shortest_values": [
                        "Art",
                        "Arts",
                        "STEM",
                        "Zoned",
                        "Media"
                    ],
                    "longest_values": [
                        "International Marketing, Computer Applications, Foreign Trade and Virtual Enterprise",
                        "The Marie Curie High School for Nursing, Medicine, & Allied Health Professions",
                        "CNA Certified Nursing Assistant Program with Phlebotomy and EKG Technician",
                        "City Polytechnic High School of Engineering, Architecture and Technology",
                        "Academy for Scholarship and Entrepreneurship: A College Board School"
                    ],
                    "average_length": 28.547043010752688
                }
            ]
        },
        {
            "column_name": "prgdesc",
            "number_non_empty_cells": 501,
            "number_empty_cells": 243,
            "number_distinct_values": 476,
            "frequent_values": [
                "Humanities & Interdisciplinary",
                "Academic Comprehensive Program",
                "Academic Comprehensive Program.",
                "Computer Science & Technology",
                "Students eligible for Honors classes will be programmed accordingly and would receive an Arts with Honors' Distinction seal to recognize completion of the arts sequence in addition to Honors and Advanced Placement core courses."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 501,
                    "shortest_values": [
                        "prgdesc",
                        "Communications",
                        "Health Professions",
                        "See above description",
                        "See above description."
                    ],
                    "longest_values": [
                        "Non Moving Image: Students develop their artistic skills as they progress through classroom assignments such as still life drawing, perspective drawing, portraiture, figure drawing, and abstract compositions using a variety of drawing, painting, and digital design media. TAPCo students have the opportunity to apply to the Fred Dolan Art Academy, a Saturday professional artist-led program that helps students develop their portfolios and secure scholarships for college. Moving Image: Students develop self-confidence in their creative, critical thinking and expressive process of the student as they build valuable artistic, literacy and technical skills in photography and video production with the added benefit of team building skills for application in college and work place. Students participate in the planning, production and presentation of multi-media projects for actual clients, which include individuals and organizations in and out of school.",
                        "The W.E.B. DuBois Writing Institute is an interdisciplinary program designed for students who are interested in pursuing a college education and a career that applies the skills and content areas of the humanities. Instruction includes learning activities that require all students to think, problem solve, inquire, and defend their opinions. Students will be required to participate and lead school wide activities such as community service, peer tutoring, and internships. They will complete college courses online or at SUNY Hudson Valley Community College, CUNY Lehman College and/or CUNY Hostos Community College, pursue an Advanced Regents Diploma, complete a three year foreign language program, and participate in Advanced Placement courses. Students will receive a laptop for home and school use.",
                        "Our College Head-Start program enables motivated students to earn 10-15 college credits a year in the 11th and the 12th grade while fulfilling their High School graduation requirements through our partnerships with St. John\u0092s University, CUNY College Now Program, SUNY Farmingdale as well as College Board Advanced placement courses. In an effort to minimize the barriers between High School and College, students are supported through our academically challenging curriculum, our free S.A.T. preparation program, our college application and essays writing advisors and our college visits. Students at R.F.K. are also required to complete 50 hours of community service/internship to optimize their chance of getting admitted to the college of their choice.",
                        "The Community Service Academy is a comprehensive four-year program that prepares students for collegiate studies through service. It is our belief that all people, regardless of their socioeconomic status or ethnic background, can make meaningful contributions to humanity by serving others. Included in the rigorous curriculum are Honors and Advanced Placement courses. Our school prepares students for college and beyond though the CUNY College Now Program. Partnerships with: Fordham University, Capital One Bank, New York Cares, The New York Blood Center, Jewish Home Lifecare, Liberty Partnership Program, and numerous other charitable organizations allow our program to offer students a broad range of meaningful experiences.",
                        "The Law Enforcement Academy is a comprehensive four-year program that prepares students for collegiate studies in criminal justice as well as careers in law enforcement and emergency response. Courses including: forensic science, computer forensics, mock trial, moot court, criminology, and first aid are offered alongside rigorous Honors and Advanced Placement courses. Our school prepares students for college and beyond though the CUNY College Now Program. Partnerships with: Fordham University, John Jay College, Hogan-Lovells Law Firm, NYPD, FDNY, FBI, and The Justice Resource Center allow our program to offer students a broad range of practical experience in their chosen area of interest."
                    ],
                    "average_length": 209.04990019960078
                }
            ]
        },
        {
            "column_name": "code",
            "number_non_empty_cells": 744,
            "number_empty_cells": 0,
            "number_distinct_values": 731,
            "frequent_values": [
                "NO CODE",
                "M11R",
                "L59A",
                "Q40F",
                "L49A"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 744,
                    "shortest_values": [
                        "code",
                        "Q97X",
                        "L34A",
                        "K67A",
                        "K67E"
                    ],
                    "longest_values": [
                        "NO CODE",
                        "K36A",
                        "X10A",
                        "X39A",
                        "X38B"
                    ],
                    "average_length": 4.056451612903226
                }
            ]
        },
        {
            "column_name": "interest",
            "number_non_empty_cells": 744,
            "number_empty_cells": 0,
            "number_distinct_values": 22,
            "frequent_values": [
                "Humanities & Interdisciplinary",
                "Performing Arts",
                "Science & Math",
                "Health Professions",
                "Computer Science & Technology"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 744,
                    "shortest_values": [
                        "JROTC",
                        "Zoned",
                        "interest",
                        "Business",
                        "Teaching"
                    ],
                    "longest_values": [
                        "Performing Arts/Visual Art & Design",
                        "Hospitality, Travel and Tourism",
                        "Humanities & Interdisciplinary",
                        "Computer Science & Technology",
                        "Environmental Science"
                    ],
                    "average_length": 20.553763440860216
                }
            ]
        },
        {
            "column_name": "method",
            "number_non_empty_cells": 744,
            "number_empty_cells": 0,
            "number_distinct_values": 10,
            "frequent_values": [
                "Limited Unscreened",
                "Screened",
                "Ed. Opt.",
                "Audition",
                "Screened: Language"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 744,
                    "shortest_values": [
                        "Test",
                        "Zoned",
                        "method",
                        "Screened",
                        "Ed. Opt."
                    ],
                    "longest_values": [
                        "Screened: Language & Academics",
                        "Screened: Language",
                        "Limited Unscreened",
                        "Unscreened",
                        "Audition"
                    ],
                    "average_length": 12.14247311827957
                }
            ]
        },
        {
            "column_name": "eng",
            "number_non_empty_cells": 0,
            "number_empty_cells": 744,
            "number_distinct_values": 0,
            "frequent_values": [],
            "data_types": []
        },
        {
            "column_name": "math",
            "number_non_empty_cells": 0,
            "number_empty_cells": 744,
            "number_distinct_values": 0,
            "frequent_values": [],
            "data_types": []
        },
        {
            "column_name": "soc",
            "number_non_empty_cells": 0,
            "number_empty_cells": 744,
            "number_distinct_values": 0,
            "frequent_values": [],
            "data_types": []
        },
        {
            "column_name": "sci",
            "number_non_empty_cells": 0,
            "number_empty_cells": 744,
            "number_distinct_values": 0,
            "frequent_values": [],
            "data_types": []
        },
        {
            "column_name": "stm",
            "number_non_empty_cells": 176,
            "number_empty_cells": 568,
            "number_distinct_values": 4,
            "frequent_values": [
                "Levels 3-4",
                "Levels 2-4",
                "stm",
                "Levels 1-4"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 176,
                    "shortest_values": [
                        "stm",
                        "Levels 2-4",
                        "Levels 3-4",
                        "Levels 1-4"
                    ],
                    "longest_values": [
                        "Levels 1-4",
                        "Levels 3-4",
                        "Levels 2-4",
                        "stm"
                    ],
                    "average_length": 9.960227272727273
                }
            ]
        },
        {
            "column_name": "ela",
            "number_non_empty_cells": 176,
            "number_empty_cells": 568,
            "number_distinct_values": 4,
            "frequent_values": [
                "Levels 3-4",
                "Levels 2-4",
                "ela",
                "Levels 1-4"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 176,
                    "shortest_values": [
                        "ela",
                        "Levels 2-4",
                        "Levels 3-4",
                        "Levels 1-4"
                    ],
                    "longest_values": [
                        "Levels 1-4",
                        "Levels 3-4",
                        "Levels 2-4",
                        "ela"
                    ],
                    "average_length": 9.960227272727273
                }
            ]
        },
        {
            "column_name": "aud",
            "number_non_empty_cells": 75,
            "number_empty_cells": 669,
            "number_distinct_values": 75,
            "frequent_values": [
                "Each applicant will be required to act, sing and dance at this audition. Please prepare the following: Acting: Present a one-minute memorized monologue (comedic or dramatic) from a published play. Singing: Present 32 bars of a memorized Broadway song (age-appropriate) - an accompanist will be provided, so bring sheet music in the appropriate key. Dancing: Be prepared to learn a short theater dance combination - please wear clothing that allows for freedom of movement, as well as jazz shoes or sneakers.",
                "Students will be asked to perform one piece or excerpt that highlights their ability level on their instrument. Students must bring their own instrument and will be asked to sight-read melodies and rhythms. Amplifiers will be provided for guitar and bass.",
                "Come prepared to sing a song of your choice, without accompaniment. Rhythm, pitch-matching and ability to sing in harmony with others will be evaluated.",
                "A presentation of a one-minute monologue and a cold read to demonstrate creative ability. Further details will be available on the Forest Hills website (www.foresthillshs.org).",
                "Participate in both a ballet and a modern dance class. Dress in appropriate attire; leotard and tights."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 75,
                    "shortest_values": [
                        "aud",
                        "Art students must present a current portfolio.",
                        "Perform a gospel and a classical selection (a capella).",
                        "Theater students must demonstrate interest in the program.",
                        "Auditions will include an interview and individual routine."
                    ],
                    "longest_values": [
                        "DANCE: Come dressed in proper dance attire. Present a short 1-2 minute dance of your choice. You may be asked to learn choreography. Bring your own music. Be prepared to write an essay explaining why you want to attend FHSA. DRAMA: Prepare two contrasting memorized monologues from a play, movie or novel, each one-minute long. You may be asked to participate in a group theater game. Be prepared to write an essay explaining why you want to attend FHSA. INSTRUMENTAL MUSIC: This program offers a jazz curriculum for students who play band and rhythm section instruments. We do not have a string program. Students must bring their own instrument, sticks and music to the audition. Be prepared to play a scale and selection of music from a book or solo of your own choice, and sight-read. You will complete a questionnaire, interview, and take a simple test for musical aptitude. Be prepared to write an essay explaining why you want to attend FHSA. VOCAL MUSIC: Perform a prepared song from the following list: Amazing Grace, Simple Gifts, Shenandoah, My Favorite Things, God Bless America, Happy Birthday and Somewhere without CD/piano accompaniment. Applicants will also be evaluated on tonal memory, rhythmic and aural skills, and vocal technique through teacher-led vocal exercises. Be prepared to write an essay explaining why you want to attend FHSA. VISUAL ART: Prepare and present a portfolio of at least three pieces of original work drawn from real-life observations (one self-portrait, one still-life or landscape and one student\u0092s choice). Students are required to complete one detailed, shaded drawing from observation during the audition. Be prepared to write an essay explaining why you want to attend FHSA.",
                        "All auditioning students should be prepared to partake in a brief interview. Singers: Come prepared to sing a 1-2 minute song of your choice in any style that demonstrates your vocal range (Hip-Hop is not acceptable). Student should be prepared to perform a capella. Dancers: Come prepared to dance in proper attire (leotard and tights). Please bring a CD or MP3 with a prepared 1-2 minute solo (Hip-Hop is not acceptable). Instrumentalists: Be prepared to play a 1-2 minute solo selection or a solo excerpt from a concert or jazz band composition. Actors: Be prepared to recite a short 1-2 minute monologue from memory. You will be asked to do a cold reading with another drama student or evaluator. Visual Artists: Bring a portfolio of your work related to costume and set design; 3-dimensional models and actual costumes are acceptable.",
                        "1) Art, Illustration & Graphics: Submit 5 pieces of original art work; this art work can be submitted either online on the school\u0092s website (www.fashionhighschool.net) or in person at one of the Open House/Audition dates listed. 2) Fashion Design: Submit 5 original fashion illustrations; these fashion illustrations can be submitted either online on the school\u0092s website (www.fashionhighschool.net) or in person at one of the Open House/Audition dates listed,. 3) Business and Visual Merchandising: Submit a 200-word essay describing a student\u0092s favorite store to shop and a visual advertisement for this store; this essay and advertisement can be submitted either online on the school\u0092s website (www.fashionhighschool.net) or in person at one of the Open House/Audition dates listed.",
                        "Selection Criteria \u0095 English (85-100), Math (85-100), Social Studies (85-100), Science (85-100) \u0095 Standardized Test Scores: Math Level(s) 3-4, English Language Arts Level(s) 3-4 \u0095 Interview Audition Information: All students wishing to be considered for admission to Special Music School must register online for an audition. Registration for the audition will begin on October 7, 2013 via the school\u0092s website at www.kaufman-center.org/sms. Students can find specific audition requirements on the school\u0092s website. Students who pass the requirements of the audition will be invited to interview. Students who qualify for the interview will be notified by email.",
                        "Vocal \u0096 Perform at least one prepared selection. There will be an assessment of your musical aptitude consisting of tonal and rhythmic memory and discrimination. Instrumental \u0096 Bring your own instrument (except piano, double bass, tuba, percussion and guitar amplifiers, which will be provided) and perform at least one prepared selection and a scale. Audition will include testing for sight-reading ability and an assessment of musical aptitude consisting of tonal and rhythmic memory and discrimination."
                    ],
                    "average_length": 278.74666666666667
                }
            ]
        },
        {
            "column_name": "seat_gr09",
            "number_non_empty_cells": 736,
            "number_empty_cells": 8,
            "number_distinct_values": 140,
            "frequent_values": [
                "108",
                "81",
                "68",
                "100",
                "54"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 736,
                    "max_value": 1300,
                    "min_value": 10,
                    "mean": 101.9945652173913,
                    "stddev": 100.95788496041575
                }
            ]
        },
        {
            "column_name": "app_gr09",
            "number_non_empty_cells": 669,
            "number_empty_cells": 75,
            "number_distinct_values": 533,
            "frequent_values": [
                "201",
                "183",
                "116",
                "256",
                "41"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 669,
                    "max_value": 23408,
                    "min_value": 2,
                    "mean": 973.3751868460389,
                    "stddev": 2206.159494966727
                }
            ]
        },
        {
            "column_name": "seat_gr10",
            "number_non_empty_cells": 744,
            "number_empty_cells": 0,
            "number_distinct_values": 28,
            "frequent_values": [
                "None",
                "10",
                "5",
                "Zoned",
                "20"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 404,
                    "max_value": 50,
                    "min_value": 0,
                    "mean": 10.344059405940595,
                    "stddev": 7.272145376208352
                },
                {
                    "type": "TEXT",
                    "count": 340,
                    "shortest_values": [
                        "None",
                        "Zoned",
                        "seat_gr10"
                    ],
                    "longest_values": [
                        "seat_gr10",
                        "Zoned",
                        "None"
                    ],
                    "average_length": 4.097058823529411
                }
            ]
        },
        {
            "column_name": "app_gr10",
            "number_non_empty_cells": 744,
            "number_empty_cells": 0,
            "number_distinct_values": 129,
            "frequent_values": [
                "None",
                "Zoned",
                "4",
                "6",
                "16"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 399,
                    "max_value": 1237,
                    "min_value": 0,
                    "mean": 61.16791979949875,
                    "stddev": 140.95721590334296
                },
                {
                    "type": "TEXT",
                    "count": 345,
                    "shortest_values": [
                        "None",
                        "Zoned",
                        "app_gr10",
                        "New Program"
                    ],
                    "longest_values": [
                        "New Program",
                        "app_gr10",
                        "Zoned",
                        "None"
                    ],
                    "average_length": 4.214492753623189
                }
            ]
        },
        {
            "column_name": "req1",
            "number_non_empty_cells": 205,
            "number_empty_cells": 539,
            "number_distinct_values": 28,
            "frequent_values": [
                "Review of Attendance & Punctuality",
                "Writing Sample",
                "Open only to New York City residents living in the United States four years or fewer who are English Language Learners per New York City Department of Education guidelines scoring at the Beginner or Intermediate level on the NYSESLAT or LAB-R.",
                "Admission to this Specialized High School is based solely on the score obtained on the Specialized High Schools Admission Test (SHSAT). Students should speak to their guidance counselors in the Fall to register for the SHSAT. Guidance counselors will provide each student with an Admission Ticket indicating the date, location and time of the SHSAT. The ticket must be presented at the test site. Students should inform their guidance counselor if they are unable to test on the day assigned.",
                "\u0095 Open only to New York City residents who have lived in the United States four years or fewer, whose home language is Spanish and are of limited English proficiency."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 205,
                    "shortest_values": [
                        "req1",
                        "Interview",
                        "Writing Sample",
                        "Academic Portfolio",
                        "Qualifying Assessment"
                    ],
                    "longest_values": [
                        "Admission to this Specialized High School is based solely on the score obtained on the Specialized High Schools Admission Test (SHSAT). Students should speak to their guidance counselors in the Fall to register for the SHSAT. Guidance counselors will provide each student with an Admission Ticket indicating the date, location and time of the SHSAT. The ticket must be presented at the test site. Students should inform their guidance counselor if they are unable to test on the day assigned.",
                        "Open only to New York City residents living in the United States four years or fewer whose home language is Spanish and are English Language Learners per New York City Department of Education guidelines scoring at the Beginner or Intermediate level on the NYSESLAT or LAB-R.",
                        "Open only to New York City residents living in the United States four years or fewer who are English Language Learners per New York City Department of Education guidelines scoring at the Beginner or Intermediate Level on the NYSESLAT or LAB-R.",
                        "Open only to New York City residents living in the United States four years or fewer who are English Language Learners per New York City Department of Education guidelines scoring at the Beginner or Intermediate level on the NYSESLAT or LAB-R.",
                        "Open to Queens students or residents who have lived in the United States one year or less at the time of admission to high school and require English as a Second Language (ESL) or Bilingual instruction"
                    ],
                    "average_length": 71.86829268292684
                }
            ]
        },
        {
            "column_name": "req2",
            "number_non_empty_cells": 70,
            "number_empty_cells": 674,
            "number_distinct_values": 30,
            "frequent_values": [
                "Interview",
                "Review of Attendance & Punctuality",
                "Writing Sample",
                "Qualifying Admissions Test",
                "Qualifying Language Assessment"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 70,
                    "shortest_values": [
                        "req2",
                        "Interview",
                        "Writing Sample",
                        "Student Questionnaire",
                        "On-site writing sample"
                    ],
                    "longest_values": [
                        "Please note: Due to the educational program, consideration is given to encouraging cultural and linguistic diversity. When evaluating applicants, International High School at LaGuardia Community College seeks to build an incoming 9th grade class that is representative of students from all parts of the world.",
                        "Please note: Due to the educational program, consideration is given to encouraging cultural and linguistic diversity. When evaluating applicants, International High School at Prospect Heights seeks to build an incoming 9th grade class that is representative of students from all parts of the world.",
                        "Please note: Due to the educational program, consideration is given to encouraging cultural and linguistic diversity. When evaluating applicants, International High School at Union Square seeks to build an incoming 9th grade class that is representative of students from all parts of the world.",
                        "Please note: Due to the educational program, consideration is given to encouraging cultural and linguistic diversity. When evaluating applicants, International High School at Lafayette seeks to build an incoming 9th grade class that is representative of students from all parts of the world.",
                        "Please note: Due to the educational program, consideration is given to encouraging cultural and linguistic diversity. When evaluating applicants, Claremont International High School seeks to build an incoming 9th grade class that is representative of students from all parts of the world."
                    ],
                    "average_length": 77.71428571428571
                }
            ]
        },
        {
            "column_name": "req3",
            "number_non_empty_cells": 21,
            "number_empty_cells": 723,
            "number_distinct_values": 7,
            "frequent_values": [
                "Interview",
                "Writing Sample",
                "Review of Attendance & Punctuality",
                "req3",
                "New York City resident living in this country four years or fewer of limited English proficiency"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 21,
                    "shortest_values": [
                        "req3",
                        "Essay",
                        "Interview",
                        "Writing Sample",
                        "Review of Attendance & Punctuality"
                    ],
                    "longest_values": [
                        "New York City resident living in this country four years or fewer of limited English proficiency",
                        "Review of Attendance and Punctuality",
                        "Review of Attendance & Punctuality",
                        "Writing Sample",
                        "Interview"
                    ],
                    "average_length": 17.80952380952381
                }
            ]
        },
        {
            "column_name": "req4",
            "number_non_empty_cells": 3,
            "number_empty_cells": 741,
            "number_distinct_values": 3,
            "frequent_values": [
                "Students seeking admission to Beacon must schedule an interview with Beacon faculty.",
                "Student/Parent Interview",
                "req4"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 3,
                    "shortest_values": [
                        "req4",
                        "Student/Parent Interview",
                        "Students seeking admission to Beacon must schedule an interview with Beacon faculty."
                    ],
                    "longest_values": [
                        "Students seeking admission to Beacon must schedule an interview with Beacon faculty.",
                        "Student/Parent Interview",
                        "req4"
                    ],
                    "average_length": 37.333333333333336
                }
            ]
        },
        {
            "column_name": "req5",
            "number_non_empty_cells": 2,
            "number_empty_cells": 742,
            "number_distinct_values": 2,
            "frequent_values": [
                "req5",
                "Portfolio"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 2,
                    "shortest_values": [
                        "req5",
                        "Portfolio"
                    ],
                    "longest_values": [
                        "Portfolio",
                        "req5"
                    ],
                    "average_length": 6.5
                }
            ]
        }
    ],
    "key_column_candidates": [
        "dbn",
        "program"
    ]
}