{
    "dataset_name": "dzrn-z4d7",
    "columns": [
        {
            "column_name": "Agency Name",
            "number_non_empty_cells": 524,
            "number_empty_cells": 0,
            "number_distinct_values": 43,
            "frequent_values": [
                "Department of Education (DOE)",
                "Department of Transportation (DOT)",
                "Department for the Aging (DFTA)",
                "Department of Parks and Recreation (DPR)",
                "Brooklyn Borough President (BBP)"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 524,
                    "shortest_values": [
                        "Law Department (LAW)",
                        "Police Department (NYPD)",
                        "Department of Finance (DOF)",
                        "New York City Council (NYCC)",
                        "Small Business Services (SBS)"
                    ],
                    "longest_values": [
                        "* Denotes datasets originally scheduled for release by the end of 2018 that needed more time for publication.",
                        "Department of Information Technology and Telecommunications (DoITT)",
                        "Department of Housing Preservation and Development (HPD)",
                        "Department of Records and Information Services (DORIS)",
                        "Department of Citywide Administrative Services (DCAS)"
                    ],
                    "average_length": 34.82824427480916
                }
            ]
        },
        {
            "column_name": "Data Set Title",
            "number_non_empty_cells": 523,
            "number_empty_cells": 1,
            "number_distinct_values": 517,
            "frequent_values": [
                "Sea Level Rise Maps (2025s Mean Monthly High Water)",
                "CCPC Closed IAB Investigations– Most Serious Allegations",
                "Complaints Received by CCPC",
                "Sea Level Rise Maps (2020s Mean Monthly High Water)",
                "CCPC rate of agreement with NYPD disciplinary penalties by case type."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 523,
                    "shortest_values": [
                        "TIMS",
                        "JobStat",
                        "Arrests",
                        "HisTree",
                        "GangMenu"
                    ],
                    "longest_values": [
                        "2013-2017 English Language Arts (ELA) Test Results by Grade - School - All Students/Ethnicity/Econ_Status/Gender/Ever_ell/SWD/School Profile",
                        "2013-2017 English Language Arts (ELA) Test Results by Grade - Citywide - All Students/Ethnicity/Econ_Status/Gender/Ever_ELL/SWD",
                        "2013-2017 English Language Arts (ELA) Test Results by Grade - District - All Students/Ethnicity/Econ_Status/Gender/Ever_ELL/SWD",
                        "2013-2017 Math Test Results - School - All Students/Ethnicity/Econ_Status/Gender/Ever_ell/SWD/Math Regents/School Profile",
                        "2013-2017 English Language Arts (ELA) Test Results by Grade - Borough - All Students/Ethnicity/Econ_Status/Gender/ELL/SWD"
                    ],
                    "average_length": 40.009560229445505
                }
            ]
        },
        {
            "column_name": "Data Set Description",
            "number_non_empty_cells": 523,
            "number_empty_cells": 1,
            "number_distinct_values": 442,
            "frequent_values": [
                "Reports to the New York City Council by June 30th the number of students in grade 6 through 12 who were discharged, transferred or graduated during the previous school year.",
                "To Be Determined",
                "Survey aides school leaders understand what key members of school community say about learning environment at each school.  Information captured is to support a dialog among school community on how to make school better place.",
                "Each year the Brooklyn Borough President provides funding in support of various capital projects throughout Brooklyn.",
                "Reports data for annual arts survey for grades 1 through 6, 8th graders who received two half-units of arts instruction in two different disciplines, high school students discharged with a local or regents diploma."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 523,
                    "shortest_values": [
                        "Marking orders",
                        "Mainframe file.",
                        "Manhole Permit.",
                        "To Be Determined",
                        "To Be Determined."
                    ],
                    "longest_values": [
                        "The dataset contains the following information for the Fiscal Year it represents: The Transitional Finance Authority’s (“TFA”) debt-incurring power, excluding Building Aid Revenue Bond financing capacity;  The sources of financing for the City's four-year capital program; The amounts of debt service payable on City General Obligation bonds and TFA Future Tax Secured bonds, amounts expected to be outstanding in each of the Financial Plan years for General Obligation and TFA Future Tax Secured bonds, and various debt service and debt ratios as required by the Transitional Finance Authority Act.  This information is required to be reported pursuant to the Transitional Finance Authority Act.",
                        "DOT Art collaborates with community-based organizations to commission artists to design and install temporary art on DOT property. A minimum of one priority site is identified by local organizations with support from DOT Borough Offices and Operating Units in each borough per application cycle. Selected artists are eligible to receive up to $12,000 towards direct project costs in addition to engineering support. Partner organizations work closely with selected artists throughout the project phases and must agree to maintain the artwork and remediate the site upon completion of the display period. Artwork remains installed for 11 months.",
                        "DOT Art collaborates with volunteer organizations to beautify concrete barriers with bold, colorful murals that are designed by professional artists but painted almost entirely by volunteers. Barriers located along protected bike lanes or active sidewalks serve as canvases for art. DOT Art provides selected artists with a design honorarium of $2,500 and a materials fee of $500 for stencil production. DOT Art provides paint and associated materials at no cost to the artist, and coordinates volunteer recruitment and secures volunteers to implement the mural on a single day in fall and spring. Murals remain installed for 11 months.",
                        "In collaboration with the NYC Department of Cultural Affairs (DCLA) Percent for Art Program, DOT commissions permanent art as part of the Percent for Art ordinance. DOT designates facilities such as: bridges, sidewalks, ferries, medians, plazas, etc. for permanent art as part of DOT capital construction projects. Project-specific selection panels review artists to develop proposals in collaboration with the project design team. DOT selects new sites each year and determines eligibility for permanent artwork. For more information on the DCLA Percent for Art Program, visit: www.nyc.gov/culture.",
                        "The Customers Observing and Reporting Experience (CORE) program is an inspection program that rates facility conditions and customer service at over 300 of the City’s walk-in service centers.  Street Condition Observation Unit (SCOUT) inspectors arrive unannounced at service centers, conduct observations and rate 11 physical conditions and four customer service elements.  Using specific criteria, inspectors rate each condition Excellent, Good, Fair or Poor.  Agencies receive scores for Cleaning & Maintenance, Facility Operations and an Overall score combining the first two."
                    ],
                    "average_length": 120.5583173996176
                }
            ]
        },
        {
            "column_name": "Update Frequency",
            "number_non_empty_cells": 523,
            "number_empty_cells": 1,
            "number_distinct_values": 11,
            "frequent_values": [
                "Historical Data",
                "Annually",
                "To Be Determined",
                "Weekly",
                "Quarterly"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 523,
                    "shortest_values": [
                        "Daily",
                        "Weekly",
                        "Monthly",
                        "Annually",
                        "Quarterly"
                    ],
                    "longest_values": [
                        "To Be Determined",
                        "Historical Data",
                        "Biannually",
                        "Bi-Weekly",
                        "As needed"
                    ],
                    "average_length": 10.58508604206501
                }
            ]
        },
        {
            "column_name": "Release Date",
            "number_non_empty_cells": 523,
            "number_empty_cells": 1,
            "number_distinct_values": 32,
            "frequent_values": [
                "06/30/2019",
                "12/31/2018",
                "12/31/2019",
                "10/31/2018",
                "03/31/2019"
            ],
            "data_types": [
                {
                    "type": "DATE/TIME",
                    "count": 523,
                    "max_value": "2019-12-31 00:00:00",
                    "min_value": "2018-09-28 00:00:00"
                }
            ]
        },
        {
            "column_name": "Date Status",
            "number_non_empty_cells": 523,
            "number_empty_cells": 1,
            "number_distinct_values": 5,
            "frequent_values": [
                "New",
                "Delayed",
                "Delayed*",
                "No Change",
                "No change"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 523,
                    "shortest_values": [
                        "New",
                        "Delayed",
                        "Delayed*",
                        "No Change",
                        "No change"
                    ],
                    "longest_values": [
                        "No change",
                        "No Change",
                        "Delayed*",
                        "Delayed",
                        "New"
                    ],
                    "average_length": 3.948374760994264
                }
            ]
        },
        {
            "column_name": "Agency Comment",
            "number_non_empty_cells": 71,
            "number_empty_cells": 453,
            "number_distinct_values": 36,
            "frequent_values": [
                "In the process of conducting inventory of existing reports, assessing current data and preparing subsequent future reports.",
                "Delays due to extra time needed for assembly of dataset.",
                "Due to system implementation the agency is requiring additional time.",
                "Enterprise data system upgrade, external system integration and shifting agency priorities and resources, staff turnover.",
                "Additional review of data."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 71,
                    "shortest_values": [
                        "Under review.",
                        "Additional review of data.",
                        "Additional structuring of data.",
                        "Cannot capture data before 2016.",
                        "Database does not support automation."
                    ],
                    "longest_values": [
                        "The data from the Current Inventory's Property Valuation and Assessment, Property Valuation Assessment data Tax Classes 2, 3, 4, and Property Valuation and Assessment data Tax Class datasets come from the DOF property legacy system. This data will be reported in this Future Releases Property and Assessment dataset when the new PTS application goes live in January 2019 and becomes the repository for all the property tax information for DOF. At this transition point, the legacy data will still be current until June 2019 when new assessment data will be due and will be created and reported from PTS. This will change the release date to 6/30/2109.",
                        "Given the intention to provide quarterly updates for these reports, and the fact that we still have to nail down requirements, Office of Pupil Transportation is proposing a new schedule of quarterly reports to start on January 1. If that is acceptable, the first “school age ridership” report would be available on 04-01-19.",
                        "Given the intention to provide monthly updates for these reports , and the fact that we still have to nail down requirements, Office of Pupil Transportation is proposing a new schedule of monthly reports to start on January 1. If that is acceptable, the first “mid-day trip” report would be available on 02-01-19.",
                        "The Department requires additional time to assess the capacity of the database in which the data are stored to support an automated feed. DOC will continue to investigate the database’s capabilities and reliability for this type of feed. Developing protocols for automation.",
                        "Due to delays in validating the dataset, DEP will need to push back the release of the Lead Service Line Location Coordinates dataset to 12/31/2018 from the currently scheduled release date of 1/1/2018."
                    ],
                    "average_length": 104.47887323943662
                }
            ]
        }
    ],
    "key_column_candidates": []
}