{
    "dataset_name": "f9a8-4jby",
    "columns": [
        {
            "column_name": "Grade Band",
            "number_non_empty_cells": 95,
            "number_empty_cells": 0,
            "number_distinct_values": 16,
            "frequent_values": [
                "Elementary School - High School",
                "High School",
                "Middle School, High School",
                "Elementary School, Middle School",
                "Middle School"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 95,
                    "shortest_values": [
                        "3-K",
                        "High School",
                        "Kindergarten",
                        "Middle School",
                        "Pre-Kindergarten"
                    ],
                    "longest_values": [
                        "Pre-Kindergarten, Kindergarten, Gifted & Talented",
                        "3-K, Pre-Kindergarten, Kindergarten",
                        "Elementary School, Middle School",
                        "Kindergarten, Gifted & Talented",
                        "Elementary School - High School"
                    ],
                    "average_length": 23.757894736842104
                }
            ]
        },
        {
            "column_name": "Activity",
            "number_non_empty_cells": 95,
            "number_empty_cells": 0,
            "number_distinct_values": 94,
            "frequent_values": [
                "Implemented re-zoning with a focus on diversity",
                "Foster equity-focused conversations and programs in school communities",
                "Conducted additional outreach to populations that have participated in Gifted & Talented at lower rates than students citywide",
                "Launched 3-K programs in districts 7 and 23",
                "Women's History Month celebrated in schools & DOE Central Offices"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 95,
                    "shortest_values": [
                        "Opened Round 2 early",
                        "Expansion of ASD Nest program",
                        "Expanded Dual Language programs",
                        "Expansion of ASD Horizon program",
                        "Equity & Excellence - AP for All"
                    ],
                    "longest_values": [
                        "Specialized High Schools Diversity Initiative - Leverage existing middle school after school programs to implement new Specialized High School Admissions Test preparation programs ",
                        "Specialized High Schools Diversity Initiative -  Improve school climate at the Specialized High Schools to create more welcoming school cultures for diverse learners",
                        "Built a new easy-to-use online tool that lets users search New York City’s hundreds of high school choices by school name, keyword, location, size, and more ",
                        "Specialized High Schools Diversity Initiative - Expand DREAM, a SHSAT preparation program, to serve additional rising 8th grade students in an Intensive program",
                        "Display seat targets and demand information for both General Education and Students with Disabilities in 2018 New York City Middle and High School Directories"
                    ],
                    "average_length": 79.48421052631579
                }
            ]
        },
        {
            "column_name": "Description",
            "number_non_empty_cells": 95,
            "number_empty_cells": 0,
            "number_distinct_values": 95,
            "frequent_values": [
                "As part of Progressive Redesign Opportunity Schools for Excellence (PROSE), schools are allowed flexibility in how their school day is organized and encouraged to implement models of teacher inter-visitation, with many schools centering this work on the goal of meeting the needs of a diverse student body. In 2016-17, 79 schools participated in schedule flexibility, allowing leaders to tailor school structure to meet specific needs of school communities. Many schools have implemented teacher inter-visitations, encouraging the sharing of best practices in how to most effectively serve a diverse school community. Last year’s survey results show that of the schools surveyed, 76% feel that the scheduling flexibility created more opportunities for teachers to collaborate. Other benefits include: increased instructional time for students, additional time for parent engagement, and more opportunities for student advisory support.",
                "Students attending Renewal Schools in the 2016-17 school year were given priority enrollment in DOE Summer STEM programs for summer 2017. Renewal Schools also created additional summer enrichment programs for their students including a Summer Bridge program, SAT Prep, and CareerCLUE. Greater access to enrichment programs encouraged program diversity and combatted summer learning loss among students. Summer sites were added in Districts 9 and 27.",
                "In June 2017, the DOE released Equity and Excellence for All: Diversity in New York City Public Schools. The release of this diversity plan is the next step in the City’s ongoing work to increase school diversity. It represents a critical milestone in the City’s Equity and Excellence for All agenda, and begins to lay out an approach to increasing diversity in the school system. The plan sets specific initial goals for making schools more diverse and inclusive that will be reported on annually. This includes 12 proposals to address policies and practices that pose challenges to school diversity; this report is organized in a way that aligns each activity to one of these proposals. ",
                "The DOE works with Superintendents to collaborate with each school community - staff, parents, students, and other community stakeholders- to respond to educational needs, particularly when schools are exhibiting declining academic performance. The range of redesign strategies include: Addition of new programs or services (School Redesign),  New School development, School relocation (Resiting), Grade reconfiguration (Truncation / Expansion), Consolidation and Closure. The end result is a better option for students, one whose culture reflects a single cohesive community and a higher instructional quality which leads to student achievement. These strategies are constructed with potential impacts on school diversity in mind.",
                "The DOE is partnering with WXY Studio, a public engagement firm, and Community School District 15 to implement a public engagement process to foster school diversity in Community School District 15."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 95,
                    "shortest_values": [
                        "The DOE targets families who did not apply through admissions using both English and Spanish.",
                        "In 2016-17, families continued to have the opportunity to select testing sites that met their accessibility needs.",
                        "To give families the maximum amount of time in which to apply, the DOE opened the Round 2 application three weeks ahead of schedule and did not change the planned close date.",
                        "The DOE continued to support middle schools in recruiting and supporting students with disabilities, including middle schools that currently serve lower numbers of students with disabilities.",
                        "The DOE is partnering with WXY Studio, a public engagement firm, and Community School District 15 to implement a public engagement process to foster school diversity in Community School District 15."
                    ],
                    "longest_values": [
                        "Through the Expanded Success Initiative (ESI), the DOE facilitated monthly open forums with school leaders, students, and community members to unpack issues related to race, gender and class. It also hosted a peer-to-peer mentorship program, serving primarily young men of color, aimed at engaging students from underserved communities in a college and career readiness mindset. Additionally, in partnership with the Center for Strategic Solutions at NYU, ESI hosted a Critically Conscious Educators Rising (CCER) Series that convened a group of like-minded educators to focus on tying theory to practice in the pursuit of equity and racial justice in their classrooms, through their peers, and beyond. Through the ESI Leadership Institute, the DOE hosted a four-part collaborative series bringing together principals and assistant principals to explore systematic bias and racism in schools and what building leaders can do to disrupt it. Administrators and leaders from over 30 schools have come together to learn how to create a roadmap towards an equity-driven school community using data and guided by a root cause analysis process.",
                        "As part of Progressive Redesign Opportunity Schools for Excellence (PROSE), schools are allowed flexibility in how their school day is organized and encouraged to implement models of teacher inter-visitation, with many schools centering this work on the goal of meeting the needs of a diverse student body. In 2016-17, 79 schools participated in schedule flexibility, allowing leaders to tailor school structure to meet specific needs of school communities. Many schools have implemented teacher inter-visitations, encouraging the sharing of best practices in how to most effectively serve a diverse school community. Last year’s survey results show that of the schools surveyed, 76% feel that the scheduling flexibility created more opportunities for teachers to collaborate. Other benefits include: increased instructional time for students, additional time for parent engagement, and more opportunities for student advisory support.",
                        "Supports and interventions have been put into place to increase awareness of and access to 3K through High School admissions processes for students in temporary housing and their families. These interventions have included transportation provided to admissions events, admissions hubs for students at fairs, trainings for shelter staff, shelter-based workshops, direct outreach to pre-Kindergarten non-applicants and other opportunities for targeted admissions support. In the 2016-17 admissions cycle, 41 percent of eligible students in shelter applied for Kindergarten, up from 36 the previous year. 32 percent of 8th graders in shelter listed 12 choices on their high school application – up from 27 percent the previous year, and higher than the citywide average. In 2017-18, the DOE will expand the number of admissions hubs and offer targeted shelter-based events.\n",
                        "In 2016-17, the DOE formed a team of outreach specialists focused on raising awareness about the Specialized High Schools (SHS). The team called thousands of families, attended more than 20 events, and presented about the SHS at ~25 middle schools in underrepresented districts (Districts 4-6 in Manhattan, Districts 7-12 in the Bronx, and Districts 16-19, 23 and 32 in Brooklyn).  In spring 2017, the DOE hosted inaugural SHS fairs in Brooklyn and the Bronx with the goal of increasing awareness about the SHS in communities that are underrepresented at the schools. ~5,000 people attended across both events. In 2017-18, the outreach team will continue to build upon this work by strengthening relationships with community partners with the goal of effectively promoting and increasing visibility of the SHS to students and families from underrepresented backgrounds. \n",
                        "The Progressive Redesign Opportunity Schools for Excellence (PROSE) used funding from the National Education Association to provide $750 mini-grants and an opportunity to apply for up to $5,000 in mini-grant funding to 10 schools who sought to increase diversity in their school communities. Many of these schools utilized this funding to provide planning time for school staff working on diversity issues, as well as to do additional recruitment and outreach to underrepresented populations through school fairs and direct communication to families. Additionally, schools also utilized this funding to better equip their schools to support diverse learners. Examples of these activities included full-day professional development and guest speakers. Of the 155 schools in the program, 10 schools received grants of up to $5,000 for this effort."
                    ],
                    "average_length": 472.86315789473684
                }
            ]
        },
        {
            "column_name": "Target Population",
            "number_non_empty_cells": 95,
            "number_empty_cells": 0,
            "number_distinct_values": 28,
            "frequent_values": [
                "Families and communities",
                "Schools and school communities",
                "Students with Disabilities",
                "Students in Temporary Housing",
                "English Language Learners"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 95,
                    "shortest_values": [
                        "Families and communities",
                        "English Language Learners",
                        "Students with Disabilities",
                        "Students of Renewal Schools",
                        "Non-English speaking families"
                    ],
                    "longest_values": [
                        "High performing, economically disadvantaged middle school students (22-month DREAM program) and high performing rising 8th graders from underrepresented districts (DREAM Intensive)",
                        "Spanish speaking and Chinese speaking families in Districts 7,8, and 25, and 31.",
                        "English Language Learners and families with non-English home language",
                        "English Language Learners, Students in Temporary Housing",
                        "Middle school students from underrepresented districts"
                    ],
                    "average_length": 33.56842105263158
                }
            ]
        },
        {
            "column_name": "Category",
            "number_non_empty_cells": 95,
            "number_empty_cells": 0,
            "number_distinct_values": 14,
            "frequent_values": [
                "Fostering Welcoming School Climates for All Students",
                "Equity & Excellence for All",
                "Streamlining and increasing access for families to learn about school options and apply",
                "Improving Diversity at the Specialized High Schools",
                "Planning for Diversity When Opening New Schools and Programs"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 95,
                    "shortest_values": [
                        "Equity & Excellence for All",
                        "Increasing Access to Screened Schools",
                        "Targeting Funding to Foster Diversity",
                        "Targeting funding to foster diversity",
                        "Expanding Diversity in Admissions Pilots"
                    ],
                    "longest_values": [
                        "Increasing Participation of Underrepresented Students in STEM and Other Rigorous Courses",
                        "Streamlining and Increasing Access for families to learn about school options and apply",
                        "Streamlining and increasing access for families to learn about school options and apply",
                        "Planning for Diversity When Opening New Schools and Programs",
                        "Improving Efforts to Support Students in Temporary Housing"
                    ],
                    "average_length": 54.526315789473685
                }
            ]
        }
    ],
    "key_column_candidates": [
        "Description"
    ]
}