{
    "dataset_name": "gsgx-6efw",
    "columns": [
        {
            "column_name": "PermitNumber",
            "number_non_empty_cells": 5364702,
            "number_empty_cells": 0,
            "number_distinct_values": 475682,
            "frequent_values": [
                "M012019156A97",
                "M012019063A53",
                "M012019106A98",
                "M012019105D39",
                "M012019120A67"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 5364702,
                    "shortest_values": [
                        "B162019243A44",
                        "B162019086A86",
                        "M162019086A66",
                        "M022019086G36",
                        "M022019086G37"
                    ],
                    "longest_values": [
                        "B162019001A00",
                        "B012019165A80",
                        "X022019165B20",
                        "X022019165B21",
                        "X022019165B19"
                    ],
                    "average_length": 13.0
                }
            ]
        },
        {
            "column_name": "StipulationID",
            "number_non_empty_cells": 5364702,
            "number_empty_cells": 0,
            "number_distinct_values": 4807,
            "frequent_values": [
                "038",
                "TMC001",
                "SCHOOL",
                "NOISE1",
                "103"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 2963633,
                    "max_value": 905,
                    "min_value": 0,
                    "mean": 74.38091288631217,
                    "stddev": 87.65209468211333
                },
                {
                    "type": "TEXT",
                    "count": 2401069,
                    "shortest_values": [
                        "ODV",
                        "HTPO",
                        "WAGE",
                        "CPIS",
                        "CARSH"
                    ],
                    "longest_values": [
                        "SEO143",
                        "SET781",
                        "SET910",
                        "SES303",
                        "SES769"
                    ],
                    "average_length": 5.82944763353323
                }
            ]
        },
        {
            "column_name": "StipulationFullText",
            "number_non_empty_cells": 5364702,
            "number_empty_cells": 0,
            "number_distinct_values": 5165,
            "frequent_values": [
                "ALL TEMPORARY TRAFFIC CONTROL DEVICES, INCLUDING BUT NOT LIMITED TO SIGNS, CHANNELIZING DEVICES, FENCING AND MARKINGS SHALL BE PROVIDED, INSTALLED, MAINTAINED AND REMOVED BY THE PERMITTEE IN ACCORDANCE WITH THE MOST RECENT VERSION OF PART 6 OF THE MANUAL ON UNIFORM TRAFFIC CONTROL DEVICES FOR STREETS AND HIGHWAYS (MUTCD). OBTAIN THE MUTCD AT HTTP://MUTCD.FHWA.DOT.GOV .",
                "CONTRACTORS WHO AT ANY TIME DURING THEIR PERMITTED WORK ENCOUNTER TRAFFIC SURVEILLANCE CAMERAS, DETECTION EQUIP OR ANY TYPE OF COMMUNICATION EQUIPMENT (WIRELESS OR HARD-WIRED) ON ANY NYCDOT FACILITY, THAT IS NOT INCLUDED ON THE DESIGN/BUILD DWGS, SHALL IMMEDIATELY NOTIFY NYCDOT TRAFFIC MANAGEMENT AT TMC@DOT.NYC.GOV & 718-433-3390/40 AND AWAIT DIRECTION PRIOR TO CONTINUING WORK",
                "NO WORK TO BE PERFORMED WITHIN BLOCK FRONTING SCHOOL INCLUDING INTERSECTIONS FOR ONE HOUR PRIOR TO SCHOOL START TIME THROUGH ONE HOUR AFTER END OF SCHOOL TIME. PERMITTEE MUST NOTIFY SCHOOL PRINCIPAL IN WRITING 48 HOURS PRIOR TO BEGINNING ANY WORK. THIS STIP VOIDS ANY/ ALL OTHER CONFLICTING STIPS ON THIS PERMIT UNLESS ACCOMPANIED WITH VARIANCE STIP VAR001.",
                "BY SUBMITTING THIS APPLICATION AND/OR RENEWAL REQUEST, THE PERMITTEE CERTIFIES ITS COMPLIANCE WITH ALL APPLICABLE CITYWIDE CONSTRUCTION NOISE MITIGATION REQUIREMENTS INCLUDING, BUT NOT LIMITED TO THE DEVELOPMENT OF A COMPLIANT NOISE MITIGATION OR ALTERNATIVE NOISE MITIGATION PLAN. PLEASE CONTACT THE NYC DEPARTMENT OF ENVIRONMENTAL PROTECTION (WWW.NYC.GOV/HTML/DEP/HTML/NOISE/CONSTRUCTION-NOISE.SHTML) FOR FURTHER INFORMATION.",
                "PARKING OF NON-COMMERCIAL VEHICLES ON THE STREET (ROADWAY AND SIDEWALK) WITHIN WORK ZONES IS PROHIBITED."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 5364702,
                    "shortest_values": [
                        "REQUIRES OCMC REVIEW",
                        "OCCUPY ONE 11 FOOT LANE",
                        "OCCUPY TWO 11 FOOT LANES",
                        "OCCUPY THREE 11 FOOT LANES",
                        "WORK 10AM TO 2PM MONDAY-FRIDAY"
                    ],
                    "longest_values": [
                        "THE PERMITTEE MUST CREATE A TEMPORARY BIKEWAY AROUND THE WORK ZONE DELINEATED BY CONES OR SIMILAR VERTICAL TRAFFIC DEVICES IF THE WORK IMPACTS A PROTECTED BICYCLE LANE. THE MINIMUM WIDTH FOR A TEMPORARY ONE-WAY BIKEWAY MUST BE 5 FEET AND 8 FEET FOR A TWO-WAY BIKEWAY. WHERE A TWO-WAY BICYCLE LANE EXISTS ON A ONE-WAY STREET, THE BICYCLE LANE IN THE OPPOSITE DIRECTION OF TRAFFIC SHOULD ALWAYS BE ACCOMMODATED BY A TEMPORARY FIVE-FOOT BIKEWAY AND DELINEATED BY CONES. THE MOVING LANE MUST BECOME A TEMPORARY SHARED VEHICLE AND BICYCLE LANE. NO REDUCTION OF MOVING LANES IS PERMITTED UNLESS STIPULATED ON THIS PERMIT. PARKING RESTRICTIONS MAY APPLY. WHEN A ONE-WAY TEMPORARY BIKEWAY CANNOT BE CREATED, THE NEAREST MOVING LANE TO THE BICYCLE LANE MUST BECOME A SHARED VEHICLE AND BICYCLE LANE. PERMITTEE MUST COMPLY WITH THE BIKE MPT DESIGN GUIDELINES, WHICH ARE AVAILABLE AT HTTPS://WWW1.NYC.GOV/HTML/DOT/DOWNLOADS/PDF/BIKE-MPT-GUIDELINES.PDF",
                        "THE PERMITTEE MUST CREATE A TEMPORARY BIKEWAY AROUND THE WORK ZONE DELINEATED BY CONES OR SIMILAR VERTICAL TRAFFIC DEVICES IF THE WORK IMPACTS A BICYCLE LANE. THE MINIMUM WIDTH FOR A ONE-WAY BIKEWAY MUST BE 5 FEET AND 8 FEET FOR A TWO-WAY BIKEWAY. WHERE A TWO-WAY BICYCLE LANE EXISTS ON A ONE-WAY STREET, THE BICYCLE LANE IN THE OPPOSITE DIRECTION OF TRAFFIC SHOULD ALWAYS BE ACCOMMODATED BY A TEMPORARY FIVE-FOOT BIKEWAY AND DELINEATED BY CONES. THE MOVING LANE MUST BECOME A TEMPORARY SHARED VEHICLE AND BICYCLE LANE. NO REDUCTION OF MOVING LANES IS PERMITTED UNLESS STIPULATED ON THIS PERMIT. PARKING RESTRICTIONS MAY APPLY. WHEN A ONE-WAY TEMPORARY BIKEWAY CANNOT BE CREATED, THE NEAREST MOVING LANE MUST BECOME A SHARED VEHICLE AND BICYCLE LANE. PERMITTEE MUST COMPLY WITH THE BIKE MPT DESIGN GUIDELINES, WHICH ARE AVAILABLE AT HTTPS://WWW1.NYC.GOV/HTML/DOT/DOWNLOADS/PDF/BIKE-MPT-GUIDELINES.PDF",
                        "WORK EMBARGO: 10/25/19 12:01am to 11/3/19 11:59pm for 2019 Embargo NYC Marathon and Family Reunion. Full street closure. *NYC DOT REQUIRES FULL RESTORATION OF ROADWAY AND/OR SIDEWALK FOR PUBLIC USE AS IT RELATES TO THE EVENT. PLEASE CONTACT DOT SPECIAL EVENTS (SPECIALEVENTS@DOT.NYC.GOV) FOR FURTHER INFORMATION. Also includes: STATEN IS: McClean Ave/ Lily Pond-New York Aves; Front St/ Wave-Edgewater Sts; BROOKLYN: BQE/ Verazano-9 St; Gatling Pl(79 St BQE Entrance Ramp)/ 83 St-79 St; 7 Ave-79-74 Sts; MANHATTAN: Madison Ave Br; Madison Ave Br(FDR SR)/125-142 Sts; 90 St/ 5 Ave-East Dr; East Dr/ 90 St-Gnd Army Plz; Central Park Driveway/8 Ave Approach to West Dr; Central Park Approach on 85, 81, 77 and 67 Sts to West Dr; The ff bridges:Willis Ave, Verrazano Br, Pulaski Br; Queensboro Br & Bicycle and Pedestrian Path;",
                        "WORK EMBARGO: 05/06/2019 FOR SPECIAL EVENT The NYC Parks and Recreation Brooklyn Senior Games / Street Event ** TIME: 6:00AM - 8:00PM / Rolling Closure **NYC DOT REQUIRES FULL RESTORATION OF ROADWAY AND/OR SIDEWALK FOR PUBLIC USE AS IT RELATES TO THE EVENT. PLEASE CONTACT DOT SPECIAL EVENTS (SPECIALEVENTS@DOT.NYC.GOV) FOR FURTHER INFORMATION. Also includes: Fort Hamilton Pkwy (N/B) between 100th Street – Caton Avenue; Coney Island Avenue between Caton Avenue – Park Circle (Keep Right in Circle); • East/Hill Drive between Park Circle – Grand Army Plaza; Grand Army Plaza from Prospect Park (East/Hill Drive) – Eastern Parkway; Eastern Parkway (Service Rd) between Washington Avenue – Buffalo Avenue;Buffalo Avenue between Eastern Pkwy (Service Rd) – Rockaway Parkway;",
                        "WORK EMBARGO: 02/13 - 12/26/2019 FOR SPECIAL EVENT Sidewalk Sale Days / Sidesalk Sale ** TIME: 8:00AM - 9:30PM / Partial Sidewalk Closure *NYC DOT REQUIRES FULL RESTORATION OF ROADWAY AND/OR SIDEWALK FOR PUBLIC USE AS IT RELATES TO THE EVENT. PLEASE CONTACT DOT SPECIAL EVENTS (SPECIALEVENTS@DOT.NYC.GOV) FOR FURTHER INFORMATION ** Recurring Dates: 02/13/2019,02/14/2019,02/16/2019,02/17/2019,02/18/2019,04/13/2019,04/20/2019,05/11/2019,05/12/2019,05/25/2019,05/26/2019,05/27/2019,06/15/2019,06/16/2019,07/03/2019,07/04/2019,08/09/2019,08/10/2019,08/31/2019,09/01/2019,09/02/2019,10/13/2019,10/14/2019,11/10/2019,11/11/2019,11/29/2019,11/30/2019,12/01/2019,12/07/2019,12/08/2019,12/13/2019,12/14/2019,12/15/2019,12/21/2019,12/22/2019,12/23/2019,12/24/2019,12/26/2019"
                    ],
                    "average_length": 262.92078106109153
                }
            ]
        },
        {
            "column_name": "CreatedOn",
            "number_non_empty_cells": 5364702,
            "number_empty_cells": 0,
            "number_distinct_values": 331508,
            "frequent_values": [
                "06/17/2019 11:08:42 AM",
                "07/02/2019 12:20:40 PM",
                "07/02/2019 12:20:41 PM",
                "03/14/2019 03:31:33 PM",
                "05/21/2019 01:08:09 PM"
            ],
            "data_types": [
                {
                    "type": "DATE/TIME",
                    "count": 5364702,
                    "max_value": "2019-08-31 22:58:33",
                    "min_value": "2019-01-01 01:32:01"
                }
            ]
        }
    ],
    "key_column_candidates": [
        "PermitNumber",
        "StipulationID"
    ]
}