{
    "dataset_name": "hmw8-8is3",
    "columns": [
        {
            "column_name": "Agency Name",
            "number_non_empty_cells": 282,
            "number_empty_cells": 0,
            "number_distinct_values": 40,
            "frequent_values": [
                "Office of Chief Medical Examiner (OCME)",
                "Department of Finance (DOF)",
                "Department of Education (DOE)",
                "NYC School Construction Authority (SCA)",
                "Office of the Mayor (OTM)"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 282,
                    "shortest_values": [
                        "Law Department (LAW)",
                        "Office of the Mayor (OTM)",
                        "Department of Finance (DOF)",
                        "New York City Council (NYCC)",
                        "Department of Buildings (DOB)"
                    ],
                    "longest_values": [
                        "Department of Information Technology and Telecommunications (DoITT)",
                        "Department of Housing Preservation and Development (HPD)",
                        "Department of Citywide Administrative Services (DCAS)",
                        "Office of Administrative Trials and Hearings (OATH)",
                        "Department of Health and Mental Hygiene (DOHMH)"
                    ],
                    "average_length": 36.58510638297872
                }
            ]
        },
        {
            "column_name": "Dataset Title",
            "number_non_empty_cells": 282,
            "number_empty_cells": 0,
            "number_distinct_values": 278,
            "frequent_values": [
                "Inspections",
                "Citywide Payroll Data",
                "Exemption Classification Codes",
                "Approved Operating Companies",
                "MWBE Vendors"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 282,
                    "shortest_values": [
                        "EPP",
                        "CPRR",
                        "PIMS",
                        "Route ",
                        "School"
                    ],
                    "longest_values": [
                        "Decedents removed from scene (non-hospital) after investigation in median time (minutes)",
                        "DNA Property Crime Cases Completed, from Evidence Submission to Report in median time",
                        "DNA Sexual Assault Cases Completed, from Evidence Submission to Report in median time",
                        "Building inspections completed by inspection type/Number of risk buildings inspected",
                        "DNA Homicide Cases Completed, from Evidence Submission to Report in median time"
                    ],
                    "average_length": 28.585106382978722
                }
            ]
        },
        {
            "column_name": "Dataset Description",
            "number_non_empty_cells": 279,
            "number_empty_cells": 3,
            "number_distinct_values": 274,
            "frequent_values": [
                "Table of codes and the corresponding description",
                "The Office of Citywide Purchasing (OCP) solicits and awards contracts for a wide variety of goods and services on behalf of all City agencies ",
                "Pursuant to  312(a) of the City Charter, as amended by Local Law 63 of 2011, the Mayor's Office is required to publish a plan and schedule for each City agency detailing the anticipated contracting actions of each agency for the upcoming fiscal year for certain categories of procurement.",
                "Restitution awarded to consumers via settlements and decisions",
                "Program receipt by borough and community district"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 279,
                    "shortest_values": [
                        " Manhole Permit",
                        "Mainframe file ",
                        "City Property Data",
                        "Route and schools ",
                        "LinkNYC usage data"
                    ],
                    "longest_values": [
                        "Not later than October first of each year, the city chief procurement officer shall submit to the speaker of the city council and publish on the mayor’s office of contract services website a report detailing the city’s procurement of preferred source products during the prior fiscal year. Such report shall include the following information for contracts valued at twenty thousand dollars or more whose primary purpose is the purchase of preferred source products, disaggregated by agency:  (1) the total dollar value of each preferred source product procured from preferred source vendors; (2) the total dollar value of each preferred source product procured from vendors not identified as preferred source vendors; and (3) the total dollar value of all preferred source products procured.",
                        "The DOE has previously identified 594 schools located in 330 buildings as “under-utilized” based upon the 2010-2011 Enrollment-Capacity-Utilization Report (The Blue Book). The DOE is also identifying 25 school buildings (listed below) which contain schools proposed for full phase-out, grade truncation or immediate closure due to poor performance. These proposals are scheduled to be voted on by the Panel for Education Policy on February 9, 2012. Should these proposals be approved, there will be excess space available in the buildings. In many cases, the DOE has already made companion proposals on how to use this additional space",
                        "On or before September thirtieth, two thousand and three, and on or before the last day of every quarter thereafter, the mayor or his or her designee shall submit to the council and the comptroller a report detailing each small purchase award made pursuant to this section during the quarter that ended three months before such report is due and for which information is required to be contained in the computerized data base maintained pursuant to subdivision a of section 6-116.2 of the administrative code. ",
                        "The Concession Rules require the City Chief Procurement Officer to produce an Annual Concession Report (“CCPO Annual Report”) summarizing the currently effective concessions awarded under Title 12 of the Rules of the City of New York. The summary includes: the registration status of each concession; a brief description of each concession awarded; the method by which each concession was awarded; and the approximate gross revenues received by the City for each concession during the prior fiscal year.",
                        "a. The CCPO shall submit an annual report to the Committee no later than each September 1st summarizing the currently effective concessions awarded pursuant to this Chapter. The summary shall include the date each concession was submitted to the Comptroller for registration, a brief description of each concession awarded, the method by which each concession was awarded, and the approximate gross revenues received by the City for each concession during the prior fiscal year."
                    ],
                    "average_length": 110.21505376344086
                }
            ]
        },
        {
            "column_name": "Update Frequency",
            "number_non_empty_cells": 282,
            "number_empty_cells": 0,
            "number_distinct_values": 18,
            "frequent_values": [
                "Monthly",
                "Annually",
                "Quarterly",
                "Daily",
                "To Be Determined"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 282,
                    "shortest_values": [
                        "Daily",
                        "daily",
                        "Weekly",
                        "Monthly",
                        "Yearly "
                    ],
                    "longest_values": [
                        "To Be Determined",
                        "Historical Data",
                        "Semi-annually",
                        "Semi-Annually",
                        " As Needed "
                    ],
                    "average_length": 8.308510638297872
                }
            ]
        },
        {
            "column_name": "Release Date",
            "number_non_empty_cells": 282,
            "number_empty_cells": 0,
            "number_distinct_values": 52,
            "frequent_values": [
                "December 31 2018",
                "December 31 2015",
                "August 01 2016",
                "December 01 2015",
                "March 31 2016"
            ],
            "data_types": [
                {
                    "type": "DATE/TIME",
                    "count": 282,
                    "max_value": "2018-12-31 00:00:00",
                    "min_value": "2015-07-17 00:00:00"
                }
            ]
        },
        {
            "column_name": "Date Status",
            "number_non_empty_cells": 282,
            "number_empty_cells": 0,
            "number_distinct_values": 3,
            "frequent_values": [
                "No Change",
                "New",
                "Updated"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 282,
                    "shortest_values": [
                        "New",
                        "Updated",
                        "No Change"
                    ],
                    "longest_values": [
                        "No Change",
                        "Updated",
                        "New"
                    ],
                    "average_length": 7.198581560283688
                }
            ]
        }
    ],
    "key_column_candidates": [
        "Agency Name",
        "Dataset Title"
    ]
}