{
    "dataset_name": "nntm-ht5m",
    "columns": [
        {
            "column_name": "Grade Band",
            "number_non_empty_cells": 126,
            "number_empty_cells": 0,
            "number_distinct_values": 24,
            "frequent_values": [
                "Elementary School - High School",
                "High School",
                "Middle School, High School",
                "Middle School",
                "Elementary, Middle, and High School"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 126,
                    "shortest_values": [
                        "3-K",
                        "Pre-K",
                        "Pre-K/ 3K",
                        "High School",
                        "Kindergarten"
                    ],
                    "longest_values": [
                        "Pre-Kindergarten, Kindergarten, Gifted & Talented",
                        "Elementary, Middle, and High School",
                        "3-K, Pre-Kindergarten, Kindergarten",
                        "Elementary, Middle and High School",
                        "Elementary School, Middle School"
                    ],
                    "average_length": 24.738095238095237
                }
            ]
        },
        {
            "column_name": "Activity",
            "number_non_empty_cells": 126,
            "number_empty_cells": 0,
            "number_distinct_values": 124,
            "frequent_values": [
                "Implemented re-zoning with a focus on diversity",
                "Opened pre-K Main Round later and for a longer period of time and introduced late application",
                "Equity & Excellence - Computer Science for All",
                "Continued Family English Initiative",
                "Ackerman Institute Transgender Supports Training"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 126,
                    "shortest_values": [
                        "PFLAG Training",
                        "Cops and Conversation",
                        "WNET LGBT Identity PD",
                        "Gender Equity Modules",
                        "Expansion of Just Say Hi"
                    ],
                    "longest_values": [
                        "The IB/CRE team will work to fulfill the goals of increasing awareness about implicit bias and of reducing these biases by providing a professional learning series that will set a two-year target to reach 140,000 NYCDOE staff members citywide. Inherent in this training is a focus on culturally responsive practices as an approach to promoting greater systemic equity.",
                        "Professional learning offered to district 75 pool of Adapted Physical Education teachers to introduce them to newly created resources that support teachers in designing learning experiences to access general curriculum for students with disabilities",
                        "Professional learning offered to citywide pool of General Education Physical Education teachers to provide developmental and functionally appropriate physical education experiences for students with disabilities",
                        "Mayor de Blasio and Chancellor Carranza Announce Plan to Immediately Expand Specialized High Schools Discovery Program, and to Eliminate Specialized High Schools Admissions Test Over Three Years",
                        "Worked with teachers to examine their beliefs and their pedagogy. A personal and professional journey that led to critically conscious examination of instruction, policies and practices."
                    ],
                    "average_length": 80.2063492063492
                }
            ]
        },
        {
            "column_name": "Description",
            "number_non_empty_cells": 126,
            "number_empty_cells": 0,
            "number_distinct_values": 126,
            "frequent_values": [
                "The New York City Department of Education (NYC DOE) and New York Police Department (NYPD) partnered to offer the Cops + Conversation program for lesbian, gay, bisexual, and transgender (LGBT) student clubs commonly called Gender and Sexuality Alliances or GSAs. \n\nThe presentation brought officers from the Community Affairs Bureau - LGBT Outreach Unit into the GSA meeting to build an understanding of law enforcement, reporting of possible bias incidents, and building ties between GSAs and their local precinct. The program was piloted in September 2017. Thirteen visits were conducted reaching 232 students and 26 adults.",
                "Chancellor Richard A. Carranza  announced a districtwide plan to increase middle school diversity in District 3, which includes the Upper West Side and South Harlem. This is the first districtwide middle school diversity plan in New York City, and will prioritize 25 percent of seats for students from low-income families with lower academic performance in middle school admissions. The plan will go into effect for students entering 6th grade in 2019. The development of the District 3 middle school diversity plan has been driven by local parents and educators, including the District 3 Community Education Council and its Middle School Committee, District 3 Superintendent Ilene Altschul, and elementary and middle school principals.",
                "The LGBT+ Advisory Council has existed since June 2015. There are currently 38 organizations that serve on the council, up from 34 during 2016-2017.",
                "The New York City Department of Education and PFLAG New York City partnered to train parent coordinators via Family Leadership Coordinators (FLC). FLCs typically hold workshops and training for their parent coordinators, and the LGBT Community Liaison reserved 10 two-hour trainings titled LGBT-Inclusive Family Support in School Communities: Capacity-Building Workshops for Parent Coordinators. Only 8 of these presentations were held due to scheduling complications during the end of the year. Two additional presentations were added for Substance Abuse Prevention Intervention Specialists (SAPIS) during their spring conference, for a total of 10 presentations reaching 308 people.",
                "In June 2018, Mayor de Blasio and Chancellor Carranza  joined parents, educators, advocates and students and announced a new plan to make admissions to New York City’s eight testing Specialized High Schools (SHS) more equitable while maintaining their high standards. The two-part plan includes:  \n(1) Expanding the Discovery program for disadvantaged students who just miss the SHSAT score required to receive an offer to an SHS. The DOE will begin to expand the Discovery program to 20 percent of seats at each SHS and adjust the eligibility criteria to target students attending high-poverty schools. Based on modeling of current offer patterns, an estimated 16 percent of offers would go to black and Latino students, compared to 9 percent currently. \n(2) Eliminating the use of the Specialized High Schools Admissions Test (SHSAT) as the sole criterion for admissions over three years. The elimination of the SHSAT would require State legislation. By the end of the elimination, the SHS would use the “University of Texas model,” where seats are reserved for top performers at each New York City middle school. Based on modeling of current offer patterns, 45 percent of offers would go to black and Latino students, compared to 9 percent currently; 62 percent of offers would go to female students, compared to 44 percent currently; and four times more offers would go to Bronx residents."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 126,
                    "shortest_values": [
                        "The DOE distributed resources at NYC Youth Pride.",
                        "The DOE targets families who did not apply through admissions in English and Spanish.",
                        "Over 300 educators attended the inaugural Sexuality, Women, and Gender Instructional Equity Conference.",
                        "Professional development session for 72 staff to learn about incorporating LGBT identity into their classroom.",
                        "In 2017-18, families continued to have the opportunity to select testing sites that met their accessibility needs."
                    ],
                    "longest_values": [
                        "In collaboration with the District 1 Community Education Council and the District 1 Community School District Superintendent's Office, the DOE piloted a district-wide diversity in admissions plan for the 2017-18 pre-Kindergarten and Kindergarten admissions cycle (for the entering class of fall 2018). Through the pre-K, kindergarten and Gifted and Talented admissions processes, ELL, STH and students eligible for FRL received priority for 67% of offers.\n\nFor fall 2018 admissions, seven of the 16 elementary schools in District 1 made offers within their target range – offering 57 to 77 percent of kindergarten seats to students identified as FRL, ELL, and/or STH. This is nearly double the four elementary schools in District 1 whose kindergarten enrollment was within the target range in the 2017-18 school year. Of the nine District 1 elementary schools that are not in the target range for offers, five moved closer to the target range as compared to their 2017-18 enrollment. Additionally, as part of District 1’s Diversity in Admissions priorities, 15 of the 16 elementary schools made kindergarten offers to a percentage of students with disabilities (SWD) near the district average – offering 9 to 29 percent of kindergarten seats to SWD. This progress is supported by the district’s Family Resource Center, which opened in October 2017 and is a one-stop shop for families to learn about and enroll in District 1 schools.",
                        "In June 2018, Mayor de Blasio and Chancellor Carranza  joined parents, educators, advocates and students and announced a new plan to make admissions to New York City’s eight testing Specialized High Schools (SHS) more equitable while maintaining their high standards. The two-part plan includes:  \n(1) Expanding the Discovery program for disadvantaged students who just miss the SHSAT score required to receive an offer to an SHS. The DOE will begin to expand the Discovery program to 20 percent of seats at each SHS and adjust the eligibility criteria to target students attending high-poverty schools. Based on modeling of current offer patterns, an estimated 16 percent of offers would go to black and Latino students, compared to 9 percent currently. \n(2) Eliminating the use of the Specialized High Schools Admissions Test (SHSAT) as the sole criterion for admissions over three years. The elimination of the SHSAT would require State legislation. By the end of the elimination, the SHS would use the “University of Texas model,” where seats are reserved for top performers at each New York City middle school. Based on modeling of current offer patterns, 45 percent of offers would go to black and Latino students, compared to 9 percent currently; 62 percent of offers would go to female students, compared to 44 percent currently; and four times more offers would go to Bronx residents.",
                        "In June 2017, as part of the diversity plan, the DOE established a School Diversity Advisory Group (SDAG) to make formal policy recommendations to the Mayor and Chancellor. The chairs of the Advisory Group are José Calderón, President of the Hispanic Federation, Maya Wiley, chair of the Civilian Complaint Review Board and Professor of Urban Policy and Management at the New School, Hazel Dukes, President of the NAACP New York State Conference, Amy Hsin, Associate Professor of Sociology at Queens College, and Richard Kahlenberg, Senior Fellow at The Century Foundation. The Advisory Group also includes city government stakeholders, local and national experts on school diversity, parents, advocates, students, and other community leaders. During the 2017-18 school year, the SDAG and its subcommittees have collectively held approximately 30 meetings and one day-long retreat to facilitate research and discussion of a number of key policy areas related to diversity. The SDAG hosted public town halls in every borough across NYC and a youth symposium to collect data from communities on the issues important to them. In December 2018, the SDAG will release a preliminary report and will continue to serve in its capacity into the new year.",
                        "Supports and interventions have been put into place to increase awareness of and access to 3K through High School admissions processes for students in temporary housing and their families. These interventions have included transportation provided to admissions events, admissions hubs for students at fairs, trainings for shelter staff, shelter-based workshops, direct outreach to pre-Kindergarten non-applicants and other opportunities for targeted admissions support. In the 2018 admissions cycle, 52 percent of eligible students in shelter applied for Kindergarten, up from 41 the previous year.  74 percent of 5th graders in shelter participated in middle school admissions, compared to 79 percent last year.  98% of shelter students received an offer compared to 95% of all students.     In 2018-19, the DOE has expanded the number of admissions hubs and targeted shelter-based events. We are holding hubs in 38 fairs this year as compared to 24 fairs last year. We held or participated in almost 20 shelter-based events, new for this year.",
                        "DREAM-SHSI is an extracurricular program of rigorous coursework designed to assist economically disadvantaged NYC students in preparing for the Specialized High Schools Admissions Test (SHSAT). There are two DREAM programs: the Specialized High School Institute (DREAM-SHSI), which runs from the middle of grade 6 to the fall of grade 8, and the Summer/Fall Intensive, which runs during the summer and fall before students plan to take the SHSAT. In summer 2016, the DOE implemented the Summer/Fall Intensive for the first time, targeting the highest-performing rising 8th graders from underrepresented districts. For summer 2017, the DREAM Summer/Fall Intensive more than doubled, serving about 650 students. 185 students received an offer, up from 113 last year. For summer 2018, the DREAM Intensive program served over 1,000 students. DREAM participants who took the fall 2017 SHSAT comprised 8 percent of Black and Latino testers, but 29 percent of Black and Latino students who received Specialized High School offers."
                    ],
                    "average_length": 487.56349206349205
                }
            ]
        },
        {
            "column_name": "Category",
            "number_non_empty_cells": 126,
            "number_empty_cells": 0,
            "number_distinct_values": 18,
            "frequent_values": [
                "Fostering Welcoming School Climates for All Students",
                "Equity & Excellence for All",
                "Streamlining and increasing access for families to learn about school options and apply",
                "Planning for Diversity When Opening New Schools and Programs",
                "Improving Efforts to Support Students in Temporary Housing"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 126,
                    "shortest_values": [
                        "Transition Services",
                        "Equity & Excellence for All",
                        "Inclusion/ Equity and Excellence",
                        "Targeting funding to foster diversity",
                        "Targeting Funding to Foster Diversity"
                    ],
                    "longest_values": [
                        "Increasing Participation of Underrepresented Students in STEM and Other Rigorous Courses",
                        "Streamlining and increasing access for families to learn about school options and apply",
                        "Streamlining and Increasing Access for families to learn about school options and apply",
                        "Planning for Diversity When Opening New Schools and Programs",
                        "Improving Efforts to Support Students in Temporary Housing"
                    ],
                    "average_length": 51.82539682539682
                }
            ]
        }
    ],
    "key_column_candidates": [
        "Description"
    ]
}