{
    "dataset_name": "pbk5-6r7z",
    "columns": [
        {
            "column_name": "PermitNumber",
            "number_non_empty_cells": 72064627,
            "number_empty_cells": 0,
            "number_distinct_values": 8432969,
            "frequent_values": [
                "M022014303C54",
                "M022014303C53",
                "M022014268A24",
                "M022014268A25",
                "M022014245C70"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 72064627,
                    "shortest_values": [
                        "M022008274115",
                        "S162014118A18",
                        "X012014118032",
                        "X012014118033",
                        "B012014118130"
                    ],
                    "longest_values": [
                        "M022018365G51",
                        "Q012005221067",
                        "Q012011342377",
                        "Q012004300079",
                        "Q022013305295"
                    ],
                    "average_length": 13.0
                }
            ]
        },
        {
            "column_name": "StipulationID",
            "number_non_empty_cells": 72064627,
            "number_empty_cells": 0,
            "number_distinct_values": 38685,
            "frequent_values": [
                "103",
                "038",
                "SCHOOL",
                "NOISE1",
                "091"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 47698883,
                    "max_value": 100001,
                    "min_value": 0,
                    "mean": 73.13384160379604,
                    "stddev": 77.03141484297183
                },
                {
                    "type": "TEXT",
                    "count": 24365744,
                    "shortest_values": [
                        "Q",
                        "`",
                        "B01",
                        "S20",
                        "S22"
                    ],
                    "longest_values": [
                        "SEN685",
                        "S00518",
                        "S00681",
                        "S09924",
                        "S01898"
                    ],
                    "average_length": 5.964503566975012
                }
            ]
        },
        {
            "column_name": "StipulationFullText",
            "number_non_empty_cells": 71880920,
            "number_empty_cells": 183707,
            "number_distinct_values": 39211,
            "frequent_values": [
                "ALL TEMPORARY TRAFFIC CONTROL DEVICES, INCLUDING BUT NOT LIMITED TO SIGNS, CHANNELIZING DEVICES, FENCING AND MARKINGS SHALL BE PROVIDED, INSTALLED, MAINTAINED AND REMOVED BY THE PERMITTEE IN ACCORDANCE WITH THE MOST RECENT VERSION OF PART 6 OF THE MANUAL ON UNIFORM TRAFFIC CONTROL DEVICES FOR STREETS AND HIGHWAYS (MUTCD). OBTAIN THE MUTCD AT HTTP://MUTCD.FHWA.DOT.GOV .",
                "PARKING OF NON-COMMERCIAL VEHICLES ON THE STREET (ROADWAY AND SIDEWALK) WITHIN WORK ZONES IS PROHIBITED.",
                "NO WORK TO BE PERFORMED WITHIN BLOCK FRONTING SCHOOL INCLUDING INTERSECTIONS FOR ONE HOUR PRIOR TO SCHOOL START TIME THROUGH ONE HOUR AFTER END OF SCHOOL TIME. PERMITTEE MUST NOTIFY SCHOOL PRINCIPAL IN WRITING 48 HOURS PRIOR TO BEGINNING ANY WORK. THIS STIP VOIDS ANY/ ALL OTHER CONFLICTING STIPS ON THIS PERMIT UNLESS ACCOMPANIED WITH VARIANCE STIP VAR001.",
                "LOADING AND UNLOADING, STANDING OR PARKING IN A LANE ADJACENT TO THE WORK ZONE IN THE ROADWAY IS PROHIBITED. THIS APPLIES TO PERMITTEES AND ALL OF THEIR SUBCONTRACTORS.",
                "THIS PERMIT ACTIVITY MAY NOT START UNTIL THE PERMITTEE COORDINATES ALL WORK WITH ANY ONGOING CONSTRUCTION & WITH THE PROJECT/RESIDENT ENGINEER FOR ANY ONGOING CAPITAL PROJECTS."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 71880920,
                    "shortest_values": [
                        "DENIED",
                        "WORK EMBARGO:",
                        "OCCUPY 1 CURB LANE",
                        "OCCUPY 2 CURB LANES",
                        "REQUIRES OCMC REVIEW"
                    ],
                    "longest_values": [
                        "WORK EMBARGO: 10/26/18 12:01am - 11/4/2018 11:59pm for 2018 Embargo NYC Marathon/Family Reunion - Embargo . *NYC DOT REQUIRES FULL RESTORATION OF ROADWAY AND/OR SIDEWALK FOR PUBLIC USE AS IT RELATES TO THE EVENT. PLEASE CONTACT DOT SPECIAL EVENTS (SPECIALEVENTS@DOT.NYC.GOV) FOR FURTHER INFORMATION. Includes Madison Ave Bridge; Willis Ave Bridge; Central Park Drives and Approaches; Brooklyn Queens Expressway (Southbound) between Verrazano Bridge & 79th Street; McGuinness Blvd between Greenpoint Ave - 48th Ave (Southbound); Pulaski Bridge (Southbound); 23rd Street between Queens Plaza South & Queens Plaza North; Queensboro Bridge and Approaches (Eastbound Lower Roadway); Hylan Boulevard between Bay Street and Narrows Road South; &#61623; Steuben Street between Narrows Road South and W. Fingerboard Road; &#61623; W. Fingerboard between Steuben Street and Hylan Boulevard; &#61623; Sand Lane between Hylan Boulevard and Father Capodanno Boulevard;",
                        "WORK EMBARGO: 9/10/17 5:30am - 6:00pm for NYC Century Bike Tour. Full street closure. *NYC DOT MAY REQUIRE FULL RESTORATION OF ROADWAY AND/OR SIDEWALK FOR PUBLIC USE AS IT RELATES TO THE EVENT. PLEASE CONTACT DOT SPECIAL EVENTS (SPECIALEVENTS@DOT.NYC.GOV) FOR FURTHER INFORMATION. Includes: Brooklyn Bridge Pedestrian: 1 between PARK ROW (S) and TILLARY STREET; West Drive - Center Drive to Park Circle; East Park Drive; Grand Army Plaza GRAND ARMY PLAZA; EAGLE STREET between FRANKLIN STREET and PULASKI BR BIKE PATH; Freeman to 49th Avenue PULASKI BRIDGE between FREEMAN STREET and 49TH AVENUE; Robert F. Kennedy Bridge; Park Paths and Roadways RANDALLS ISLAND between PARL PATHS AND ROADWAYS and; Park Circle / Machete Circle; Shore Parkway Bike Path Bay Ridge; Shore Parkway Bike Path Sheepshead Bay; Lawn Area (Burnett St) MARINE PARK between LAWN AREA/AVE U BURNETT ST and X; Forest Park Drive (Race) FOREST PARK between FOREST PARK DRIVE EAST;",
                        "WORK EMBARGO: 9/9/18 5:30am-6pm for NYC Century Bike Tour Full street closure. *NYC DOT REQUIRES FULL RESTORATION OF ROADWAY AND/OR SIDEWALK FOR PUBLIC USE AS IT RELATES TO THE EVENT. PLEASE CONTACT DOT SPECIAL EVENTS (SPECIALEVENTS@DOT.NYC.GOV) FOR FURTHER INFORMATION. Also includes: Brooklyn Bridge Pedestrian: 1 between PARK ROW (S) and TILLARY STREET; West Drive - Center Drive to Park Circle; East Park Dr; RFK Br; RANDALLS ISLAND between PARL PATHS AND ROADWAYS and; Shore Parkway Bike Path Bay Ridg; Shore Parkway Bike Path Sheepshead Bay; Forest Park Drive (Race) FOREST PARK between FOREST PARK DRIVE EAST and E; 65 ST TO ELAVATED HWY TO 67 ST Boro; SHORE PKWY SVC TO BAY 52 ST; CROSS BAY BR BIKE/PED PATH;VAN BRUNT RD BIKE PATH TO E 21 RD; 84 ST 157 AV TO BIKE PATH; HIGHLAND BLV FORCE TUBE TO VERMONT PL; Mosholu Pky; Van Cortlandt Park; ROCKAWAY BEACH BLVD FROM PED PATH TO 108 ST; MARINE PY GIL HODGES MEMORIAL BR between MARINE PY GIL",
                        "WORK EMBARGO: 9/9/18 5:30am-6pm for NYC Century Bike Tour Full street closure. *NYC DOT REQUIRES FULL RESTORATION OF ROADWAY AND/OR SIDEWALK FOR PUBLIC USE AS IT RELATES TO THE EVENT. PLEASE CONTACT DOT SPECIAL EVENTS (SPECIALEVENTS@DOT.NYC.GOV) FOR FURTHER INFORMATION. Also includes:Brooklyn Bridge Pedestrian: 1 between PARK ROW (S) and TILLARY STREET; PLAZA ST WEST between ST JOHNS PLACE and UNION STREET; West Drive - Center Drive to Park Circle; East Park Drive; Grand Armu Plaza; Pulaski Br; RFK Bridge; Park Paths and Roadways RANDALLS ISLAND between PARL PATHS AND ROADWAYS and; Park/Machete Cir; CYPRESS HILLS STREET between CYPRESS AVENUE and COOPER AVENUE; GRENFELL STREET between ONSLOW PLACE and 82 AVENUE; TERRACE VIEW AVENUE between WEST 228 STREET and BROADWAY; CLOVERDALE BOULEVARD between HORATIO PARKWAY and 223 STREET; CENTRAL PARK N TO RIVERSIDE DR; CENTRAL PARK N TO RIVERSIDE DR 2; grand army plz east dr to st johns pl; MAR",
                        "WORK EMBARGO: 9/9/18 5:30am-6pm for NYC Century Bike Tour Full street closure. *NYC DOT REQUIRES FULL RESTORATION OF ROADWAY AND/OR SIDEWALK FOR PUBLIC USE AS IT RELATES TO THE EVENT. PLEASE CONTACT DOT SPECIAL EVENTS (SPECIALEVENTS@DOT.NYC.GOV) FOR FURTHER INFORMATION. Also includes:Brooklyn Bridge Pedestrian: 1 between PARK ROW (S) and TILLARY STREET; PLAZA ST WEST between ST JOHNS PLACE and UNION STREET; West Drive - Center Drive to Park Circle; East Park Drive; Grand Armu Plaza; Pulaski Br; RFK Bridge; Park Paths and Roadways RANDALLS ISLAND between PARL PATHS AND ROADWAYS and; Park/Machete Cir; CYPRESS HILLS STREET between CYPRESS AVENUE and COOPER AVENUE; GRENFELL STREET between ONSLOW PLACE and 82 AVENUE; TERRACE VIEW AVENUE between WEST 228 STREET and BROADWAY; CLOVERDALE BOULEVARD between HORATIO PARKWAY and 223 STREET; CENTRAL PARK N TO RIVERSIDE DR; CENTRAL PARK N TO RIVERSIDE DR 2; grand army plz east dr to st johns pl;"
                    ],
                    "average_length": 222.71639846846702
                }
            ]
        },
        {
            "column_name": "CreatedOn",
            "number_non_empty_cells": 72064627,
            "number_empty_cells": 0,
            "number_distinct_values": 1929748,
            "frequent_values": [
                "12/14/2013 09:03:08 PM",
                "01/02/2014 03:44:43 PM",
                "03/20/2014 09:55:11 AM",
                "09/30/2014 03:30:05 AM",
                "10/23/2014 03:15:08 AM"
            ],
            "data_types": [
                {
                    "type": "DATE/TIME",
                    "count": 72064627,
                    "max_value": "2018-12-31 22:23:33",
                    "min_value": "2013-12-14 21:03:08"
                }
            ]
        }
    ],
    "key_column_candidates": [
        "PermitNumber",
        "StipulationID"
    ]
}