{
    "dataset_name": "qj2z-ibhs",
    "columns": [
        {
            "column_name": "Agency",
            "number_non_empty_cells": 1320,
            "number_empty_cells": 0,
            "number_distinct_values": 67,
            "frequent_values": [
                "Department of Education (DOE)",
                "Department of Transportation (DOT)",
                "Department for the Aging (DFTA)",
                "Department of Parks and Recreation (DPR)",
                "Department of Health and Mental Hygiene (DOHMH)"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1320,
                    "shortest_values": [
                        "NYC Recovery",
                        "Law Department (LAW)",
                        "Police Department (NYPD)",
                        "Office of the Mayor (OTM)",
                        "Mayor's Office of ThriveNYC"
                    ],
                    "longest_values": [
                        "Department of Social Services (DSS) - Department of Homeless Services (DHS)",
                        "Department of Information Technology and Telecommunications (DoITT)",
                        "Mayor Office to End Domestic and Gender-Based Violence (ENDGBV)",
                        "Department of Housing Preservation and Development (HPD)",
                        "Department of Records and Information Services (DORIS)"
                    ],
                    "average_length": 36.04545454545455
                }
            ]
        },
        {
            "column_name": "Dataset Name",
            "number_non_empty_cells": 1320,
            "number_empty_cells": 0,
            "number_distinct_values": 1284,
            "frequent_values": [
                "Local Law 44",
                "Grant awards",
                "Derelict Vehicle Dispositions",
                "Inspections",
                "City Marshals Revenue"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1320,
                    "shortest_values": [
                        "EPP",
                        "CPRR",
                        "PIMS",
                        "Route",
                        "School"
                    ],
                    "longest_values": [
                        "2013-2017 English Language Arts (ELA) Test Resutls by Grade - School - All Students/Ethnicity/Econ_Status/Gender/Ever_ell/SWD/School Profile",
                        "RBIS) Administrative (i.e. local fire house) Risk Based Building inspections completed by inspection type/Number of risk buildings inspected",
                        "2013-2017 English Language Arts (ELA) Test Resutls by Grade - Citywide - All Students/Ethnicity/Econ_Status/Gender/Ever_ELL/SWD",
                        "2013-2017 English Language Arts (ELA) Test Resutls by Grade - District - All Students/Ethnicity/Econ_Status/Gender/Ever_ELL/SWD",
                        "2013-2017 Math Test Results - School - All Students/Ethnicity/Econ_Status/Gender/Ever_ell/SWD/Math Regents/School Profile"
                    ],
                    "average_length": 34.9
                }
            ]
        },
        {
            "column_name": "Dataset Description",
            "number_non_empty_cells": 1317,
            "number_empty_cells": 3,
            "number_distinct_values": 1179,
            "frequent_values": [
                "Reports to the New York City Council by June 30th the number of students in grade 6 through 12 who were discharged, transferred or graduated during the previous school year.",
                "TBD",
                "Per Local Law 44 of 2013, HPD is required to publish building location, affordability, development team and cost information for all housing development projects. The data set includes all required elements of Local Law 44",
                "Monthly consumption and cost data by borough and development. Data set includes utility vendor and meter information.",
                "Survey aides school leaders understand what key members of school community say about learning environment at each school.  Information captured is to support a dialog among school community on how to make school better place."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1317,
                    "shortest_values": [
                        "TBD",
                        "Grantees",
                        "Arts Report",
                        "Local Law 140",
                        "Marking orders"
                    ],
                    "longest_values": [
                        "Not later than October first of each year, the city chief procurement officer shall submit to the speaker of the city council and publish on the mayor’s office of contract services website a report detailing the city’s procurement of preferred source products during the prior fiscal year. Such report shall include the following information for contracts valued at twenty thousand dollars or more whose primary purpose is the purchase of preferred source products, disaggregated by agency: (1) the total dollar value of each preferred source product procured from preferred source vendors; (2) the total dollar value of each preferred source product procured from vendors not identified as preferred source vendors; and (3) the total dollar value of all preferred source products procured.",
                        "The City suspends alternate side parking (street cleaning) regulations, for both street cleaning purposes and traffic flow, on the 34 legal and religious holidays. This includes suspension of street cleaning regulations at metered spaces. This policy is implemented jointly by the Department of Transportation, the Department of Sanitation, and the Police Department. On major legal holidays, No Stopping, No Standing, and No Parking regulations are suspended, except where those regulations are normally in effect seven days a week. On all other holidays, only Street Cleaning Rules are suspended. All other regulations remain in effect. Parking meter regulations will be suspended on major legal holidays.",
                        "The dataset contains the following information for the Fiscal Year it represents: The Transitional Finance Authority’s (“TFA”) debt-incurring power, excluding Building Aid Revenue Bond financing capacity;  The sources of financing for the City's four-year capital program; The amounts of debt service payable on City General Obligation bonds and TFA Future Tax Secured bonds, amounts expected to be outstanding in each of the Financial Plan years for General Obligation and TFA Future Tax Secured bonds, and various debt service and debt ratios as required by the Transitional Finance Authority Act.  This information is required to be reported pursuant to the Transitional Finance Authority Act.",
                        "Number of veterans applying for and being approved for Mitchell-Lama housing, the number of fee-exempt mobile food vending licenses and permits issued by the Department of Health and Mental Hygiene to veterans, the number of general vending licenses issued by the Department of Consumer Affairs to veterans, the number of veterans who submitted applications to the Department of Consumer Affairs for a general vending license, the total number of veterans residing in the city who utilized a HUD-VASH voucher, and the total number of civil service examination applications received by the Department of Citywide Administrative Services for which the applicant claimed a veterans credit.",
                        "DOT Art collaborates with community-based organizations to commission artists to design and install temporary art on DOT property. A minimum of one priority site is identified by local organizations with support from DOT Borough Offices and Operating Units in each borough per application cycle. Selected artists are eligible to receive up to $12,000 towards direct project costs in addition to engineering support. Partner organizations work closely with selected artists throughout the project phases and must agree to maintain the artwork and remediate the site upon completion of the display period. Artwork remains installed for 11 months."
                    ],
                    "average_length": 115.37813211845102
                }
            ]
        },
        {
            "column_name": "Update Frequency",
            "number_non_empty_cells": 1320,
            "number_empty_cells": 0,
            "number_distinct_values": 17,
            "frequent_values": [
                "Annually",
                "Monthly",
                "Quarterly",
                "Historical Data",
                "To Be Determined"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1320,
                    "shortest_values": [
                        "Daily",
                        "daily",
                        "Weekly",
                        "Monthly",
                        "Annually"
                    ],
                    "longest_values": [
                        "Approximately 3 times per year",
                        "To be determined",
                        "To Be Determined",
                        "Historical Data",
                        "Semi-annually"
                    ],
                    "average_length": 9.292424242424243
                }
            ]
        },
        {
            "column_name": "Original Plan Date",
            "number_non_empty_cells": 1320,
            "number_empty_cells": 0,
            "number_distinct_values": 158,
            "frequent_values": [
                "12/31/2018",
                "06/30/2019",
                "12/31/2019",
                "01/01/2014",
                "12/30/2017"
            ],
            "data_types": [
                {
                    "type": "DATE/TIME",
                    "count": 1320,
                    "max_value": "2022-01-31 00:00:00",
                    "min_value": "2013-09-23 00:00:00"
                }
            ]
        },
        {
            "column_name": "Latest Plan Date",
            "number_non_empty_cells": 1320,
            "number_empty_cells": 0,
            "number_distinct_values": 147,
            "frequent_values": [
                "06/30/2019",
                "12/31/2018",
                "12/31/2019",
                "01/01/2014",
                "12/30/2017"
            ],
            "data_types": [
                {
                    "type": "DATE/TIME",
                    "count": 1320,
                    "max_value": "2022-01-31 00:00:00",
                    "min_value": "2013-09-23 00:00:00"
                }
            ]
        },
        {
            "column_name": "Release Status",
            "number_non_empty_cells": 1320,
            "number_empty_cells": 0,
            "number_distinct_values": 6,
            "frequent_values": [
                "Released",
                "Removed from the plan",
                "Scheduled for release",
                "Removed from the portal",
                "Under Review"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1320,
                    "shortest_values": [
                        "Released",
                        "Under Review",
                        "Removed from the plan",
                        "Scheduled for release",
                        "Removed from the Plan"
                    ],
                    "longest_values": [
                        "Removed from the portal",
                        "Removed from the Plan",
                        "Scheduled for release",
                        "Removed from the plan",
                        "Under Review"
                    ],
                    "average_length": 12.243939393939394
                }
            ]
        },
        {
            "column_name": "Release Date",
            "number_non_empty_cells": 886,
            "number_empty_cells": 434,
            "number_distinct_values": 293,
            "frequent_values": [
                "04/09/2019",
                "03/06/2014",
                "03/06/2019",
                "08/02/2016",
                "12/28/2018"
            ],
            "data_types": [
                {
                    "type": "DATE/TIME",
                    "count": 886,
                    "max_value": "2019-09-27 00:00:00",
                    "min_value": "2012-02-14 00:00:00"
                }
            ]
        },
        {
            "column_name": "URL",
            "number_non_empty_cells": 886,
            "number_empty_cells": 434,
            "number_distinct_values": 749,
            "frequent_values": [
                "https://data.cityofnewyork.us/City-Government/Monthly-Indicators/8r6c-ydwk",
                "https://data.cityofnewyork.us/City-Government/18th-Annual-Report-of-the-Commission/mgfw-iixs",
                "https://data.cityofnewyork.us/City-Government/Fiscal-2013-Appendices/s7k9-vr5b",
                "https://data.cityofnewyork.us/Environment/Water-and-Sewer-Permits/4k4u-823g",
                "https://data.cityofnewyork.us/City-Government/Monthly-Performance-Management-Reports-includes-Co/i8ua-bnkj"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 886,
                    "shortest_values": [
                        "https://data.cityofnewyork.us/d/rnjn-x48k",
                        "https://data.cityofnewyork.us/d/93d2-wh7s",
                        "https://data.cityofnewyork.us/d/hu6m-9cfi",
                        "https://data.cityofnewyork.us/d/ucdy-byxd",
                        "https://data.cityofnewyork.us/d/6anw-twe4"
                    ],
                    "longest_values": [
                        "https://data.cityofnewyork.us/Social-Services/Department-for-the-Aging-DFTA-Reported-Line-Item-E/9wgm-cdbe/data",
                        "https://data.cityofnewyork.us/Housing-Development/Buildings-Selected-for-the-Alternative-Enforcement/hcir-3275",
                        "https://data.cityofnewyork.us/Housing-Development/Low-Income-Housing-Tax-Credits-Awarded-by-HPD-Buil/h9ws-rfd9",
                        "https://data.cityofnewyork.us/Transportation/Carshare-Pilot-Locations-Municipal-Garages-and-Lot/2y2t-x83x/data",
                        "https://data.cityofnewyork.us/Housing-Development/Community-Development-Block-Grant-CDBG-Eligibility/qmcw-ur37"
                    ],
                    "average_length": 85.29119638826185
                }
            ]
        },
        {
            "column_name": "U ID",
            "number_non_empty_cells": 885,
            "number_empty_cells": 435,
            "number_distinct_values": 751,
            "frequent_values": [
                "8r6c-ydwk",
                "mgfw-iixs",
                "4k4u-823g",
                "s7k9-vr5b",
                "i8ua-bnkj"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 885,
                    "shortest_values": [
                        "wjr-mhgf",
                        "3f5y-5web",
                        "c49b-3kmd",
                        "vk9f-gvzq",
                        "wha7-46h5"
                    ],
                    "longest_values": [
                        "gkne-dk5s",
                        "yg8h-c8c7",
                        "qmc5-z72r",
                        "9n2i-9h9s",
                        "hpzm-w4pt"
                    ],
                    "average_length": 8.99774011299435
                }
            ]
        },
        {
            "column_name": "Agency Notes",
            "number_non_empty_cells": 515,
            "number_empty_cells": 805,
            "number_distinct_values": 229,
            "frequent_values": [
                "Consolidated into Monthly Indicators dataset",
                "Listed on the portal under Mayor's Office of Contract Services (MOCS)",
                "Agency Has consolidated all of these datasets into the “Projected Sea Level Rise” Dataset",
                "Report format (PDF) not compatible with Open Data portal requirements. Report is publicly accessible: https://comptroller.nyc.gov/services/financial-matters/pension/library/",
                "Does not qualify as “data” according to Local Law 11 of 2012"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 515,
                    "shortest_values": [
                        "ymc8-mg8s",
                        "Data does not exist",
                        "dublicate plan entry",
                        "Data not owned by agency",
                        "Additional review of data"
                    ],
                    "longest_values": [
                        "DOF is the collection agency for 15 Mayoral agencies. CPRR is the repository for the collection of payments made to the City. These payments span across many areas of collection (i.e., parking tickets, property taxes, ECB violations, elevator repairs, FDNY charges, HPD charges, Sanitation charges, DEP charges, etc.). Some data is tax secret and/or private, while other data is already posted onto the Open Data portal (see parking summons data set and property tax dataset). Further, DOF is not the custodial agency for the majority of the payments collected. We do not have any knowledge of why the payment is being collected, the calculations used to arrive at those payment amounts, any penalties assessed, miscellaneous fees, etc. This data comes from the system of record for these payments, not CPRR. For example, STARS is the system of record for parking summons fees. CPRR is responsible for collecting the payment, but has no understanding of the underlying data attached to that payment. STARS data regarding the payment is already distilled and provided within our parking data sets currently on the OD portal. In the alternative, lets say a request is received by DOF regarding elevator charges attached to a property tax bill. DOF is unable to provide any knowledge or understanding as to the nature of that charge. We are only provided with the amount owed by the charging agency. The requestor is referred to DOB for explanation as to the charge and the resulting amount. It is our recommendation that each system of record be responsible for the data surrounding payments and not CPRR. Each agency should have the right to determine what data they provide to the public.",
                        "Several datasets already exist on NYC OpenData to support this and updated daily. Drivers: Medallion Drivers - Active: https://data.cityofnewyork.us/Transportation/Medallion-Drivers-Active/jb3k-j3gpMedallion Drivers - Trained: https://data.cityofnewyork.us/Transportation/Medallion-Drivers-Trained/td5q-ry6dSHL Drivers - Active: https://data.cityofnewyork.us/Transportation/Street-Hail-Livery-Drivers-Active/5tub-eh45For Hire Vehicle Drivers - Active: https://data.cityofnewyork.us/Transportation/For-Hire-Vehicles-FHV-Active-Drivers/xjfq-wh2dFor Hire Vehicles - Active and Inactive: https://data.cityofnewyork.us/Transportation/For-Hire-Vehicles-FHV-Active-and-Inactive-Vehicles/8wbx-tsch.",
                        "The NYPD will not be releasing the OATH (Office of Administrative Trials and Hearings) summons data. These violations, sometimes referred to as quality of life summonses, are already published by OATH and are available at:\nhttps://data.cityofnewyork.us/City-Government/OATH-Hearings-Division-Case-Status/jz4z-kudi/data\nThe summonses provided in this dataset are issued and filed at the OATH Hearings Division by City enforcement agencies, including the NYPD. For the NYPD to post their own dataset would be duplicative and potentially confusing. (2018 NYC Open Data Plan)",
                        "This data is used solely for internal tracking purposes, as a way to determine whether, during a Code Red or Code Blue weather event, agency employees have visited properties under the agency’s jurisdiction to offer homeless individuals the appropriate services. This data, which is of poor quality to begin with, is intended only for internal deliberative, pre-decisional use by agency executive staff in relation to staffing and utilization decisions. It is not data used in the furtherance of the agency’s mission, but rather for internal agency administration.",
                        "The data compiled for this research study do not meet the standard for \"Open Data\" because,\n-they originate from publicly available or proprietary data sources not maintained by DCA;\n-the research was conducted by third parties;\n-the data was processed and aggregated and therefore represents internal work product;\n-the report is publicly available https://www1.nyc.gov/assets/dca/CitywideFinancialServicesStudy/Research-Brief.pdf)\n-data visualization tool is publicly available (https://www1.nyc.gov/assets/dca/CitywideFinancialServicesStudy/index.html)"
                    ],
                    "average_length": 103.66019417475728
                }
            ]
        },
        {
            "column_name": "From the 2019 Open Data Plan?",
            "number_non_empty_cells": 153,
            "number_empty_cells": 1167,
            "number_distinct_values": 1,
            "frequent_values": [
                "Y"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 153,
                    "shortest_values": [
                        "Y"
                    ],
                    "longest_values": [
                        "Y"
                    ],
                    "average_length": 1.0
                }
            ]
        }
    ],
    "key_column_candidates": [
        "Agency",
        "Dataset Name"
    ]
}