{
    "dataset_name": "r67x-e97r",
    "columns": [
        {
            "column_name": "Submitted Question",
            "number_non_empty_cells": 776,
            "number_empty_cells": 0,
            "number_distinct_values": 757,
            "frequent_values": [
                "Is it possible to get a more detailed description of the column values PD_CD and PD_DESC? Perhaps a list of what the individual codes mean so that I can better describe the data in the set?",
                "Does a list of descriptions for the 'complaint_type' column items in the 311 dataset exist anywhere? Trying to make a tool for New Yorkers and community boards to understand the most pressing issues in their areas, but - for example - it's not immediately clear what the \"DOOR/WINDOW\", \"General\", or \"Consumer Complaint\" columns are referring to or what some examples of those complaints might be. \n\nIf a formal collection of definitions or descriptions for the complaint type names doesn't exist currently, could you point me in the direction of someone who might understand those mappings a little better and be able to provide a bit more context. Happy to open source the descriptions from there :)",
                "Hi there! Is there any other data that you could provide related to PB projects, specifically the name of the city agency who is implementing it, the project stage of completion, the time of project start to project finish (if project has been completed), or the actual cost (if the project has been completed)? If not, do you know if there is anywhere else I could access that data?",
                "Manhattan Community Board 08 continues to have issues with Bronx Community Board 08 service requests. As of today, there are over 9k service requests associated with Man CB08. Now that we've rolled out BoardStat, this is a big stick in our data analysis eye.",
                "Is there a way to find a list of all retired lots and it's shapes? We want to use this to connect various datasets that sometime references retired lot."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 776,
                    "shortest_values": [
                        "The issue persists",
                        "Invalid Cert on API",
                        "Data not being updated",
                        "Data has not been updated this month",
                        "Data has not been updated since June."
                    ],
                    "longest_values": [
                        "We've found over 100 discrepancies this month alone after finding only 60 in the first 9 months of the year. \n\n* 0205642360 DSNY Oath shows hearing on 11/2/18/No data on Socrata \n* 0205642351 DSNY Oath shows hearing on 11/2/18/No data on Socrata \n* 0205443380 DSNY Oath shows hearing on 10/29/18/No data on Socrata \n* 0205174449 DSNY Oath shows hearing on 10/26/18/No data on Socrata \n* 044475788H DSNY Oath shows hearing on 10/22/18/No data on Socrata \n* 801441998 DOHMH Oath shows hearing on 10/24/18/No data on Socrata \n* 012079531R FDNY Oath shows hearing on 10/16/18/No data on Socrata \n* 012079532Z FDNY Oath shows hearing on 10/16/18/No data on Socrata \n* 012079533K FDNY Oath shows hearing on 10/16/18/No data on Socrata \n* 012077987X FDNY Oath shows hearing on 10/16/18/No data on Socrata \n* 045361620P DSNY Oath shows updated hearing on 10/23/18/Socrata shows original hearing date of 07/17/18 \n* 042608167Z DSNY Oath shows updated hearing on 10/23/18/Socrata shows original hearing date of 07/18/18 \n* 012080350X FDNY Oath shows hearing on 10/29/18/No data on Socrata \n* 0881106380 DOHMH Oath shows dismissed, $0 due, Socrata says Assigned, $500 due \n* 0881106390 DOHMH Oath shows dismissed, $0 due, Socrata says Assigned, $1,000 due \n* 0881106409 DOHMH Oath shows dismissed, $0 due, Socrata says Assigned, $1,000 due \n* 0600054245 DEP Oath shows hearing on 11/2/18/No data on Socrata \n* 0600054254 DEP Oath shows hearing on 11/2/18/No data on Socrata \n* 0600054263 DEP Oath shows hearing on 11/2/18/No data on Socrata \n* 044052130R DEP Oath shows $0 due/Socrata shows $300.00 due \n* 0600011601 DEP Oath shows $0 due/Socrata shows $1000.00 due \n* 0600011610 DEP Oath shows $0 due/Socrata shows $1000.00 due \n* 0600011620 DEP Oath shows $0 due/Socrata shows $1000.00 due \n* 043977505M DSNY Oath shows $0 due, Socrata shows $130.00 due \n* 171238486 DSNY Oath shows $0 due, Socrata shows $300.00 due \n* 205226680 DSNY Oath shows $0 due Socrataa shows $100 due \n* 0204202433 DSNY Oath shows $0 due, Socrata shows $100.00 due \n* 0205226699 DSNY Oath Shows $0 due, Socrata shows $100.00 due \n* 040809392N DSNY Oath shows $0 due, Socrata shows $25.00 due \n* 011622744X FDNY Oath shows $0 due, Socrata shows $750.00 due \n* 044603930N DSNY Oath shows -$25 due, Socrata shows $25.00 due - client overpaid based on us showing a balance due \n* 0205341979 DSNY Oath Shows $0 due, Socrata shows $100.00 due \n* 0205062835 DSNY Oath shows rescheduled hearing date to 10/31/2018/Socrata shows original hearing date \n* 042589184j DSNY Oath shows rescheduled hearing date to 10/31/2018/Socrata shows original hearing date \n* 0204331830 DSNY Oath shows rescheduled hearing date to 10/31/2018/Socrata shows original hearing date \n* 044644153z DSNY Oath shows rescheduled hearing date to 11/05/2018/Socrata shows original hearing date \n* 043279609z DSNY Oath shows rescheduled hearing date to 11/05/2018/Socrata shows original hearing date \n* 0204038699 DSNY Oath shows rescheduled hearing date to 11/05/2018/Socrata shows original hearing date \n* 042589183h DSNY Oath shows rescheduled hearing date to 11/05/2018/Socrata shows original hearing date \n* 0204038680 DSNY Oath shows rescheduled hearing date to 11/05/2018/Socrata shows original hearing date \n* 042486098l DSNY Oath shows rescheduled hearing date to 11/05/2018/Socrata shows original hearing date \n* 045130067k DSNY Oath shows rescheduled hearing date to 11/05/2018/Socrata shows original hearing date \n* 0801163963 DOHMH Oath Shows $0 due, Socrata shows $1000 due \n* 0801163981 DOHMH Oath shows $0 due, Socrata shows $300 due \n* 0801163972 DOHMH Oath shows $0 due Socrata shows $300.00 due \n* 801434417 DOHMH OATH shows New Issuance/No data on Socrata \n* 801434408 DOHMH OATH shows New Issuance/No data on Socrata \n* 050051553L DEP OATH shows Stipulation Offered/Doesn't exist on Socrata \n* 050051570N DEP OATH shows Stipulation Offered/Doesn't exist on Socrata \n* 204260880 DSNY OATH shows Rescheduled for 10/10/2018, Socrata shows Defaulted hearing for 06/08/2018 \n* 204204267 DSNY OATH shows Rescheduled for 10/10/2018, Socrata shows Defaulted hearing for 06/12/2018 \n* 012077512M FDNY OATH shows hearing date 10/3; Socrata/SC show hearing date 8/29 \n* 881124128 DOH OATH shows hearing date 11/14/No data on Socrata \n* 205174146 DSNY OATH shows hearing date 10/12/No data on Socrata \n* 043558373N DSNY Oath shows hearing date on 11/09/2018/No data on Socrata",
                        "According to the open data portal, the Multi-Agency permits dataset curates data on DOB Jobs permits and DOHMH permits. This dataset is reported to be updated daily, and indeed, the DOB Jobs Permits data appears to be up to date with geography listed for most recent entries. However, when filtering down to the DOHMH data, only about half of the entries have any geography associated with them, and almost none of the entries for food establishment permits that expire after 2016 have any geography associated with them. In addition to this, there are many entries across the dataset that include issuance, expiration, or status dates listed as 01/01/1900. \n\nAfter looking into this issue, we have come to understand that this is likely due to the way that entries are getting updated in the dataset. If there is already a row for the permit holder in the dataset, whenever the permit is updated, a new row is created in the dataset, but only the permit holder, the permit type, and the updated fields are added to the row. All of the other fields that do not change after the update are left blank, or in the case of dates, listed as 01/01/1990. For example, if you filter the dataset to the all of the permits for Harriet’s Kitchen Inc., you would see that there are 9 entries - one for each time the food establishment permit was issued. However, only the first entry has the establishment’s permit number, issuance date, address, BBL, BIN, coordinates, and permit holder’s name. For every other entry these fields are blank or listed as 01/01/1900. For these other entries, only the permit expiration date and permit status date field gets updated. \n\nWe looked into cleaning this on our own, but unfortunately we won’t be able to. We had considered downloading the data, grouping the rows with a common food establishment permit holder name, and filling in the missing fields on newer entries with the data contained in the first entry. However, individual chain stores are often all listed under the same permit name and can have thousands of entries with missing geographic information and unique permit numbers. For instance, Domino’s Pizza LLC has over a thousand entries in dataset, and less than half have a unique license number or geographic information. In this case, we can’t know which Domino’s the row is referring to, and so we do not know, which geographic information and license numbers should be added to which entries. \n\nAt [REDACTED], in collaboration with Manhattan Borough President Gale Brewer's office, we are trying to map where food establishments with active permits are located in the city. We are doing so because we've received requests from community boards and the Manhattan Borough President's staff to make this data more accessible. This is why it will be important to us to be able to access license numbers and expiration dates on the most recent food establishment entries.",
                        "Hi there. I sent a question last week regarding the document_links field (Response ID 1602906), where I asked how I am able to get titles for each link. You referred me to the short_title field, but that does not seem to match what I am seeing.\n\nSee this one as an example: https://a856-cityrecord.nyc.gov/RequestDetail/20180605103\n\nHere is the data from the API:\n\n{ \n\"additional_description_1\": \"<p> \\t<strong>NOTICE OF PUBLIC MEETING </strong></p> <p> \\t<br /> \\tThe City’s Charter Revision Commission will hold a public meeting on Tuesday, June 12, 2018. The issue forum will feature experts to discuss Election Administration, Voter Participation, and Voting Access. The meeting will be held at 125 Worth Street, 2<sup><font size='2'>nd</font></sup> floor Auditorium. This meeting is open to the public. Because this is a public meeting and not a public hearing, the public will have the opportunity to observe the Commission’s discussions, but not testify before it.<br /> \\t<br /> \\t<strong>What if I need assistance to participate in the meeting? </strong>This location is accessible to individuals using wheelchairs or other mobility devices. Induction loop systems and ASL interpreters will be available. In addition, with advance notice, members of the public may request language interpreters. Please make language interpretation requests or additional accessibility requests by 5PM no later than Friday, June 8, 2018 by emailing the Commission at <a>requests@charter.nyc.gov</a>or calling 212-386-5350.</p> <p> \\t </p> <p> \\tA livestream video of this meeting will be available at <a href='https://csmail.nyc.gov/owa/redir.aspx?C=RgTvl5TE6z1apDr7iL78uvPLqm1gDpB4mxaoGgj3lss4h7nwTLvVCA..&URL=http%3a%2f%2fwww1.nyc.gov%2fsite%2fcharter%2fmeetings%2f2018-public-meetings-hearings.page' target='_blank'>nyc.gov/charter</a>.</p> <p> \\t </p>\", \n\"agency_name\": \"Charter Revision Commission\", \n\"city\": \"New York\", \n\"document_links\": \"https://a856-cityrecord.nyc.gov/Search/GetFile?SectionID=1&RequestStatus=Current&RequestID=20180605103&DocumentID=152550\", \n\"end_date\": \"2018-06-12T00:00:00.000\", \n\"event_date\": \"2018-06-12T13:00:00.000\", \n\"request_id\": \"20180605103\", \n\"section_name\": \"Public Hearings and Meetings\", \n\"short_title\": \"NYC Charter Revision Commission Public Meeting\", \n\"start_date\": \"2018-06-07T00:00:00.000\", \n\"state\": \"NY\", \n\"street_address_1\": \"125 Worth Street\", \n\"type_of_notice_description\": \"Meeting\", \n\"zip_code\": \"10013\" \n}\n\nThe link text on your page for the attachments is \"June 12 Public Notice and FAQ\" but this is not in the metadata at all, and does not match the short_title\n\nCan you help?\n\nThanks",
                        "Dear DOI Open Data Coordinator, \nTogether with a group known as the Housing Data Coalition, I’ve been working through the new Evictions dataset published by DOI for pending, scheduled, and executed evictions starting in 2017. I have a number of questions regarding the dataset that I would greatly appreciate any insight into: \n1. We are interested in de-duplicating the dataset to measure aggregate evictions throughout the five boroughs , and there are a number of observations that have a) identical index & docket numbers or b) identical marshal name, address, date, and unit number. Do either the former or the latter indicate duplicate observations? In the former situation, it would make sense that a unique index & docket combination would refer to a unique eviction, as the index # seems to be a unique ID provided by NY Housing Court, and docket # seems to be a unique ID assigned by the marshal. However, there are cases of duplicate index & docket combination assigned to different eviction addresses, unit #s, etc. In the latter situation, we are not sure whether we can rule out the possibility of these duplicates referring to, for example, same-day evictions in different units in the same building (where a marshal might have just recorded one unit # for ease). Please advise on how we should be thinking of de-duplicating this dataset. \n2. Does this dataset constitute the universe of eviction judgments in the five boroughs from the NY Housing Courts? In other words, are there examples where eviction judgments are determined for a certain tenant that goes through NY Housing Court where a Marshal’s eviction would not automatically be scheduled and thus recorded in this dataset? \n3. Relatedly, in the ‘Schedule_Status’ column of the dataset, all ~38k observations are listed as ‘Scheduled’ (in the data dictionary the column is described as either having values ‘Scheduled’, ‘Pending’, or ‘Confirmed). Assuming this is a mistake, when can we expect an update to the data in this column? \n4. The data come with addresses of variable accuracy and without geospatial information, which is in violation of Local Law 108 of 2015, which requires, “every public data set containing address information to utilize a standard field layout and presentation of address information and include corresponding community district and geospatial reference data.” When can standardized addresses and geospatial reference data be expected to be appended to the dataset? \nThanks very much for your engagement with the above questions – we are looking forward to hearing back. \nBest, \n[REDACTED]",
                        "I'm currently exploring some of the City of New York's landmark data and wanted to make sure that I am correctly interpreting the data from this web page: https://data.cityofnewyork.us/Recreation/Individual-Landmarks/ch5p-r223. \n\nUltimately, my goal is to compile and analyze data on all active landmarks.\n\nCan you please answer the following questions? \n\n1. Is it correct to assume that the unique identifier for each officially designated landmark is its LP Number? By way of example, \"Central Park\" has more than 100 entries, all of which have LP-00851. Is it then correct to assume that all of these entries are simply objects or properties that together comprise a single landmark, which is Central Park/LP-00851? \n\n2. Assuming that the LP number refers to the overall landmark, is the \"Object ID\" field the unique identifier that is used to determine the number of items that together comprise that landmark? \n\n3. Putting together the above assumptions, if one seeks to identify the current number of total landmarked objects, is it best to sort for \"Most Current = 1,\" and for \"Status=Designated\"?\n\n3.a. By way of example, in the case of Central Park, if one sorts only for \"Most Current=1\" and \"Status=Designated\", it suggests that Central Park is 1 Landmark (based on its 1 unique LP #) that is comprised of 102 Objects. Is this correct? \n\n3.b. Similarly, if one looks at the entire dataset, and sorts it only for Most Current=1 and Status=Designated, one is left with 1,669 landmarks and 36,877 objects. Understanding that some new landmarks may have changed since this data was uploaded, is this interpretation correct? \n\n3.c. If the above is not correct, what is the best way to think about analyzing the number of official landmarks and the number of objects/properties that are included within broader landmarks?"
                    ],
                    "average_length": 297.20747422680415
                }
            ]
        },
        {
            "column_name": "Submitted Dataset URL",
            "number_non_empty_cells": 718,
            "number_empty_cells": 58,
            "number_distinct_values": 409,
            "frequent_values": [
                "https://data.cityofnewyork.us/City-Government/Civil-Service-List-Active-/vx8i-nprf/data",
                "https://data.cityofnewyork.us/Public-Safety/NYPD-Motor-Vehicle-Collisions/h9gi-nx95",
                "https://data.cityofnewyork.us/Housing-Development/DOB-Permit-Issuance/ipu4-2q9a",
                "https://data.cityofnewyork.us/Housing-Development/DOB-Permit-Issuance/ipu4-2q9a/data",
                "https://data.cityofnewyork.us/City-Government/OATH-Hearings-Division-Case-Status/jz4z-kudi/data"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 718,
                    "shortest_values": [
                        "http://www.fdny.org",
                        "http://www.rumcsi.org",
                        "https://maps.nyc.gov/crime/",
                        "http://TLC LIcesned FHV drivers",
                        "http://gis.nyc.gov/taxmap/map.htm"
                    ],
                    "longest_values": [
                        "https://data.cityofnewyork.us/api/id/fhrw-4uyv.csv?$select=*&$order=%27created_date%27+DESC&$limit=40000&$offset=0&$where=(`agency`%20%3D%20%27DOT%27)%20AND%20%60created_date%60%20%3E%3D%20%272019-02-30T00%3A00%3A00%27%20AND%20%60created_date%60%20%3C%20%272019-02-04T23%3A59%3A59%27&$$read_from_nbe=true&$$version=2.1",
                        "https://data.cityofnewyork.us/api/views/a35y-93e7/files/95ea8be1-bac7-47de-a8a7-dadea2866a81?download=true&filename=OCDV_Open_Data_Data_Dictionary_Data_Fam_Rel_Sanp_Shot_Data_2017.xlsx",
                        "I am writing to inform that my residency credit was not applied for the FDNY open competitive exam 7001. I’d like to be advise on how to proceed with this matter.",
                        "https://data.cityofnewyork.us/api/views/y9gu-cxxw/files/c7516c9c-db82-429d-9f69-fb2dc796abc5?download=true&filename=NYCgov_Poverty_Measure_Data_Dictionary.xlsx",
                        "https://data.cityofnewyork.us/NYC-BigApps/Citi-Bike-Live-Station-Feed-JSON-/p94q-8hxh?category=NYC-BigApps&view_name=Citi-Bike-Live-Station-Feed-JSON-"
                    ],
                    "average_length": 84.13788300835654
                }
            ]
        },
        {
            "column_name": "Response",
            "number_non_empty_cells": 736,
            "number_empty_cells": 40,
            "number_distinct_values": 697,
            "frequent_values": [
                "Thank you for contacting NYC Open Data Help Desk. If you believe that your score on this Exam is incorrect, please follow the instructions on the Notice of Result, which you should be receiving in the mail in about ten days\n​\nThank you,\n-Department of Citywide Administrative Services (DCAS)",
                "​Thank you for contacting NYC Open Data Help Desk. Please be advised that this issue was resolved.\n\nThank you,\n- NYC Open Data Team",
                "https://data.cityofnewyork.us/City-Government/OATH-Hearings-Division-Case-Status/jz4z-kudi\n\nThank you for contacting NYC Open Data Help Desk. Please be advised that the OATH Hearings Division Case Status dataset was updated with the latest available information.\n\nThank you,\n- NYC Open Data Team",
                "https://data.cityofnewyork.us/City-Government/OATH-Hearings-Division-Case-Status/jz4z-kudi/\n\nThank you for contacting NYC Open Data Help Desk. Please be advised that the OATH Hearings Division Case Status dataset was updated with the latest available information.\n\nThank you,\n- NYC Open Data Team",
                "Thank you for contacting NYC Open Data Help Desk. Please be advised that these discrepancies are caused by the bug in the Datashare workflow. OATH has opened a service ticket to resolve this issue, which is currently pending. Unfortunately, we do not have estimated time frame for this bug fix.\n\nThank you,\n-NYC Open Data"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 736,
                    "shortest_values": [
                        "NYC does not have an API available.",
                        "This dataset has been updated. Thanks!",
                        "hese are the co-locations for the SY 2016-17 only.",
                        "For questions, please email newdriverapp@tlc.nyc.gov.",
                        "This dataset includes all 311 Service Requests. Thanks!"
                    ],
                    "longest_values": [
                        "Thank you for contacting NYC Open Data Help Desk. Please see agency's response below:\n​\n​1. We are interested in de-duplicating the dataset to measure aggregate evictions throughout the five boroughs, and there are a number of observations that have a) identical index & docket numbers or b) identical marshal name, address, date, and unit number. Do either the former or the latter indicate duplicate observations? In the former situation, it would make sense that a unique index & docket combination would refer to a unique eviction, as the index # seems to be a unique ID provided by NY Housing Court, and docket # seems to be a unique ID assigned by the marshal. However, there are cases of duplicate index & docket combination assigned to different eviction addresses, unit #s, etc. In the latter situation, we are not sure whether we can rule out the possibility of these duplicates referring to, for example, same-day evictions in different units in the same building (where a marshal might have just recorded one unit # for ease). Please advise on how we should be thinking of de-duplicating this dataset. \n​\n​The court assigns each eviction/legal possession case a unique index number. Docket numbers are assigned by a marshal’s office but one case may carry different docket numbers. For example, should the landlord instruct the marshal to request separate warrants for each of the respondents named in the case, each respondent will be entered as a separate docket. Some marshals add a letter “b or “c” to the docket number, which is an indication that there is more than one warrant of eviction associated to one index number. Also, an index number may be linked to different floors within the same address (Example, 2 or 3 family home occupied by an entire family or by unidentified squatters. In sum, one index number, with one or more docket numbers, is one or more eviction(s). \n​\n​Moreover, different county courts (Kings, Queens, Bronx, Manhattan and Richmond) may use the same index number used in other counties for different eviction cases. Some marshals may add the first letter of the corresponding county to indicate which borough it came from. In short, there can be one index number, for different addresses in different counties. \n​\n​2. Does this dataset constitute the universe of eviction judgments in the five boroughs from the NY Housing Courts? In other words, are there examples where eviction judgments are determined for a certain tenant that goes through NY Housing Court where a Marshal’s eviction would not automatically be scheduled and thus recorded in this dataset?\n\nThis dataset will never constitute the entire universe of “eviction judgments.”\n\nPetitioners may obtain a court ordered judgment of eviction and, through later negotiations among the parties, the matter is settled privately without a marshal ever having been contacted by the petitioner. These private negotiations/agreements between petitioner and respondent may take place at any time (before the marshal requests the warrant, before or after the marshal serves notice, after the marshal has scheduled an eviction…)\n\nThere was one marshal who was not using the program because according to the handbook, he had a low volume of eviction cases and he did not have to be computerized. However, the marshal is no longer doing evictions. \n\n3. Relatedly, in the ‘Schedule Status’ column of the dataset, all ~38k observations are listed as ‘Scheduled’ (in the data dictionary the column is described as either having values ‘Scheduled’, ‘Pending’, or ‘Confirmed). Assuming this is a mistake, when can we expect an update to the data in this column? \n\n​This ‘Scheduled Status’ field should read either “Pending,” meaning not yet scheduled, or “Scheduled” meaning it’s on the marshal’s calendar. This is the way it should appear on open data. The actual scheduled date and pending evictions are not for publication due to safety reasons. The CPR has a “Confirmed” field which is an automatic confirmation, generated by the CPR system, to the marshals confirming that the next day’s eviction schedule was received by the system, no later than 4:00 pm. If they don’t receive this confirmation they do not have DOI’s approval to go forward with their evictions. This has nothing to do with public information, this is for DOI’s regulatory purposes. \n\n4. The data come with addresses of variable accuracy and without geospatial information, which is in violation of Local Law 108 of 2015, which requires, “every public data set containing address information to utilize a standard field layout and presentation of address information and include corresponding community district and geospatial reference data.” When can standardized addresses and geospatial reference data be expected to be appended to the dataset? \n\nThere is some merit to this point. Not all datasets published in OpenData come with geospatial information. In fact, not all development teams if any are trained to include exactly what is in LL108. If this was a problem, the Open Data team would have stopped publishing any dataset and required us to make remediation steps before publishing as they are the gatekeepers and we need to adhere to certain standards. Knowing this now, I will know better going forward since we have the capability now as well. To address the present problem specific to this set, it seems clear that the requester is asking for house numbers and street numbers to be split so the dataset can be geocoded either on our side or their side. The desktop geocoder is available for the public from DCP to use, so they would need to run the dataset through that if they wanted everything. Because the law doesn’t say which reference data other than Community District, the vagueness does not help guide us to what else is needed other than having the requester self-service the rest through the desktop geocoder. It not that it isn’t available, it just won’t be easy to get ‘the rest’ of whatever the requester is seeking. So we would need the house number and street name split for us to geocode it and it is work I would assist you putting in an intake to secure this as a project enhancement. This would be the prime opportunity, if you want to proceed, to add more fields that DOI may need (e.g. case type, number of Order to show cause). I would suggest the public request revision of LL108 to be more specific on what kind of geospatial reference data. As far as I know, the address is a valid piece of information that is technically geospatial reference data already without more specifics on the definition. Here’s the actual LL108. https://www1.nyc.gov/assets/buildings/local_laws/ll108of2015.pdf\n\n​\n​Thank you,\n​-NYC Department of Investigation (DOI)",
                        "The answers are as follows:\n\n \nWhy are there sometimes multiple deeds filed on one day for a give tax lot?\nThis is the nature of property sales and is controlled by the buyers and sellers and not the Department of Finance so we would not be able to list all reasons. Note that there is no requirement to record a deed when the property sells although transfer taxes returns must still be filed. With that said two common occurrences are:\nFlips where party A sells the property to party B who then sells the property to party C. By looking at the document dates on the two deeds you can tell how long B help the property and often that will imply what B did with the property.\nSettlement of an estate. In this case party A passes away and leaves the property to party B. Party B then only records the deed associated with this transfer then he sells to party C immediately prior to the recording for the deed from B to C.\n \nWhen the last deed transaction date shows multiple deeds file on the same day, how can we determine the current property owner of the tax lot?\nGenerally speaking one should order by the document date from newest to oldest, next by CRFN from highest to lowest and finally by document id from highest to lowest. Note that the document id ordering is only useful for documents without CRFN which are those documents recorded prior to 1/1/2003 and brought into ACRIS from systems pre-dating ACRIS.\n   \nWhat does a ‘docamount’ value of 0 on a deed signify, specifically when the deed is filed the same day as other deeds with non-zero ‘docamount’ value?\nAs noted in the Data Dictionary for the Real Property Master dataset, the Document Amount field is the “Total Consideration for Transfers and Principal debt or obligation for Mortgages”. For deeds you can think of the Document Amount as the sales price. With this in mind, a Document Amount of 0 means the property was transferred with any money changing hands. There can be many reason for a $0 consider, but normally it means the transfer is not an “arms-length” transaction among unrelated parties. The reason most commonly associated with multiple deeds recorded the same day, some of which have non-zero consideration, is the settlement of an estate as mentioned earlier. When party B inherits the property from party A, no money changes hand; however when B sells to C, it is for a non-zero amount.\n\n\nHow are ‘documentid’ values ordered, if at all?\n   There are three formats of Document ID in ACRIS. These are:\n  \nYYYYMMDDsssssttt = the format of documents record since 1/1/2003 where YYYY is the 4 digit year, MM is the 2 digit month, DD is the 2 digit day, sssss is a 5 digit sequence number within a day and ttt is a 3 digit sequence number within an ACRIS transaction. Document IDs in this format are assigned when the document submitter prepares the documents for recording. Documents with common ACRIS cover page transaction number, YYYYMMDDsssss, are submitted together and recorded in the order specified by sss. There is no significance to the ordering of the ACRIS cover page transaction numbers. Two submitters could prepare the documents for recording on the same day so share the YYYYMMDD portion of the document id, but could actually submit and have their documents recorded weeks or even months apart.\nFT_Bssssssssssss = the format of documents whose index data was converted to ACRIS from the system immediately pre-dating ACRIS. In this format FT_ prefix is fixed, B is the property borough and ssssssssssss is a sequence number that increases with recording date.\nBK_Btttttttttttt = the format of older documents whose microfilm images where indexed and imported into ACRIS. In this format the BK_ prefix is fixed, B is the property borough and tttttttttttt is a sequence number that increases with recording date. Note that BK_ documents are older than FT_ documents.\nWith this in mind, ordering FT_ and BK_ Document IDs has significance, but ordering Document IDs staring with 20 does not. For documents with Document ID starting with 20, use the CRFN which is a number with format YYYYrrrrrrrrr where YYYY is the year and rrrrrrrrr is a 9 digit padded sequence number which is reset each year and is monotonically increasing with recording date and time. \n\n\nRegards,\nDOF",
                        "Thank you for contacting NYC Open Data Help Desk. Please see below the responses to your questions:\n​\n​For the hearingstatus variable, I am unable to find any information as to what some of the terms mean:\nWhile I am aware that “ASSIGNED” means “summons had a hearing, the case is assigned, and a decision is pending but do the following mean, exactly: “ASSIGNED TO APPEALS”; “HRG BEFORE ASSIGN”; “PERFECTION REQUIRED”; “STAY REQUESTED”; “STAYED”; and STIPULATION OFFERED. For the last one, specifically, what is the difference between “STIP NEEDS REVIEW” (which means “Stipulation offered by enforcement agency (petitioner) and stipulation was accepted by respondent”) and “STIPULATION OFFERED”? \n\nAssigned – Assigned to a hearing officer. \nAssigned to Appeals – the summons has had an appeal filed and is with our appeals department\nHrg before assign – the summons was heard before OATH got a copy of it\nPerfection Required -- An appeal has been entered but there is still paperwork that needs to be filed for the appeal to progress\nStay Requested – the respondent has filed a request to stay a case and prevent it from progressing (to default/docketing/collections etc.)\nStayed – For a variety of legal reasons (e.g., a respondent request, a hold pending some kind of negotiation or legal case), the case has a stay placed on it\nStipulation offered – this is a program that allows certain Buildings cases to be settled before a hearing subject to certain conditions. This indicator means that the offer of stipulation was sent out by OATH on behalf of the issuing agency.\nStip needs review – A respondent has accepted the offer of stipulation but for a variety of reasons, the stipulation may require intervention by OATH staff in order to be processed\n\nFor the hearingresult variable, what does “COSRV INVIO” mean? Likewise for “POP IN-VIOL” and “SETTL IN-VIO”. I am unable to find any information on your website as to what they refer to. Also, how different are these 3 above-listed values from “IN VIOLATION” and what specifically does this mean? Are there overlaps in meaning? \n\n​​COSRV INVIO means \"In Violation, Community Service Eligible\" and applies only to summonses related to the Criminal Justice Reform Act (CJRA), for which community service is an available alternative to payment of a fine for an In Violation summons. \nPOP In Vio means \"In Violation – Publicly Owned Property\" – the respondent is the city itself. In these cases, the agency that owns the property isn't required to pay.\nSettl In Vio means that there was a settlement prior to hearing and the respondent is recorded as having been in violation as a condition of to that settlement\n​They all mean that the finding is that the respondent is in violation. \n​\n​Also, could you please enlighten me as to what the prefix “SAU” stands for in the scheduledhearinglocation and the decisionlocationborough variables. This prefix “SAU:” is placed before every borough. For example, “SAU: BKLN” or “SAU”MANH”. \n\nSAU signifies that a case was assigned to the Hearings by Mail unit\n​\n​Finally, I am not sure if this is a typo but in the violationdescription variable, besides “ASBESTOS”, “BAR”, “COMMERCIAL”, “FIRE”, “MULTIPLE DWELLING”, and “NOISE” there is the “1 -D142 2 FAMILY” value whose meaning I cannot fathom. \n\n​This field is used by various agencies to store various information, generally indicating something additional (a building type, a violation type) – it’s not consistent across OATH’s data. I will contact Open Data to see how they're assembling it\n​\nThank you,\n-Office of Administrative Trials and Hearings",
                        "Greetings,\n\n1. Is it correct to assume that the unique identifier for each officially designated landmark is its LP Number? By way of example, \"Central Park\" has more than 100 entries, all of which have LP-00851. Is it then correct to assume that all of these entries are simply objects or properties that together comprise a single landmark, which is Central Park/LP-00851?\nAnswer: Yes, it is correct to assume that the unique ID for each designated landmark is its LP number and that all of the points are elements that make up one designation.\n\n2. Assuming that the LP number refers to the overall landmark, is the \"Object ID\" field the unique identifier that is used to determine the number of items that together comprise that landmark?\nAnswer: Yes, and that would give the total number of ‘buildings and sites’ that make up a designated landmark.\n\n3. Putting together the above assumptions, if one seeks to identify the current number of total landmarked objects, is it best to sort for \"Most Current = 1,\" and for \"Status=Designated\".\nAnswer: In addition to Most_Current = 1 and Status = Designated you’ll also want to sort Last_Action = Designated.\n\n3a. By way of example, in the case of Central Park, if one sorts only for \"Most Current=1\" and \"Status=Designated\", it suggests that Central Park is 1 Landmark (based on its 1 unique LP #) that is comprised of 102 Objects. Is this correct?\nAnswer: Yes, 102 ‘buildings and sites’ that make up the Central Park designation.\n\n3b. Similarly, if one looks at the entire dataset, and sorts it only for Most Current=1 and Status=Designated, one is left with 1,669 landmarks and 36,877 objects. Understanding that some new landmarks may have changed since this data was uploaded, is this interpretation correct?\nAnswer: Yes, that sounds correct for the time period in which the data was last updated. The official count for designated landmarks as it stands today is 1672 made up of 36,982 buildings and sites. We’ll be uploading an updated version of all of our shapefiles in the very near future.\n\n- Landmarks Preservation Commission (LPC)\n- NYC Open Data",
                        "Thank you for your feedback! The data dictionary is definitely a work in progress, and feedback from users like you helps me to improve it. I'll respond to each of your questions below:\n\nThe Permittee's License Type field contains acronyms for license type, where the link that you refer to contains acronyms for permit and job type. It is confusing because there is some overlap (ex: DM) but the data dictionary is still providing the most accurate information for this particular field's values.\nI missed two expected values for the Permittee's License Type field, DM and HI. Thanks for pointing that out. I'll update it. At a glance I do not know what they mean, so along with NW and OW, it will take a little while for me to research that. I suspect that \"DM\" is not really a license type and is just a placeholder to indicate that the permittee is authorized to perform demolitions. But I'll have to confirm that. \nYou say that \"the open data site refers to a dead link\". I didn't see that link anywhere. Please let me know on what page you found the link so that I can investigate.\nYou request the addition of Job Description to this dataset. The Job Description is already available in DOB Job Application Filings, which you can cross reference with the Job Number provided in the permit dataset. I understand that this creates an extra step for you. Adding the field to the dataset will create an extra step for us that could take months to implement.  I'll bring your request back to my team for review, but please understand that we have higher priority requests to attend to first."
                    ],
                    "average_length": 363.5421195652174
                }
            ]
        }
    ],
    "key_column_candidates": []
}