{
    "dataset_name": "sjdi-a6us",
    "columns": [
        {
            "column_name": "Agency",
            "number_non_empty_cells": 121,
            "number_empty_cells": 0,
            "number_distinct_values": 28,
            "frequent_values": [
                "Department of Transportation (DOT)",
                "Department of Consumer Affairs (DCA)",
                "Business Integrity Commission (BIC)",
                "Department of Finance (DOF)",
                "Department of Small Business Services (SBS)"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 121,
                    "shortest_values": [
                        "NYC Recovery",
                        "Law Department (LAW)",
                        "Police Department (NYPD)",
                        "Department of Finance (DOF)",
                        "Department of Buildings (DOB)"
                    ],
                    "longest_values": [
                        "Department of Information Technology and Telecommunications (DoITT)",
                        "Department of Citywide Administrative Services (DCAS)",
                        "Department of Youth and Community Development (DYCD)",
                        "Office of Administrative Trials and Hearings (OATH)",
                        "Mayor's Office of Environmental Remediation (MOER)"
                    ],
                    "average_length": 37.37190082644628
                }
            ]
        },
        {
            "column_name": "Dataset Title",
            "number_non_empty_cells": 121,
            "number_empty_cells": 0,
            "number_distinct_values": 120,
            "frequent_values": [
                "Community Board Members",
                "List of Class 1 Registrants",
                "Street Lighting Work Orders",
                "Performance Evaluations by Agency report",
                "Complete list of the New York City Fire Department holdings as of the close of the fiscal year"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 121,
                    "shortest_values": [
                        "DEFO",
                        "Unifier",
                        "Arrests",
                        "GangMenu",
                        "GPS Data"
                    ],
                    "longest_values": [
                        "Complete list of the New York City Employees' Retirement System holdings as of the close of the fiscal year",
                        "Complete list of holdings as of the close of the fiscal year for all five New York City Retirement Systems",
                        "Complete list of the New York City Fire Department holdings as of the close of the fiscal year",
                        "Annual Incident Data Report, Physical Restraints in Detention of Youth in Custody",
                        "Fatal Crashes involving a truck belonging to BIC licensees or registrants"
                    ],
                    "average_length": 31.636363636363637
                }
            ]
        },
        {
            "column_name": "Dataset Description",
            "number_non_empty_cells": 121,
            "number_empty_cells": 0,
            "number_distinct_values": 121,
            "frequent_values": [
                "Citywide fleet information.",
                "Associated address for clients in DHS shelter.",
                "The dataset contains the names and contact information of all BIC Class 2 Broker Registrants.",
                "Complete list of the New York City Employees' Retirement System holdings as of the close of the fiscal year.",
                "List of Paid Sick Leave complaints received by DCA."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 121,
                    "shortest_values": [
                        "Surveys.",
                        "HireNYC.",
                        "BID Documents.",
                        "Waterfront Records.",
                        "M/WBE Certifications."
                    ],
                    "longest_values": [
                        "The New York City Department of Transportation is responsible for keeping the City's streets in good repair. The Agency performs ongoing assessment of New York City streets. Ratings are based on a scale from 1 to 10, and results are grouped in the following categories: Good (%) - ratings of 8 to 10, Fair (%) - ratings of 4 to 7, and Poor (%) - ratings of 1 to 3. This data will allow you to create a map. .",
                        "Signs Information Management System (SIMS) is a map-based asset management and workflow system that is used to manage parking, regulatory, guide and warning signs.  It controls the signs workflow from the proposal of a new regulation to its installation, and maintains a history of sign assets and sign orders for all regulated intersections, blocks and corridors in New York City.",
                        "Excel table that shows annual admissions to detention by:  age, race, gender, admitting authority and top arrest charge level and  zip code disaggregated by detention setting experience including transfers between Secure and Non-Secure detention.  Also includes the Average Daily Population in secure and non-secure detention and summary of detention experience.",
                        "Quarterly Reports for Fiscal Year 2017 of the number of physical and mechanical restraints in Detention on Youth in Custody; Fights and Altercations between Youth in Custody, and other incidents resulting in injuries to youth in custody and instances of room confinement and length of time of confinement per quarter.",
                        "Complete list of holdings as of the close of the fiscal year for the New York City Board of Education Retirement System, Employees' Retirement System, the New York City Teachers' Retirement System, the New York City Fire Department Pension Fund, and the New York City Police Department Pension Fund."
                    ],
                    "average_length": 109.76859504132231
                }
            ]
        },
        {
            "column_name": "Number of FOIL request\nThe number of responses to FOIL requests, in the past fiscal year, using data from this dataset.",
            "number_non_empty_cells": 121,
            "number_empty_cells": 0,
            "number_distinct_values": 31,
            "frequent_values": [
                "1",
                "2",
                "3",
                "4",
                "5"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 119,
                    "max_value": 1917,
                    "min_value": 1,
                    "mean": 62.53781512605042,
                    "stddev": 248.950259616843
                },
                {
                    "type": "TEXT",
                    "count": 2,
                    "shortest_values": [
                        ">1500.  These are from enitities conducting Environmental Phase I assessments to allow building contruction or renovation or sale.",
                        ">100. We do not track these specifically.  When possible we refer to OpenData, but many want underlying documents for licenses, so not really a \"data\" request."
                    ],
                    "longest_values": [
                        ">100. We do not track these specifically.  When possible we refer to OpenData, but many want underlying documents for licenses, so not really a \"data\" request.",
                        ">1500.  These are from enitities conducting Environmental Phase I assessments to allow building contruction or renovation or sale."
                    ],
                    "average_length": 144.5
                }
            ]
        },
        {
            "column_name": "Dataset on Open Data?\nIs this dataset published on the Open Data portal or listed on the Open Data plan for future publication?",
            "number_non_empty_cells": 121,
            "number_empty_cells": 0,
            "number_distinct_values": 3,
            "frequent_values": [
                "No",
                "Yes",
                "Partial"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 121,
                    "shortest_values": [
                        "No",
                        "Yes",
                        "Partial"
                    ],
                    "longest_values": [
                        "Partial",
                        "Yes",
                        "No"
                    ],
                    "average_length": 2.628099173553719
                }
            ]
        },
        {
            "column_name": "Reason not public\nIf \"not on open data,\" is there any reason the dataset should not be made public? If not, please add reason (e.g., privacy, security, other)",
            "number_non_empty_cells": 84,
            "number_empty_cells": 37,
            "number_distinct_values": 51,
            "frequent_values": [
                "These are ad-hoc requests that cannot be quantifiably provided to Open Data in a format that would be relevant to the user. The information is generally provided in multiple formats depending on the nature of the FOIL request.",
                "Under Review.",
                "In review to determine posting",
                "In the process of getting it online.",
                "It has not been published yet to the Open Data portal."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 84,
                    "shortest_values": [
                        "In Progress.",
                        "Under Review.",
                        "Planned for release in 2018.",
                        "In review to determine posting",
                        "Scheduled for 2018 publication."
                    ],
                    "longest_values": [
                        "Performance Evaluation reports will not be made public at this time.  As of FY 2018, Performance Evaluations are being conducted in PASSPort, and the previous source of record (VENDEX) has been deprecated.  Matters of governance including the structure of public-facing data, the presentation of current (PASSPort) vs legacy (MOCS) data and retention policies are all under development.  It is expected that the publication of this data will fall outside the 2019 Fiscal Year.",
                        "The related entity list will not be made public at this time. As of FY 2018, the related entity list is data generated in PASSPort. The previous source of record, VENDEX, has been deprecated.  Matters of governance including the structure of public-facing data, the presentation of current (PASSPort) vs legacy (MOCS) data and retention policies are under development.  It is expected that the publication of this data will fall outside the 2019 Fiscal Year.",
                        "Caution reports will not be made public at this time.  As of FY 2018, Cautions are being conducted in PASSPort, and the previous source of record (VENDEX) has been deprecated.  Matters of governance including the structure of public-facing data, the presentation of current (PASSPort) vs legacy (MOCS) data and retention policies are all under development.  It is expected that the publication of this data will fall outside the 2019 Fiscal Year.",
                        "Currently this dataset stored in two different sources (CSV and Online Portal), it's inconsistent thus the quality of the data is poor. We are planning to integrate data sources, clean the dataset and collect customer register only via Online Portal in the future.",
                        "Vacant newsstands information is maintained manually and cannot be reported accurately on a scheduled basis.  Newly constructed newsstand data will be reflected in the \"Legally Operating Businesses\" dataset once a license is granted."
                    ],
                    "average_length": 109.30952380952381
                }
            ]
        }
    ],
    "key_column_candidates": [
        "Dataset Description"
    ]
}