{
    "dataset_name": "ws4c-4g69",
    "columns": [
        {
            "column_name": "Agency",
            "number_non_empty_cells": 594,
            "number_empty_cells": 0,
            "number_distinct_values": 9,
            "frequent_values": [
                "Department of Youth and Community Development",
                "Criminal Justice Coordinator",
                "Human Resources Administration",
                "Department of Probation",
                "Administration for Children's Services"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 594,
                    "shortest_values": [
                        "Small Business Services",
                        "Department of Probation",
                        "Criminal Justice Coordinator",
                        "Human Resources Administration",
                        "Department of Homeless Services"
                    ],
                    "longest_values": [
                        "Department of Housing Preservation and Development",
                        "Department of Youth and Community Development",
                        "Department of Health and Mental Hygiene",
                        "Administration for Children's Services",
                        "Department of Homeless Services"
                    ],
                    "average_length": 42.148148148148145
                }
            ]
        },
        {
            "column_name": "EPIN",
            "number_non_empty_cells": 594,
            "number_empty_cells": 0,
            "number_distinct_values": 72,
            "frequent_values": [
                "26015I0006",
                "26015I0002",
                "26015I0007",
                "26015I0004",
                "26015I0005"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 594,
                    "shortest_values": [
                        "80114I0002",
                        "78115I0002",
                        "78115I0001",
                        "78114I0001",
                        "26014I0036"
                    ],
                    "longest_values": [
                        "06814I0003",
                        "06814I0002",
                        "26014I0002",
                        "26014I0034",
                        "26014I0004"
                    ],
                    "average_length": 10.0
                }
            ]
        },
        {
            "column_name": "Procurement Title",
            "number_non_empty_cells": 594,
            "number_empty_cells": 0,
            "number_distinct_values": 72,
            "frequent_values": [
                "NDA - Opportunity Youth: Supported Work Experience",
                "NDA - Support Services for Healthy Families",
                "NDA - Adult Literacy",
                "NDA - Support Services for Immigrants",
                "NDA - Support Services for Housing"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 594,
                    "shortest_values": [
                        "Respite Care",
                        "NDA - Adult Literacy",
                        "Mobile Response Teams",
                        "Parent Pledge Project",
                        "Nurse-Family Partnership"
                    ],
                    "longest_values": [
                        "Next STEPS (Striving Toward Engagement and Peaceful Solutions): A Transformative Mentoring Intervention",
                        "Next STEPS (Striving Toward Engagement and Peaceful Solutions) - Red Hook/Fort Greene",
                        "Crime Victims Services: Family Justice Center Intake, Assessment, and Case Management",
                        "Deferred Action for Childhood Arrivals (DACA) Community Outreach - Staten Island",
                        "Deferred Action for Childhood Arrivals (DACA) Community Outreach - Manhattan"
                    ],
                    "average_length": 44.35521885521886
                }
            ]
        },
        {
            "column_name": "Procurement Description",
            "number_non_empty_cells": 594,
            "number_empty_cells": 0,
            "number_distinct_values": 42,
            "frequent_values": [
                "Mayor de Blasio and his administration have made a commitment to increase access to afterschool programs by New York City’s middle school students. These programs provide youth with the support of caring adults and engaging, fun activities that can help them address the challenges of early adolescence. In accordance with its mission to support the City’s youth and their families by funding high-quality youth and community development programs, DYCD launched its Out-of School Time (OST) initiative. The OST system offers students in grades K-12 a mix of academic, recreational and cultural activities. The programs are free of charge and located in neighborhoods across all five boroughs. DYCD is seeking qualified nonprofit organizations to operate OST programs in each public school (including charter schools) serving grades 6-8 and currently lacking comprehensive afterschool services (“Eligible Middle School”). For charter schools to be eligible, they must have a regular dismissal time of 3 p.m. and lack a comprehensive afterschool program. The new programs will operate for 15 hours per week during the school year for a total of 540 hours annually. At least 9 hours per week will be devoted to structured, goal-oriented programming, with the remaining 6 hours being available for drop-in activities. Of the total 540 hours, 216 hours of activities may be unstructured and offered during the school week or on school closing days. All programs will provide academic enrichment, leadership development and physical activity. Providers will work in close collaboration with the host school to recruit and retain struggling students, enhance the program design, and align structured activities with school-day learning. Schools, in turn, will make in-kind contributions to the programs, such as teacher time and curricular resources, in addition to providing classroom space and access to school facilities such as the gymnasium, computer labs and library. The procurement for the OST Middle School Expansion initiative will be organized into 32 solicitations, one for each school district with a cohort of Eligible Middle Schools. ",
                "As the City's Community Action Agency, DYCD is the recipient of federal Community Services Block Grant (CSBG) funds through the State of New York and is responsible for distributing funding for programs on a local level in accordance with the goals of the CSBG statute. In order to maximize the impact of CSBG funding, DYCD targets programs to low income communities, which it designates as Neighborhood Development Areas (NDA). Each NDA is represented by a Neighborhood Advisory Board (NAB) which conducts needs assessments for social services in their NDAs. According to the priorities identified by the NABs, this RFP will seek qualified organizations to provide supported work experience services to Opportunity Youth. These services would include a paid work experience for youth 16-24 who are not working and not in school. Only nonprofit organizations are eligible to propose.",
                "As the City’s Community Action Agency, DYCD is the recipient of federal Community Services Block Grant (CSBG) funds through the State of New York and is responsible for distributing funding for programs on a local level in accordance with the goals of the CSBG statute. In order to maximize the impact of CSBG funding, DYCD targets programs to low income communities, which it designates as Neighborhood Development Areas (NDA). Each NDA is represented by a Neighborhood Advisory Board (NAB) which conducts needs assessments for social services in their NDAs. According to the priorities identified by the NABs, this RFP will seek qualified organizations to provide Support Services for Healthy Families. Programs would assist families in accessing resources to address identified needs, including child care, elder care, child support, parenting, employment, education, housing, legal assistance, health, nutrition, and addressing violence, domestic violence and risky behaviors. Only nonprofit organizations will be eligible to apply.",
                "As the City's Community Action Agency, DYCD is the recipient of federal Community Services Block Grant (CSBG) funds through the State of New York and is responsible for distributing funding for programs on a local level in accordance with the goals of the CSBG statute. In order to maximize the impact of CSBG funding, DYCD targets programs to low income communities, which it designates as Neighborhood Development Areas (NDA). Each NDA is represented by a Neighborhood Advisory Board (NAB) which conducts needs assessments for social services in their NDAs. According to the priorities identified by the NABs, this RFP will seek qualified organizations to provide Support Services for Immigrants. Programs would assist participants in accessing government benefits; legal assistance, including assistance with matters related to citizenship and immigration status, education, employment, health care and social services. Only nonprofit organizations will be eligible to apply.",
                "As the City's Community Action Agency, DYCD is the recipient of federal Community Services Block Grant (CSBG) funds through the State of New York and is responsible for distributing funding for programs on a local level in accordance with the goals of the CSBG statute. In order to maximize the impact of CSBG funding, DYCD targets programs to low income communities, which it designates as Neighborhood Development Areas (NDA). Each NDA is represented by a Neighborhood Advisory Board (NAB) which conducts needs assessments for social services in their NDAs. According to the priorities identified by the NABs, this RFP will seek qualified organizations to provide Support Services for Housing. Housing programs would provide assistance to low income tenants and homeowners and tenant groups with the goal of maintaining or attaining adequate, affordable, and safe housing. Only nonprofit organizations will be eligible to apply."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 594,
                    "shortest_values": [
                        "Through Next STEPS, DOP is bringing a transformative mentoring approach to high risk youth (not necessarily on probation) who live in and around targeted New York City Housing Authority (NYCHA) housing developments. Through this RFP, DOP is seeking appropriately qualified vendors to provide these services in targeted NYCHA housing developments in Red Hook/Fort Greene, Brooklyn. Next STEPS is part of a broader initiative to make New York City’s neighborhoods and housing developments safer. As such, the NYCHA housing developments selected for Next STEPS are part of a citywide focus on reducing violent crime in those areas, as these housing developments account for nearly 20% of all violent crime in public housing. ",
                        "The Family Justice Center (FJC) is designed to bring together under one roof domestic violence professionals in a collaborative effort to provide domestic violence victims and their children with greater support and accessibility to services and resources. The goal of the Immigration Legal Services program at the FJC is to provide legal services to clients. Through this procurement, CJC is seeking Providers to deliver Immigration Legal Services to crime victims at the Family Justice Centers boroughwide. Providers will deliver immigration and legal services to clients at the FJC. The Family Justice Center Immigration Legal Services program is one component of the Crime Victims Services program umbrella. Additional programs will be procured separately.",
                        "The Restitution Services program will provide services to secure restitution for victims of crime. This program aims to reduce the psychological, physical and financial hardships associated with being victimized. Program services are geared towards providing support and preventing further victimization. Through this procurement, CJC is seeking a Provider to deliver restitution services citywide, and will provide services to crime victims within the Criminal Courts. Providers will deliver services to secure restitution for victims by advocating for its inclusion in the defendant’s/ respondent’s sentence. The Restitution Services for Crime Victims program is one component of the Crime Victims Services program umbrella. Additional programs will be procured separately.",
                        "The Human Trafficking Program for Crime Victims will provide a range of services for victims of human trafficking. This program aims to reduce the psychological, physical and financial hardships associated with being trafficked. Program services are geared towards providing support and preventing further victimization. Through this procurement, CJC is seeking a Provider to deliver human trafficking services citywide. The Provider will provide: outreach; initial assessment; referral services; linkages to housing and shelters; and emergency services to trafficking victims. The Provider will also provide responsiveness and assistance to law enforcement agencies. The Human Trafficking Services for Crime Victims program is one component of the Services for Victims of Crime program umbrella. Additional programs will be procured separately. ",
                        "As the City's Community Action Agency, DYCD is the recipient of federal Community Services Block Grant (CSBG) funds through the State of New York and is responsible for distributing funding for programs on a local level in accordance with the goals of the CSBG statute. In order to maximize the impact of CSBG funding, DYCD targets programs to low income communities, which it designates as Neighborhood Development Areas (NDA). Each NDA is represented by a Neighborhood Advisory Board (NAB) which conducts needs assessments for social services in their NDAs. According to the priorities identified by the NABs, this RFP will seek qualified organizations to provide supported work experience services to Opportunity Youth. These services would include a paid work experience for youth 16-24 who are not working and not in school. Only nonprofit organizations are eligible to propose."
                    ],
                    "longest_values": [
                        "Mayor de Blasio and his administration have made a commitment to increase access to afterschool programs by New York City’s middle school students. These programs provide youth with the support of caring adults and engaging, fun activities that can help them address the challenges of early adolescence. In accordance with its mission to support the City’s youth and their families by funding high-quality youth and community development programs, DYCD launched its Out-of School Time (OST) initiative. The OST system offers students in grades K-12 a mix of academic, recreational and cultural activities. The programs are free of charge and located in neighborhoods across all five boroughs. DYCD is seeking qualified nonprofit organizations to operate OST programs in each public school (including charter schools) serving grades 6-8 and currently lacking comprehensive afterschool services (“Eligible Middle School”). For charter schools to be eligible, they must have a regular dismissal time of 3 p.m. and lack a comprehensive afterschool program. The new programs will operate for 15 hours per week during the school year for a total of 540 hours annually. At least 9 hours per week will be devoted to structured, goal-oriented programming, with the remaining 6 hours being available for drop-in activities. Of the total 540 hours, 216 hours of activities may be unstructured and offered during the school week or on school closing days. All programs will provide academic enrichment, leadership development and physical activity. Providers will work in close collaboration with the host school to recruit and retain struggling students, enhance the program design, and align structured activities with school-day learning. Schools, in turn, will make in-kind contributions to the programs, such as teacher time and curricular resources, in addition to providing classroom space and access to school facilities such as the gymnasium, computer labs and library. The procurement for the OST Middle School Expansion initiative will be organized into 32 solicitations, one for each school district with a cohort of Eligible Middle Schools. ",
                        "On June 15, 2012, President Obama announced Deferred Action for Childhood Arrivals (DACA), under which the U.S. Department of Homeland Security would not deport certain undocumented immigrants: those over the age of 15 and under 31 on the date of the announcement, who had arrived in the U.S. before they turned 16 and who have pursued or are pursuing education or military service. Young adults who achieve DACA status are given temporary relief from the possibility of deportation and are able to legally live and work in the U.S. Before someone can apply for DACA, however, he or she must have earned a high school diploma or equivalency or be currently enrolled in school. School may include an education, literacy, or career training program that is designed to lead to placement in postsecondary education, job training, employment or an education program assisting students in passing a high school equivalency exam. With funding appropriated by the New York City Council, the Department of Youth and Community Development (DYCD) has created the Young Immigrant Literacy Program. Literacy providers coordinate services with legal services providers who assist participants identified as being DACA eligible with initiating the DACA application process, if appropriate. Through this RFP DYCD is seeking qualified community-based organizations to provide outreach services to young immigrants who fall within the age range for DACA eligibility to ensure that the Young Immigrant Literacy Program is utilized to the fullest extent possible. DYCD recognizes that DACA-eligible immigrants may be reluctant to seek services and therefore a concerted outreach effort is needed to reach and recruit the target population. A separate, but otherwise identical RFP is provided for each of the five boroughs. This RFP is for Staten Island.",
                        "On June 15, 2012, President Obama announced Deferred Action for Childhood Arrivals (DACA), under which the U.S. Department of Homeland Security would not deport certain undocumented immigrants: those over the age of 15 and under 31 on the date of the announcement, who had arrived in the U.S. before they turned 16 and who have pursued or are pursuing education or military service. Young adults who achieve DACA status are given temporary relief from the possibility of deportation and are able to legally live and work in the U.S. Before someone can apply for DACA, however, he or she must have earned a high school diploma or equivalency or be currently enrolled in school. School may include an education, literacy, or career training program that is designed to lead to placement in postsecondary education, job training, employment or an education program assisting students in passing a high school equivalency exam. With funding appropriated by the New York City Council, the Department of Youth and Community Development (DYCD) has created the Young Immigrant Literacy Program. Literacy providers coordinate services with legal services providers who assist participants identified as being DACA eligible with initiating the DACA application process, if appropriate. Through this RFP DYCD is seeking qualified community-based organizations to provide outreach services to young immigrants who fall within the age range for DACA eligibility to ensure that the Young Immigrant Literacy Program is utilized to the fullest extent possible. DYCD recognizes that DACA-eligible immigrants may be reluctant to seek services and therefore a concerted outreach effort is needed to reach and recruit the target population. A separate, but otherwise identical RFP is provided for each of the five boroughs. This RFP is for Manhattan.",
                        "On June 15, 2012, President Obama announced Deferred Action for Childhood Arrivals (DACA), under which the U.S. Department of Homeland Security would not deport certain undocumented immigrants: those over the age of 15 and under 31 on the date of the announcement, who had arrived in the U.S. before they turned 16 and who have pursued or are pursuing education or military service. Young adults who achieve DACA status are given temporary relief from the possibility of deportation and are able to legally live and work in the U.S. Before someone can apply for DACA, however, he or she must have earned a high school diploma or equivalency or be currently enrolled in school. School may include an education, literacy, or career training program that is designed to lead to placement in postsecondary education, job training, employment or an education program assisting students in passing a high school equivalency exam. With funding appropriated by the New York City Council, the Department of Youth and Community Development (DYCD) has created the Young Immigrant Literacy Program. Literacy providers coordinate services with legal services providers who assist participants identified as being DACA eligible with initiating the DACA application process, if appropriate. Through this RFP DYCD is seeking qualified community-based organizations to provide outreach services to young immigrants who fall within the age range for DACA eligibility to ensure that the Young Immigrant Literacy Program is utilized to the fullest extent possible. DYCD recognizes that DACA-eligible immigrants may be reluctant to seek services and therefore a concerted outreach effort is needed to reach and recruit the target population. A separate, but otherwise identical RFP is provided for each of the five boroughs. This RFP is for the Bronx.",
                        "On June 15, 2012, President Obama announced Deferred Action for Childhood Arrivals (DACA), under which the U.S. Department of Homeland Security would not deport certain undocumented immigrants: those over the age of 15 and under 31 on the date of the announcement, who had arrived in the U.S. before they turned 16 and who have pursued or are pursuing education or military service. Young adults who achieve DACA status are given temporary relief from the possibility of deportation and are able to legally live and work in the U.S. Before someone can apply for DACA, however, he or she must have earned a high school diploma or equivalency or be currently enrolled in school. School may include an education, literacy, or career training program that is designed to lead to placement in postsecondary education, job training, employment or an education program assisting students in passing a high school equivalency exam. With funding appropriated by the New York City Council, the Department of Youth and Community Development (DYCD) has created the Young Immigrant Literacy Program. Literacy providers coordinate services with legal services providers who assist participants identified as being DACA eligible with initiating the DACA application process, if appropriate. Through this RFP DYCD is seeking qualified community-based organizations to provide outreach services to young immigrants who fall within the age range for DACA eligibility to ensure that the Young Immigrant Literacy Program is utilized to the fullest extent possible. DYCD recognizes that DACA-eligible immigrants may be reluctant to seek services and therefore a concerted outreach effort is needed to reach and recruit the target population. A separate, but otherwise identical RFP is provided for each of the five boroughs. This RFP is for Brooklyn."
                    ],
                    "average_length": 1739.7592592592594
                }
            ]
        },
        {
            "column_name": "Service Name",
            "number_non_empty_cells": 594,
            "number_empty_cells": 0,
            "number_distinct_values": 46,
            "frequent_values": [
                "Case Management",
                "Preventive Services",
                "Life Skills",
                "Academic Supports",
                "Language Skills"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 594,
                    "shortest_values": [
                        "Nursing",
                        "Housing",
                        "Shelter",
                        "Literacy",
                        "Outreach"
                    ],
                    "longest_values": [
                        "Emergency Preparedness and Response",
                        "Alternative Justice Management",
                        "Conflict Resolution/Mediation",
                        "Health Education and Supports",
                        "Child Support Enforcement"
                    ],
                    "average_length": 16.968013468013467
                }
            ]
        }
    ],
    "key_column_candidates": [
        "Agency",
        "EPIN"
    ]
}