{
    "columns": [
        {
            "data_type": [
                {
                    "count": 1992, 
                    "max_value": "2019-05-01 00:00:00", 
                    "min_value": "2013-09-01 00:00:00", 
                    "type": "DATE/TIME"
                }
            ], 
            "number_empty_cells": 0, 
            "number_non_empty_cells": 1992, 
            "frequent_values": [
                "05/01/2019 12:00:00 AM", 
                "01/01/2019 12:00:00 AM", 
                "08/01/2018 12:00:00 AM", 
                "03/01/2018 12:00:00 AM", 
                "09/01/2017 12:00:00 AM"
            ], 
            "number_distinct_values": 14, 
            "column_name": "Date Reported As Of"
        }, 
        {
            "data_type": [
                {
                    "count": 1992, 
                    "max_value": 959, 
                    "min_value": 3, 
                    "stddev": 242.64244968913624, 
                    "type": "INTEGER", 
                    "mean": 459.2565261044177
                }
            ], 
            "number_empty_cells": 0, 
            "number_non_empty_cells": 1992, 
            "frequent_values": [
                151, 
                146, 
                166, 
                170, 
                172
            ], 
            "number_distinct_values": 323, 
            "column_name": "PID"
        }, 
        {
            "data_type": [
                {
                    "count": 1992, 
                    "shortest_values": [
                        "Coney West", 
                        "Queens PS 66", 
                        "New 116Th Pct", 
                        "Queens PS 143", 
                        "West 33rd Street"
                    ], 
                    "average_length": 43.2289156626506, 
                    "type": "TEXT", 
                    "longest_values": [
                        "Bowery Bay Waste Water Treatment Plant Main Sewage Pump Controls and Piping Replacements", 
                        "Emergency Communications Transformation Program (ECTP) Upgrades and Enhancements", 
                        "Wards Island Water Pollution Control Plant final Settling Tank Rehabilitation", 
                        "Implement improvements to cogeneration facilities at Owls Head - Phase 2", 
                        "26th Ward Waste Water Treatment Plant Preliminary Treatment Improvements"
                    ]
                }
            ], 
            "number_empty_cells": 0, 
            "number_non_empty_cells": 1992, 
            "frequent_values": [
                "Jamaica Waste Water Treatment Plant Upgrades", 
                "Rondout-West Branch Bypass Tunnel Construction Project 2", 
                "Long Island Railroad Atlantic Avenue Bridge Rehabilitation", 
                "Pugsley Creek Sewer Relief and Water Main Repair", 
                "Pelham Parkway Roadway Reconstruction, Phase 2"
            ], 
            "number_distinct_values": 323, 
            "column_name": "Project Name"
        }, 
        {
            "data_type": [
                {
                    "count": 1970, 
                    "shortest_values": [
                        "LEASE", 
                        "New Library for Rego Park", 
                        "Bulkhead & Dock Improvemts", 
                        "Brooklyn Animal Care Center", 
                        "Power Distribution Improvements"
                    ], 
                    "average_length": 148.02842639593908, 
                    "type": "TEXT", 
                    "longest_values": [
                        "HVAC AIRFLOW ISSUES  This scope includes the installation of a new transfer air fan and associated ductwork with sound attenuation on the inlet and outlet of a fan serving the Judge?s Lounge located at the 7th Floor.  New transfer air ducts are being installed on floors 2, 7 & 8 to assist in the proper function of the return air system. Additional fan coil units are being installed to serve several rooms on the 8th floor & the 7th floor elevator lobby.    ENGINATOR EXHAUST HEAT  This scope involves a means of venting excessive heat that builds up in a shaft way that houses the enginator exhaust pipe that begins in lower level 2 up and out through the roof of the building. The heat emanates through the shaft way walls into the building.  This will be accomplished by installing a new exhaust fan and a makeup air fan that pumps outside air into the shaft way.    CURTAINWALL SHADOW BOX HEAT TRANSFER  Original design created conditions where curtain wall mullions heated to temperatures in excess of 110 F. This scope of works involves installing new metal stud with sheetrock finishes over interior curtain wall mullions. Affected locations are portions of the 2nd floor east side exposure.    WATER PENETRATION THROUGH UNDERGROUND CONDUITS  An existing underground conduit experienced water infiltration which caused those conductors to fail. Those conductors are going to be removed and the conduit abandoned. A new above ground path has been designed for the new feeder.    INTERIOR GLASS REPLACEMENT  Replace 4 sections of glazing at Stair A and 1 section at Stair B.    CONDENSER WATER SYSTEM WITH THREE ROOF TOP DRY COOLERS  Furnish and install a complete new A/C condenser cooling glycol system that includes roof top dry coolers and associated piping. This new system will serve chilled water A/C units in IT closets and elevator machine rooms throughout the building.    REMOVAL OF EXCESS HEAT FROM COURTROOM AV CLOSETS  This scope of work involve installing fans in the ceilings of all the audio visual closets to vent out heated air from all the equipment inside the closet on floors 3-6.  New hollow metal doors with louvers will also be installed.", 
                        "The scope of work consists of providing all necessary construction management, design, and  r.onstruction services required to perform ail phases of the project: Surveying, tank testing,  investigation, design, construction, and construction management for the closure, removal, upgrade,  or replacement of petroieum product storage tanks at various City owned sites. This work must  comply with all local, state, nnd federal laws nnd regulations governing tanks and associated work.    The general scope of work for tank replacement includes:    File NYSDEC PBS application; mobilization; securing all required NYC agency approvals & permits;  site survey; geophysical survey; drilling for laboratory soil and groundwater samples; crane & rigging;  saw cutting; demo & disposal of old tanks, piping, and concrete vaults; dewatering? of excavation; tank  bottom sludge removal & disposal; remove/transfer/dispose product; laboratory analysis of soil and  groundwater; excavate, remove, dispose incidental contaminated soil; install shoring, new tanks and  tan?k sumps, piping, monitoring and leak detection system, overfill protection and alarms, electrical  wiring; construction of concrete slabs and block piers; backfill excavation; resurfacing; demobilization;  performance of a closeout investigation and the preparation and filing of appropriate reports;  obtaining FDNY and DOB closeout documents; preparing \"\"As-built\"\" drawings.", 
                        "The Woodhaven Boulevard SBS capital project will bring Bus Rapid Transit (BRT) treatments to Woodhaven and Cross Bay Boulevards in Queens. Along Woodhaven Boulevard and Cross Bay Boulevard north of 165th Avenue, the project will involve a full roadway reconstruction, excluding the bridges along the corridor, which will only be resurfaced with updated roadway markings. Targeted bus priority measures will also be constructed on Hoffman Drive between Queens Boulevard and Woodhaven Boulevard and on the north side of Queens Boulevard between Woodhaven Boulevard and 57th Avenue. On Woodhaven Boulevard between Queens Boulevard and Rockaway Avenue, this reconstruction will include implementing a multi-lane boulevard design featuring dedicated bus lanes identified with red coloring and overhead signage, as well as new bus stops located along the medians, with new street furniture, ticket vending machines, and pedestrian wayfinding with real time bus arrival information screens. On Cross Bay Boulevard between Rockaway Avenue and 165th Avenue, the reconstruction will include implementing an offset bus lane design featuring dedicated bus lanes identified with red coloring and overhead signage, planted medians, neckdowns, and SBS \"bus bulb\" stations (extended sidewalks) with ticket vending machines, pedestrian wayfinding with real-time bus arrival information and other street furniture.", 
                        "Introduce Bus Rapid Transit (BRT) treatments along Woodhaven Boulevard and Cross Bay Boulevard north of 165th Avenue in Queens; the project involves a full roadway reconstruction, excluding the bridges along the corridor, which will only be resurfaced with updated roadway markings. Targeted bus priority measures will also be constructed on Hoffman Drive between Queens Boulevard and Woodhaven Boulevard and on the north side of Queens Boulevard between Woodhaven Boulevard and 57th Avenue. On Woodhaven Boulevard between Queens Boulevard and Rockaway Avenue, this reconstruction will include implementing a multi-lane boulevard design featuring dedicated bus lanes identified with red coloring and overhead signage, as well as new bus stops located along the medians, with new street furniture, ticket vending machines, and pedestrian wayfinding with real time bus arrival information screens. On Cross Bay Boulevard between Rockaway Avenue and 165th Avenue, the reconstruction will include implementing an offset bus lane design featuring dedicated bus lanes identified with red coloring and overhead signage, planted medians, neckdowns, and SBS \"bus bulb\" stations (extended sidewalks) with ticket vending machines, pedestrian wayfinding with real-time bus arrival information and other street furniture.", 
                        "The Southern Brooklyn B82 Select Bus Service is part of the Select Bus Service (SBS) program developed in partnership with NYCT. The Southern Brooklyn Crosstown bus route aims to improve bus speeds, reliability, and driver and pedestrian safety along a 10-mile bus route in the Borough of Brooklyn from the Gravesend to Spring Creek neighborhoods. The B82 SBS will be launched in 2018 by NYC DOT and NYCTA. The capital project focuses on the 7.5-mile portion of the entire SBS corridor along Kings Highway (Segment K), Flatlands Avenue (Segment F), and Pennsylvania Avenue (Segment P). Along these three corridors, the capital project will build a combination of new bus lanes with high-quality bus stations and signal timing changes, as well as safety improvements for bus passengers, pedestrians, and all street users. Bus stops will be rehabilitated with expanded ADA-accessible platforms, bus shelters, lighting, and seating. Concrete curb extensions and central medians will be built to reduce crossing distances. Additionally, all the medians along Kings Highway will be reconstructed bringing them to a state of good repair along with the bus stops."
                    ]
                }
            ], 
            "number_empty_cells": 22, 
            "number_non_empty_cells": 1970, 
            "frequent_values": [
                "Design and construction of a new school", 
                "The existing Main Sewage Pumps have deteriorated and the pumping system including suction and discharge headers and valves are in need of replacement.", 
                "Design and construction of a 1.5 mile esplanade on the East River, from the Battery Maritime Building to Pier 35, including a new double level pier structure, esplanade improvements and commercial pavilions.", 
                "This project will rehabilite the existing Flushing Tunnel, reconstruct and upgrade the Gowanus pumping station and install a temporary oxygenation system to increase the dissolved oxygen levels of the canal.", 
                "Reconstruct roadway and extend storm and sanitary sewers in portions of Brookville Boulevard, Edgewood Street, 147th Avenue, and adjacent streets west of 241st Street."
            ], 
            "number_distinct_values": 485, 
            "column_name": "Description"
        }, 
        {
            "data_type": [
                {
                    "count": 1992, 
                    "shortest_values": [
                        "IT", 
                        "Parks", 
                        "Sewers", 
                        "Bridges", 
                        "Schools"
                    ], 
                    "average_length": 15.674698795180722, 
                    "type": "TEXT", 
                    "longest_values": [
                        "Industrial Development, Streets and Roadways", 
                        "Sewers, Streets and Roadways, Water Supply", 
                        "Streets and Roadways, Water Supply", 
                        "Public Safety and Criminal Justice", 
                        "Industrial Development, Parks"
                    ]
                }
            ], 
            "number_empty_cells": 0, 
            "number_non_empty_cells": 1992, 
            "frequent_values": [
                "Streets and Roadways", 
                "Water Supply", 
                "Wastewater Treatment", 
                "Bridges", 
                "Sewers"
            ], 
            "number_distinct_values": 25, 
            "column_name": "Category"
        }, 
        {
            "data_type": [
                {
                    "count": 1538, 
                    "shortest_values": [
                        "Olive", 
                        "Bronx", 
                        "Queens", 
                        "Carmel", 
                        "Upstate"
                    ], 
                    "average_length": 8.055266579973992, 
                    "type": "TEXT", 
                    "longest_values": [
                        "Manhattan, Staten Island, Bronx", 
                        "Manhattan, Staten Island", 
                        "Brooklyn, Queens", 
                        "Manhattan, Bronx", 
                        "Bronx, Manhattan"
                    ]
                }
            ], 
            "number_empty_cells": 454, 
            "number_non_empty_cells": 1538, 
            "frequent_values": [
                "Brooklyn", 
                "Queens", 
                "Manhattan", 
                "Bronx", 
                "Staten Island"
            ], 
            "number_distinct_values": 19, 
            "column_name": "Borough"
        }, 
        {
            "data_type": [
                {
                    "count": 1992, 
                    "shortest_values": [
                        "DDC", 
                        "DEP", 
                        "DOT", 
                        "SCA", 
                        "EDC"
                    ], 
                    "average_length": 3.039156626506024, 
                    "type": "TEXT", 
                    "longest_values": [
                        "DOITT", 
                        "FDNY", 
                        "DSNY", 
                        "DCAS", 
                        "DOC"
                    ]
                }
            ], 
            "number_empty_cells": 0, 
            "number_non_empty_cells": 1992, 
            "frequent_values": [
                "DDC", 
                "DOT", 
                "DEP", 
                "EDC", 
                "SCA"
            ], 
            "number_distinct_values": 12, 
            "column_name": "Managing Agency"
        }, 
        {
            "data_type": [
                {
                    "count": 1980, 
                    "shortest_values": [
                        "QL", 
                        "DEP", 
                        "BWT", 
                        "ORR", 
                        "DOC"
                    ], 
                    "average_length": 3.507575757575758, 
                    "type": "TEXT", 
                    "longest_values": [
                        "DOT, Mayor's Office", 
                        "Mayor's Office", 
                        "DEP, DOT, EDC", 
                        "FDNY, NYPD", 
                        "HHC/DOHMH"
                    ]
                }
            ], 
            "number_empty_cells": 12, 
            "number_non_empty_cells": 1980, 
            "frequent_values": [
                "DOT", 
                "DEP", 
                "DOE", 
                "DCAS", 
                "H+H"
            ], 
            "number_distinct_values": 33, 
            "column_name": "Client Agency"
        }, 
        {
            "data_type": [
                {
                    "count": 1974, 
                    "shortest_values": [
                        "IT", 
                        "Design", 
                        "Construction", 
                        "Construction Procurement"
                    ], 
                    "average_length": 10.606889564336372, 
                    "type": "TEXT", 
                    "longest_values": [
                        "Construction Procurement", 
                        "Construction", 
                        "Design", 
                        "IT"
                    ]
                }
            ], 
            "number_empty_cells": 18, 
            "number_non_empty_cells": 1974, 
            "frequent_values": [
                "Design", 
                "Construction", 
                "Construction Procurement", 
                "IT"
            ], 
            "number_distinct_values": 4, 
            "column_name": "Current Phase"
        }, 
        {
            "data_type": [
                {
                    "count": 1926, 
                    "max_value": "2019-07-01 00:00:00", 
                    "min_value": "1993-08-02 00:00:00", 
                    "type": "DATE/TIME"
                }
            ], 
            "number_empty_cells": 66, 
            "number_non_empty_cells": 1926, 
            "frequent_values": [
                "06/30/2004", 
                "05/30/2017", 
                "09/23/2013", 
                "02/08/2011", 
                "04/01/2013"
            ], 
            "number_distinct_values": 315, 
            "column_name": "Design Start"
        }, 
        {
            "data_type": [
                {
                    "count": 1974, 
                    "max_value": 2631660649, 
                    "min_value": -4102606, 
                    "stddev": 323826697.85604805, 
                    "type": "INTEGER", 
                    "mean": 144610077.75379938
                }
            ], 
            "number_empty_cells": 18, 
            "number_non_empty_cells": 1974, 
            "frequent_values": [
                764063231.0, 
                60000000.0, 
                0.0, 
                25891424.0, 
                100000000.0
            ], 
            "number_distinct_values": 1684, 
            "column_name": "Budget Forecast"
        }, 
        {
            "data_type": [
                {
                    "count": 1730, 
                    "max_value": 728850000, 
                    "min_value": -312992000, 
                    "stddev": 32910712.96014339, 
                    "type": "INTEGER", 
                    "mean": 2136482.547398844
                }
            ], 
            "number_empty_cells": 262, 
            "number_non_empty_cells": 1730, 
            "frequent_values": [
                0.0, 
                50000.0, 
                1000000.0, 
                -1000.0, 
                -500000.0
            ], 
            "number_distinct_values": 1370, 
            "column_name": "Latest Budget Changes"
        }, 
        {
            "data_type": [
                {
                    "count": 1980, 
                    "max_value": 728850000, 
                    "min_value": -291900233, 
                    "stddev": 59266896.4720763, 
                    "type": "INTEGER", 
                    "mean": 15581760.587373737
                }
            ], 
            "number_empty_cells": 12, 
            "number_non_empty_cells": 1980, 
            "frequent_values": [
                0.0, 
                37457100.0, 
                81350000.0, 
                176325590.0, 
                27967304.0
            ], 
            "number_distinct_values": 288, 
            "column_name": "Total Budget Changes"
        }, 
        {
            "data_type": [
                {
                    "count": 1962, 
                    "max_value": "2108-10-21 00:00:00", 
                    "min_value": "2014-07-01 00:00:00", 
                    "type": "DATE/TIME"
                }
            ], 
            "number_empty_cells": 30, 
            "number_non_empty_cells": 1962, 
            "frequent_values": [
                "09/03/2021", 
                "09/03/2020", 
                "09/03/2019", 
                "12/31/2018", 
                "06/30/2019"
            ], 
            "number_distinct_values": 980, 
            "column_name": "Forecast Completion"
        }, 
        {
            "data_type": [
                {
                    "count": 1720, 
                    "max_value": 32872, 
                    "min_value": -32620, 
                    "stddev": 1160.0928445200555, 
                    "type": "INTEGER", 
                    "mean": 79.10058139534884
                }
            ], 
            "number_empty_cells": 272, 
            "number_non_empty_cells": 1720, 
            "frequent_values": [
                0.0, 
                365.0, 
                1.0, 
                91.0, 
                92.0
            ], 
            "number_distinct_values": 561, 
            "column_name": "Latest Schedule Changes"
        }, 
        {
            "data_type": [
                {
                    "count": 1975, 
                    "max_value": 3253, 
                    "min_value": -1268, 
                    "stddev": 708.1319251580467, 
                    "type": "INTEGER", 
                    "mean": 672.1118987341772
                }
            ], 
            "number_empty_cells": 17, 
            "number_non_empty_cells": 1975, 
            "frequent_values": [
                0.0, 
                -27.0, 
                1894.0, 
                929.0, 
                956.0
            ], 
            "number_distinct_values": 221, 
            "column_name": "Total Schedule Changes"
        }
    ], 
    "dataset_name": "n7gv-k5yt", 
    "key_column_candidates": []
}