{
    "dataset_name": "68rr-d3jr",
    "columns": [
        {
            "column_name": "Service Area",
            "number_non_empty_cells": 59,
            "number_empty_cells": 0,
            "number_distinct_values": 59,
            "frequent_values": [
                "Work Readiness",
                "Transportation",
                "Translation",
                "Telecommunications",
                "Substance Abuse Services"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 59,
                    "shortest_values": [
                        [
                            "Shelter",
                            7
                        ],
                        [
                            "Nursing",
                            7
                        ],
                        [
                            "Housing",
                            7
                        ],
                        [
                            "Outreach",
                            8
                        ],
                        [
                            "Literacy",
                            8
                        ]
                    ],
                    "longest_values": [
                        [
                            "Emergency Preparedness and Response",
                            35
                        ],
                        [
                            "Court Appointed Guardian Services",
                            33
                        ],
                        [
                            "Alternative Justice Management",
                            30
                        ],
                        [
                            "Health Education and Supports",
                            29
                        ],
                        [
                            "Conflict Resolution/Mediation",
                            29
                        ]
                    ],
                    "average_length": 18.11864406779661
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Service Description",
            "number_non_empty_cells": 59,
            "number_empty_cells": 0,
            "number_distinct_values": 59,
            "frequent_values": [
                "Work Readiness consists of services to provide clients with the skills and interpersonal competencies that are essential to successful job search, securing employment, and workplace performance. Examples include Career Advisement, Individual Job Search Preparation, Interview Preparation, Resume Preparation, Skills Assessment and Workplace Literacy.",
                "Transportation consists of vehicular services to carry individuals from one place to another. Transportation services may include facilitation of reservations, dispatch, vehicular routing, private transportation, and passenger pick-up for individuals or groups in a secure or non-secure setting. Transportation services are targeted towards persons who require such service because their destination is beyond their walking (or driving) ability and they have no alternative means of transportation, or because public transportation is beyond the individual's abilities. Transportation may also be provided to staff traveling to clients in need of community-based services. Examples include Group Transportation, Individual Transportation, and Secure Transportation.",
                "Translation consists of the written rendering from one language to another to facilitate communication and reduce language barriers in the delivery of services. Translation services may also include synchronous translation, which is the immediate transmission into another language through IT enablement. Translation services providers may translate into one or more languages forms, publications and other materials used to support program activities. Examples include Translation of Legal Documents and Translation of Program Materials.",
                "Telecommunications consists of services to facilitate communication via the telephone. Telecommunications services may include the operation of a counseling call center or an emergency hotline. Telecommunications providers may also offer services to provide phone-based services to individuals who are deaf or hearing impaired. Examples include Hotline, Call Center, Telecommunications Device for the Deaf (TDD), and Tele Typewriter (TTY).",
                "Substance Abuse Services consist of health services to support the diagnosis, treatment, and prevention of drug and alcohol abuse and compulsive gambling. Substance Abuse Services may also include services to reduce harms from drug and alcohol use and to improve the health of people who use drugs. Examples include Medically Supervised/Monitored Withdrawal, Medically Managed Detoxification, Inpatient Rehabilitation, Community Residential Treatment, Post Treatment Housing, Recovery Community Centers, Recovery Community Organizing Initiative, Residential Rehabilitation, Intensive Residential Services, Opioid Treatment, Methadone Maintenance, Methadone to Abstinence, Managed Addiction Treatment Services, Medically Supervised Outpatient Services, Outpatient Rehabilitation, Compulsive Gambling Treatment, Overdose Prevention, and Naloxone Treatment."
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 59,
                    "shortest_values": [
                        [
                            "Pregnancy Services consist of services for pregnant women and women with newborns to promote healthy pregnancies and families. Examples include Neo-Natal and Pre-Natal Care.",
                            173
                        ],
                        [
                            "Health Education and Supports consist of information and guidance in areas that affect community health. Examples include Health Care Access Services, Health Promotion, and Nutrition Education and Counseling.",
                            208
                        ],
                        [
                            "Diagnostic Testing consists of services provided to obtain objective evidence of the presence of a condition and determine diagnosis. Examples include HIV/AIDS Testing, Mental Health Assessment, and Hearing Testing.",
                            215
                        ],
                        [
                            "Dental Services consist of preventive and clinical dentistry services provided by dentists, dental hygienists and technicians to prevent and treat oral disease and injury. Examples include Dental Cleaning, Examination, and Treatment.",
                            233
                        ],
                        [
                            "Medication Management consists of services to administer, regulate, order, dispense, deliver and store medications, often in a pharmacy setting, in accordance with state laws. Examples include Treatment Management and Prescription Management.",
                            242
                        ]
                    ],
                    "longest_values": [
                        [
                            "Case Management consists of services to help persons and families achieve or maintain optimum social, psychological, and physical functioning by planning, securing, coordinating, and monitoring services from different organizations and personnel on behalf of those served. Case Management may include services to establish and maintain client engagement in needed services. Services may also include client team communications to facilitate the exchange of information between two or more parties in relation to the status of or service delivery to a client. Examples include Advocacy (Community and Individual), Aftercare, Case Assistance, Case Conferencing, Client Evaluation/Assessment, Client Monitoring, Client Referrals, Counseling, Crisis Intervention/Management, Diversion Services, Intake, Safety Planning, Service/Care Planning and Transition/Discharge Planning.",
                            872
                        ],
                        [
                            "Substance Abuse Services consist of health services to support the diagnosis, treatment, and prevention of drug and alcohol abuse and compulsive gambling. Substance Abuse Services may also include services to reduce harms from drug and alcohol use and to improve the health of people who use drugs. Examples include Medically Supervised/Monitored Withdrawal, Medically Managed Detoxification, Inpatient Rehabilitation, Community Residential Treatment, Post Treatment Housing, Recovery Community Centers, Recovery Community Organizing Initiative, Residential Rehabilitation, Intensive Residential Services, Opioid Treatment, Methadone Maintenance, Methadone to Abstinence, Managed Addiction Treatment Services, Medically Supervised Outpatient Services, Outpatient Rehabilitation, Compulsive Gambling Treatment, Overdose Prevention, and Naloxone Treatment.",
                            854
                        ],
                        [
                            "Job Placement Services provide clients with access to job placements that will allow clients to participate in the workforce immediately or following appropriate assessment or training. Job Placement types range, including direct employment, post-secondary education, or vocational training. Services may also include building relationships with placement providing organizations, conducting job searches and matching for clients and working with clients to understand workforce interests and goals. Successful placements allow clients to enhance their career options and workforce participation. Examples include Career Exploration, Employer Recruitment, Internship, Job Search, Job Matching, Placement Development, Post Placement Support/Retention Services, Transitional Employment and Volunteering.",
                            801
                        ],
                        [
                            "Preventive Services consist of support and intervention provided to promote behaviors, activities, treatment and services in order to prevent harmful outcomes. Preventive Services provide support necessary to avoid the displacement of a child or family, involvement in the criminal and juvenile justice systems, domestic abuse, child abuse and neglect, substance abuse,health issues and disease, untreated mental illness. Preventive Services may include crisis intervention, family mediation, community-based wrap-around and other services aimed at preventing negative outcomes. Examples include Substance Abuse Prevention, Child Abuse Prevention, Disease Prevention, PINS Diversion, Harm Reduction Counseling, Criminal Justice Prevention and Services for those at risk.",
                            770
                        ],
                        [
                            "Transportation consists of vehicular services to carry individuals from one place to another. Transportation services may include facilitation of reservations, dispatch, vehicular routing, private transportation, and passenger pick-up for individuals or groups in a secure or non-secure setting. Transportation services are targeted towards persons who require such service because their destination is beyond their walking (or driving) ability and they have no alternative means of transportation, or because public transportation is beyond the individual's abilities. Transportation may also be provided to staff traveling to clients in need of community-based services. Examples include Group Transportation, Individual Transportation, and Secure Transportation.",
                            765
                        ]
                    ],
                    "average_length": 443.135593220339
                }
            ],
            "semantic_types": []
        }
    ],
    "key_column_candidates": []
}