{
    "dataset_name": "6ctv-n46c",
    "columns": [
        {
            "column_name": "File #",
            "number_non_empty_cells": 1000,
            "number_empty_cells": 0,
            "number_distinct_values": 1000,
            "frequent_values": [
                "T2015-2283",
                "T2015-2278",
                "LU 0168-2014",
                "LU 0167-2014",
                "LU 0166-2014"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 1000,
                    "shortest_values": [
                        [
                            "T2015-2283",
                            10
                        ],
                        [
                            "T2015-2278",
                            10
                        ],
                        [
                            "T2014-2177",
                            10
                        ],
                        [
                            "T2014-2208",
                            10
                        ],
                        [
                            "T2014-2188",
                            10
                        ]
                    ],
                    "longest_values": [
                        [
                            "Int 0606-2014",
                            13
                        ],
                        [
                            "Int 0605-2014",
                            13
                        ],
                        [
                            "Int 0603-2014",
                            13
                        ],
                        [
                            "Int 0604-2014",
                            13
                        ],
                        [
                            "Int 0608-2014",
                            13
                        ]
                    ],
                    "average_length": 12.194
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Law Number",
            "number_non_empty_cells": 23,
            "number_empty_cells": 977,
            "number_distinct_values": 24,
            "frequent_values": [
                "",
                "2014/063",
                "2014/059",
                "2014/058",
                "2014/068"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 23,
                    "shortest_values": [
                        [
                            "2014/063",
                            8
                        ],
                        [
                            "2014/059",
                            8
                        ],
                        [
                            "2014/058",
                            8
                        ],
                        [
                            "2014/068",
                            8
                        ],
                        [
                            "2014/051",
                            8
                        ]
                    ],
                    "longest_values": [
                        [
                            "2014/063",
                            8
                        ],
                        [
                            "2014/059",
                            8
                        ],
                        [
                            "2014/058",
                            8
                        ],
                        [
                            "2014/068",
                            8
                        ],
                        [
                            "2014/051",
                            8
                        ]
                    ],
                    "average_length": 8.0
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Type",
            "number_non_empty_cells": 1000,
            "number_empty_cells": 0,
            "number_distinct_values": 9,
            "frequent_values": [
                "Resolution",
                "Introduction",
                "Oversight",
                "Communication",
                "Land Use Application"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 1000,
                    "shortest_values": [
                        [
                            "SLR",
                            3
                        ],
                        [
                            "SLR",
                            3
                        ],
                        [
                            "SLR",
                            3
                        ],
                        [
                            "Tour",
                            4
                        ],
                        [
                            "Oversight",
                            9
                        ]
                    ],
                    "longest_values": [
                        [
                            "Land Use Application",
                            20
                        ],
                        [
                            "Land Use Application",
                            20
                        ],
                        [
                            "Land Use Application",
                            20
                        ],
                        [
                            "Land Use Application",
                            20
                        ],
                        [
                            "Land Use Application",
                            20
                        ]
                    ],
                    "average_length": 12.146
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Status",
            "number_non_empty_cells": 1000,
            "number_empty_cells": 0,
            "number_distinct_values": 7,
            "frequent_values": [
                "Committee",
                "Adopted",
                "Filed",
                "Laid Over in Committee",
                "Enacted"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 1000,
                    "shortest_values": [
                        [
                            "Filed",
                            5
                        ],
                        [
                            "Filed",
                            5
                        ],
                        [
                            "Filed",
                            5
                        ],
                        [
                            "Filed",
                            5
                        ],
                        [
                            "Filed",
                            5
                        ]
                    ],
                    "longest_values": [
                        [
                            "Enacted (Mayor's Desk for Signature)",
                            36
                        ],
                        [
                            "Enacted (Mayor's Desk for Signature)",
                            36
                        ],
                        [
                            "Enacted (Mayor's Desk for Signature)",
                            36
                        ],
                        [
                            "Enacted (Mayor's Desk for Signature)",
                            36
                        ],
                        [
                            "Enacted (Mayor's Desk for Signature)",
                            36
                        ]
                    ],
                    "average_length": 8.643
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Final Action",
            "number_non_empty_cells": 494,
            "number_empty_cells": 506,
            "number_distinct_values": 82,
            "frequent_values": [
                "",
                "06/25/2014 12:00:00 AM",
                "11/25/2014 12:00:00 AM",
                "06/26/2014 12:00:00 AM",
                "07/24/2014 12:00:00 AM"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 494,
                    "max_value": "12/17/2014, 00:00:00",
                    "min_value": "05/14/2014, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Title",
            "number_non_empty_cells": 1000,
            "number_empty_cells": 0,
            "number_distinct_values": 987,
            "frequent_values": [
                "Resolution approving the new designation and changes in the designation of certain organizations to receive funding in the Expense Budget.",
                "Application No. 20155248 HAM submitted by the New York City Department of Housing Preservation and Development pursuant to Section 577 of the Private Housing Finance Law for a real property tax exemption for properties located at 538-548 West 53rd Street (Block 1081, part of Lot 1), Borough of the Manhattan, Community Board 4, Council District 3.",
                "Application No. C 110122 ZMR, submitted by the Estate of Letizia Sollazzo pursuant to Sections 197-c and 201 of the Charter for the amendment of the Zoning Map, Section No. 20d, eliminating a C1-1 District from within an existing R3-2 District and establishing a C1-2 within an existing R3-2 District, in between Mariner’s Harbor and Elm Park areas, Borough of Staten Island, Community Board 1, Council District 49.",
                "Application No. 20155176 HAM, submitted by the New York City Department of Housing Preservation and Development for approval of an amendment to a previously approved tax exemption pursuant to Section 577 of the Private Housing Finance Law (PHFL) for a property located at 304-306 East 8th Street, Block 390, Lot 9, Borough of Manhattan, Community Board 3, Council District 2.",
                "Communication from the Office of Management & Budget - Transfer City funds between various agencies in Fiscal Year 2014 to implement changes to the City's expense budget, pursuant to Section 107(b) of the New York City Charter. (MN-4)"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 1000,
                    "shortest_values": [
                        [
                            "Oversight: Medicaid Redesign",
                            28
                        ],
                        [
                            "Oversight: Afterschool Programs",
                            31
                        ],
                        [
                            "Oversight: Hunger in New York City",
                            34
                        ],
                        [
                            "Oversight - DSNY’s 2015-16 Snow Plan",
                            36
                        ],
                        [
                            "Oversight - Aging out of Foster Care.",
                            37
                        ]
                    ],
                    "longest_values": [
                        [
                            "Resolution calling on the Mayor, the Mayor’s Office of Environmental Coordination, the New York City Planning Commission, the New York City Department of City Planning, and all other relevant City agencies to re-examine the standards in the CEQR regulations and the Technical Manual for assessing when a possible adverse impact on a neighborhood’s character or socioeconomic status requires a detailed analysis and possible mitigation, and calling on the relevant agencies, when such significant adverse impacts are identified, consistently to seek mitigation or development alternatives that provide",
                            600
                        ],
                        [
                            "A Local Law in relation to the date of submission by the mayor of a preliminary management report and the date prior to which the council shall conduct public hearings and the date by which the council shall submit a report or reports pertaining thereto, the date of submission by the director of management and budget and the director of city planning of a draft ten-year capital strategy, the date of submission by the city planning commission of a report on the draft ten-year capital strategy, the date of submission by the mayor of the preliminary certificate regarding debt and reserves and app",
                            600
                        ],
                        [
                            "A Local Law to amend the administrative code of the city of New York, in relation to the operation of horse drawn cabs, displaced worker training and payment of HAIL license fees for accessible vehicles, and to repeal subdivisions c, o, p, q and r of section 17-330, relating to regulations for working carriage horses; subdivision a of section 17-334, relating to construction of subchapter 3 of chapter 3 of title 17, concerning carriage horses; section 17-334.1, relating to training and examination of horse drawn carriage drivers; section 19-174, relating to passengers boarding horse drawn cabs",
                            600
                        ],
                        [
                            "Resolution approving with modifications the decision of the City Planning Commission on ULURP No. C 140323 (A) ZSQ (L.U. No. 126), for the grant of special permit pursuant to Section 74-743(a)(1) - to allow the distribution of total allowable floor area under the applicable district regulations without regard for zoning lot lines; Section 74-743(a)(2) - to modify the minimum distance between building requirements of Section 23-711 (Standard minimum distance between buildings), and to allow the location of buildings without regard to the yard requirements of Section 23-47 (Minimum required rear",
                            600
                        ],
                        [
                            "Application no. C 140388 PCX submitted by the NYC Department of Parks and Recreation and NYC Department of Citywide Administrative Services (DCAS), pursuant to Section 197-c of the New York City Charter, for the site selection and acquisition of property located at 850 East 138th Street (Block 2589, Lot 31), for a repair, maintenance and storage facility, Borough of Bronx, Community Board 1, Council District 17. This application is subject to the review and action by the Land Use Committee only if appealed to the Council pursuant to 197-d(b)(2) of the Charter or called up by a vote of the Coun",
                            600
                        ]
                    ],
                    "average_length": 237.748
                }
            ],
            "semantic_types": []
        }
    ],
    "key_column_candidates": []
}