{
    "dataset_name": "8vv7-7wx3",
    "columns": [
        {
            "column_name": "Record ID",
            "number_non_empty_cells": 14535,
            "number_empty_cells": 0,
            "number_distinct_values": 14535,
            "frequent_values": [
                "14546",
                "14606",
                "14628",
                "14627",
                "14549"
            ],
            "data_type": [
                {
                    "type": "INTEGER",
                    "count": 14535,
                    "max_value": 14628,
                    "min_value": 1,
                    "mean": 7290.52700378397,
                    "stddev": 4221.747285696155
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Date and Time",
            "number_non_empty_cells": 14535,
            "number_empty_cells": 0,
            "number_distinct_values": 13838,
            "frequent_values": [
                "03/13/2010 12:00:00 AM",
                "12/27/2010 12:00:00 AM",
                "06/24/2010 12:00:00 AM",
                "01/25/2010 12:00:00 AM",
                "07/07/2010 12:00:00 AM"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 14535,
                    "max_value": "09/27/2019, 15:00:00",
                    "min_value": "01/01/1900, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "NotificationType",
            "number_non_empty_cells": 14535,
            "number_empty_cells": 0,
            "number_distinct_values": 17,
            "frequent_values": [
                "Road Closure",
                "Mass Transit Disruption",
                "Missing Adult",
                "Utility",
                "Weather"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 14535,
                    "shortest_values": [
                        [
                            "Fire",
                            4
                        ],
                        [
                            "Fire",
                            4
                        ],
                        [
                            "Fire",
                            4
                        ],
                        [
                            "Fire",
                            4
                        ],
                        [
                            "Fire",
                            4
                        ]
                    ],
                    "longest_values": [
                        [
                            "Missing Child / Adolescent",
                            26
                        ],
                        [
                            "Missing Child / Adolescent",
                            26
                        ],
                        [
                            "Missing Child / Adolescent",
                            26
                        ],
                        [
                            "Missing Child / Adolescent",
                            26
                        ],
                        [
                            "Missing Child / Adolescent",
                            26
                        ]
                    ],
                    "average_length": 13.822497420020639
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Notification Title",
            "number_non_empty_cells": 14535,
            "number_empty_cells": 0,
            "number_distinct_values": 10238,
            "frequent_values": [
                "[blank]",
                "CSO Advisory (CW)",
                "CSO Advisory - (Citywide)",
                "CSO Advisories (CW)",
                "Intermittent Wind Gusts (CW)"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 14535,
                    "shortest_values": [
                        [
                            "Blank",
                            5
                        ],
                        [
                            "[blank]",
                            7
                        ],
                        [
                            "[blank]",
                            7
                        ],
                        [
                            "[blank]",
                            7
                        ],
                        [
                            "[blank]",
                            7
                        ]
                    ],
                    "longest_values": [
                        [
                            "Joint Emergency Response Drill - Lenox Hill HealthPlex and NewYork-Presbyterian/Lower Manhattan Hospital (MN) - 5/23",
                            116
                        ],
                        [
                            "Mayor's Fund to Advance NYC Accepting Contributions for Those Affected by 3/12 East Harlem Building Collapse (CW)",
                            113
                        ],
                        [
                            "70th Anniversary of D-Day: Helicopter Flyover, Rose Petal Release, and 21-Gun Salute - 6/6/14 (BK, MN, SI)",
                            106
                        ],
                        [
                            "US Small Business Administration Disaster Loan Outreach Center - East Village Building Collapse (MN)",
                            100
                        ],
                        [
                            "Fleet Week 2014 - Parade of Sails & U.S. Marine Corps (USMC) Familiarization Flights - 5/21/14 (CW)",
                            99
                        ]
                    ],
                    "average_length": 37.96676986584107
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Email Body",
            "number_non_empty_cells": 14121,
            "number_empty_cells": 414,
            "number_distinct_values": 14092,
            "frequent_values": [
                "",
                "The Port Authority will be doing construction blasting at the World Trade Center site today beginning at 8 a.m. There will be a total of 7 controlled blasts during the day. This is a routine construction operation and there is no cause for concern.",
                "Silver Alert issued 9-14-2019 at 04:28 AM.A Silver Alert has been issued for Yujie Wang, a 77-year-old Asian female from the area of Lawrence Street and 60th Avenue in Queens. The missing has dementia and may be in need of medical attention.Description: 5'2'' tall, 90 lbs, with black hair and brown eyes. Last seen wearing a dark colored striped shirt, a brown plaid jacket and carrying a small purse.Last Seen: Lawrence Street and 60th Avenue in Queens at approximately 4:00 PM on 09-13-2019.If you see the missing person, please call 9-1-1.A photo of the missing is available here:https://flic.kr/p/2hf9M91",
                "Notification issued 09-07-2019 at 11:47 PM. Due to a vehicle collision, expect extensive eastbound traffic delays on the Belt Parkway approaching the Van Wyck Expressway in Queens. Consider alternate routes and allow for additional travel time.",
                "Notification issued 08-17-2019 at 5:55 PM. Following a prior service disruption, LIRR train service between Atlantic Terminal and Jamaica Station has resumed in both directions. Expect residual delays."
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 14121,
                    "shortest_values": [
                        [
                            "The NYPD has cancelled the Silver Alert for Raquel Yeyille.",
                            59
                        ],
                        [
                            "The NYPD has cancelled the Silver Alert for Millicent Elliot.",
                            61
                        ],
                        [
                            "The issued AMBER Alert on 3/14/12 at 8:20 PM has now been cancelled.",
                            68
                        ],
                        [
                            "The Department of Education has closed public schools due to the snow.",
                            70
                        ],
                        [
                            "Notification issued 9/23/14 at 1:36 PM. This is a test. This is only a test.",
                            76
                        ]
                    ],
                    "longest_values": [
                        [
                            "Notification issued 11/19/16 at 3:34 PM. The National Weather Service has issued a Wind Advisory citywide in effect for Sunday, November 20 at 6:00am to Monday, November 21 at 6:00pm. The advisory has been issued for sustained winds of 25 mph to 35 mph and gusts in excess of 50 mph. During periods of high winds, residents should use caution when walking or driving high profile vehicles. Winds at these speeds can cause flying debris, turn unsecured objects into projectiles, and cause power outages. To prepare, charge cell phone batteries, gather supplies, and turn refrigerators and freezers to a colder setting. Always stay clear of downed power lines. If you are affected by an outage, turn off all appliances and keep refrigerator and freezer doors closed to prevent food spoilage. Do not use generators indoors. If you lose power and have a disability or access needs, or use Life Sustaining Equipment (LSE) and need immediate assistance, please dial 9-1-1. For the latest weather information visit www.weather.gov/",
                            1024
                        ],
                        [
                            "Notification issued 9/4/16 at 7:00 PM. The National Weather Service has issued a Tropical Storm Warning for New York City until further notice. New Yorkers should take actions ahead of the storm to prepare for high winds, minor-to-moderate coastal flooding, rain, life-threatening rip tides, and high surf.  The National Weather Service is currently forecasting sustained winds of 20-30 mph with the potential for gusts up to 50 mph for the NYC area beginning as early as Sunday, and possibly extending through Tuesday evening. High winds can bring down trees and power lines and can turn unsecured objects into dangerous projectiles. When winds reach tropical storm levels, NYC area bridges may implement speed and vehicle restrictions. New Yorkers should expect potential restrictions Sunday evening through Tuesday. Due to life-threatening rip tides, NYC beaches are closed to swimming, surfing, and bathing on Monday, September 5, 2016. Prepare for flooding: If you live in a flood-susceptible area, keep sandbags, plywo",
                            1024
                        ],
                        [
                            "Notification issued 9/3/16 at 8:22 PM. The National Weather Service has issued a Tropical Storm Warning and Storm Surge Watch for New York City until further notice. New Yorkers should take actions ahead of the storm to prepare for high winds, minor-to-moderate coastal flooding, rain, life-threatening rip tides, and high surf. The National Weather Service is currently forecasting sustained winds of 35-45 mph with the potential for gusts up to 60 mph for the NYC area beginning as early as Sunday, and possibly extending through Tuesday evening. High winds can bring down trees and power lines and can turn unsecured objects into dangerous projectiles. When winds reach tropical storm levels, NYC area bridges may implement speed and vehicle restrictions. New Yorkers should expect potential restrictions Sunday evening through Tuesday. Due to life-threatening rip tides, NYC beaches are closed to swimming, surfing, and bathing on Sunday, September 4, 2016. Prepare for flooding: If you live in a flood-susceptible area,",
                            1024
                        ],
                        [
                            "Notification issued 10/02/15 at 12:55 PM. New York City is forecast to experience intermittent wind gusts in excess of 40 MPH. During periods of high winds, residents should use caution when walking or driving high profile vehicles. Winds at these speeds can cause flying debris, turn unsecured objects into projectiles, and cause power outages. Individuals who have constructed a Succah for the holiday should take appropriate actions to secure the structure and roofing to prevent damage or injury from flying debris. To prepare, charge cell phone batteries, gather supplies, and turn refrigerators and freezers to a colder setting. Always stay clear of downed power lines. If you are affected by an outage, turn off all appliances and keep refrigerator and freezer doors closed to prevent food spoilage. Do not use generators indoors. If you lose power and have a disability or access needs, or use Life Sustaining Equipment (LSE) and need immediate assistance, please dial 9-1-1. For the latest weather information visit",
                            1024
                        ],
                        [
                            "Previous 24-hour rainfall (inches) at NOAA rain gauges as of 2/12/13 7:00AM: Rainfall at three NOAA rain gauges over the past 24 hours in inches:                                    JFK Airport:    0.39                        LaGuardia Airport: 0.52                        Central Park:   0.4                                                           List of Advisories                                                             BERGEN BASIN: CSO Advisory until 2/12/2013 7:00 PM          BRONX RIVER: No CSO Advisory                     FLUSHING BAY: No CSO Advisory                     FLUSHING CREEK: CSO Advisory until 2/12/2013 11:00 AM         FRESH CREEK: No CSO Advisory                     GOWANUS CANAL: CSO Advisory until 2/13/2013 12:00 AM         HEAD OF BAY: No CSO Advisory                     HUTCHINSON RIVER: No CSO Advisory                   MILL BASIN: No CSO Advisory                      NEWTOWN CREEK: CSO Advisory until 2/12/2013 11:00 PM         NORTHERN JAMAICA BAY: No CSO Advisory                ",
                            1024
                        ]
                    ],
                    "average_length": 373.13405566178034
                }
            ],
            "semantic_types": []
        }
    ],
    "key_column_candidates": []
}