{
    "dataset_name": "nkn9-ge6x",
    "columns": [
        {
            "column_name": "Frequentyly Asked Questions",
            "number_non_empty_cells": 22,
            "number_empty_cells": 0,
            "number_distinct_values": 22,
            "frequent_values": [
                "How do I apply for public housing with NYCHA? ",
                "Do I need to submit documents with the NYCHA public housing application? ",
                "How will I know that my public housing application has been received by NYCHA? ",
                "How often should I file an application? ",
                "What is the difference between Public Housing and Section 8? "
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 22,
                    "shortest_values": [
                        [
                            "How much will my rent be? ",
                            26
                        ],
                        [
                            "What is working family preference?",
                            34
                        ],
                        [
                            "Are utilities included in my rent? ",
                            35
                        ],
                        [
                            "How often should I file an application? ",
                            40
                        ],
                        [
                            "How do I apply for public housing with NYCHA? ",
                            46
                        ]
                    ],
                    "longest_values": [
                        [
                            "Do I need to have children living in my household to be eligible to apply for public housing? ",
                            94
                        ],
                        [
                            "Do I have to be citizen of the United States to be eligible to apply for public housing? ",
                            89
                        ],
                        [
                            "Do I have to be a resident of New York City to be eligible to apply for public housing? ",
                            88
                        ],
                        [
                            "What happens after I receive notification of my placement to a certified waiting list? ",
                            87
                        ],
                        [
                            "Is there a maximum income that would make me ineligible to apply for public housing? ",
                            85
                        ]
                    ],
                    "average_length": 64.68181818181819
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Answers",
            "number_non_empty_cells": 22,
            "number_empty_cells": 0,
            "number_distinct_values": 22,
            "frequent_values": [
                "Apply Online You may apply online at (http://apply.nycha.info) from any device with Internet access; or you may file online from any of our Walk-in centers. Get a Paper Application Call or visit NYCHA’s Customer Contact Center to get a paper application Submit a request to have an application mailed to you. ",
                "No, you do not need to submit documents with the NYCHA public housing application. The information you provide on your application will be verified if and when we are able to reach your application for an eligibility interview. Please do not send any documents with your application. (If you are applying for NYCHA public housing as a Victim of Domestic Violence, please see these guidelines regarding supporting documents.)",
                "Applicants will receive a letter from NYCHA within 45 days acknowledging the date your application was received and the housing priority that you have been assigned based on the information provided in your application. If you do not receive such a letter from NYCHA, please contact the Customer Contact Center at (718)-707-7771 from 8 AM – 5PM, Monday through Friday.",
                "If you are still interested in applying for public housing you can re-apply every 12 months. If you have not been invited for an eligibility interview, you must file a new application every 12 months to remain on the waiting list. You will retain the filing date from your original application.",
                "Public housing apartments are owned and operated by NYCHA. More than 400,000 New Yorkers reside in one of the 178,895 apartments located around the five boroughs of New York City. The public housing waiting list has over 160,000 applications. The Section 8 Program enables eligible persons to rent privately owned apartments. Housing assistance payments are made to the private landlords. Please be aware that the Section 8 waiting list is presenting closed to new applicants."
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 22,
                    "shortest_values": [
                        [
                            "No, single adults are eligible to apply for public housing.",
                            59
                        ],
                        [
                            "No, you are not required to have income to be eligible to apply. ",
                            65
                        ],
                        [
                            "You or your co-head of household must be at least 62 years or older and all other household members must be 62 years of age or older.",
                            133
                        ],
                        [
                            "The goal of the Working Family Preference is to maintain the stability, diversity and healthy income mix for the population of public housing. ",
                            143
                        ],
                        [
                            "The market value of the asset will not be included as income, but the income yield from the asset such as interests or dividends will be included.",
                            146
                        ]
                    ],
                    "longest_values": [
                        [
                            "The information you provided on your most recent public housing application will determine when we may be able to invite you for an Eligibility Interview. It is therefore important that you notify us of any changes as soon as it occurs. Your application is selected by computer for an eligibility interview based on your borough choice, apartment size, housing priority and date of application. However, due to the large number of families on the waiting list, and the low turnover and vacancy rate of apartments, it is impossible to estimate when a family might be selected for an eligibility interview. ",
                            605
                        ],
                        [
                            "Public housing apartments are owned and operated by NYCHA. More than 400,000 New Yorkers reside in one of the 178,895 apartments located around the five boroughs of New York City. The public housing waiting list has over 160,000 applications. The Section 8 Program enables eligible persons to rent privately owned apartments. Housing assistance payments are made to the private landlords. Please be aware that the Section 8 waiting list is presenting closed to new applicants.",
                            476
                        ],
                        [
                            "No, you do not need to submit documents with the NYCHA public housing application. The information you provide on your application will be verified if and when we are able to reach your application for an eligibility interview. Please do not send any documents with your application. (If you are applying for NYCHA public housing as a Victim of Domestic Violence, please see these guidelines regarding supporting documents.)",
                            424
                        ],
                        [
                            "You must immediately notify the Customer Contact Center of any change to your mailing address or telephone number(s). Changes to your family size, source of income or amount of income may affect the placement of your application, if you are not certain whether to report the change, you may contact the Customer Contact Center for information or re-file a new application with the updated information. ",
                            402
                        ],
                        [
                            "You must be at least 18 years or older, or an emancipated minor to be eligible to apply for public housing. An emancipated minor is a child who has been granted the status of adulthood by a court order or other formal arrangement. In the United States, there are three main ways for a teenager to become emancipated and they are: Court petition; Marriage and Military Service. ",
                            377
                        ]
                    ],
                    "average_length": 281.5
                }
            ],
            "semantic_types": []
        }
    ],
    "key_column_candidates": []
}