{
    "dataset_name": "qnuk-aubm",
    "columns": [
        {
            "column_name": "Agency",
            "number_non_empty_cells": 199,
            "number_empty_cells": 0,
            "number_distinct_values": 50,
            "frequent_values": [
                "Department of Probation (DOP)",
                "Department of Housing Preservation and Development (HPD)",
                "NYC ACRE",
                "NYC Independent Budget Office (IBO)",
                "Department of Parks and Recreation (DPR)"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 199,
                    "shortest_values": [
                        [
                            "Yelp",
                            4
                        ],
                        [
                            "CSNYC",
                            5
                        ],
                        [
                            "CSNYC",
                            5
                        ],
                        [
                            "Parse",
                            5
                        ],
                        [
                            "Enigma",
                            6
                        ]
                    ],
                    "longest_values": [
                        [
                            "Department of Information Technology and Telecommunications (DoITT)",
                            67
                        ],
                        [
                            "Department of Information Technology & Telecommunications (DoITT)",
                            65
                        ],
                        [
                            "Department of Information Technology & Telecommunications (DoITT)",
                            65
                        ],
                        [
                            "Department of Information Technology & Telecommunications (DoITT)",
                            65
                        ],
                        [
                            "Department of Information Technology & Telecommunications (DoITT)",
                            65
                        ]
                    ],
                    "average_length": 33.381909547738694
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Dataset",
            "number_non_empty_cells": 199,
            "number_empty_cells": 0,
            "number_distinct_values": 198,
            "frequent_values": [
                "Hurricane Storm Surge Depths - NNE Bearing",
                "Placements by Community District (CD)",
                "Abuse/Neglect by CD",
                "Child Welfare Indicators -Annual and quarterly report indicators",
                "New York City Population by Borough, 1950 - 2040"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 199,
                    "shortest_values": [
                        [
                            "YQL",
                            3
                        ],
                        [
                            "Pools",
                            5
                        ],
                        [
                            "eGRID",
                            5
                        ],
                        [
                            "Parse",
                            5
                        ],
                        [
                            "Roadbed",
                            7
                        ]
                    ],
                    "longest_values": [
                        [
                            "New York City’s School-Age and 65 and Over Populations by Borough, 1950 – 2040",
                            78
                        ],
                        [
                            "Enigma API | Over 100k federal, state, local & international data sets",
                            70
                        ],
                        [
                            "Juvenile Operations - End-of-Year Probationer Count (Calendar Year)",
                            67
                        ],
                        [
                            "New York Power Authority Net Generation (MWh) Produced by Facility",
                            66
                        ],
                        [
                            "Juvenile Operations - End-of-Year Probationer Count (Fiscal Year)",
                            65
                        ]
                    ],
                    "average_length": 30.87437185929648
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Dataset Description",
            "number_non_empty_cells": 197,
            "number_empty_cells": 2,
            "number_distinct_values": 178,
            "frequent_values": [
                "Data to solve NYC ACRE's BigIdea",
                "Unadjusted decennial census data from 1950-2000 and projected figures from 2010-2040: summary table of New York City population numbers and percentage share by Borough, including school-age (5 to 17), 65 and Over, and total population.",
                "",
                "This table contains the number of probationers under supervision on the last day of a calendar year",
                "This table contains the number of presentence investigations completed by the Department during a calendar year"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 197,
                    "shortest_values": [
                        [
                            "Directory Pools",
                            15
                        ],
                        [
                            "Landmark interiors",
                            18
                        ],
                        [
                            "Directory of Landfills",
                            22
                        ],
                        [
                            "Directory of Play Areas",
                            23
                        ],
                        [
                            "Directory of Skateparks",
                            23
                        ]
                    ],
                    "longest_values": [
                        [
                            "The CSRHub Specification for REST Access (CSRA) API offers a simple way to request information from the CSRHub database of corporate sustainability ratings.  A developer can easily use the CSRA API to:Retrieve high level, intermediate, and/or detailed sustainability performance information on any of 8,800 companies in 102 countries and 135 different industry groups.Enter tickers or variants of company names and receive a standard name or CSRHub invariant ID number for any company in the database.Request information about companies such as their industry, location (address, city, state, country, zip code, and/or phone number), web site, and/or the web location for their CSR information.Request a list of the data sources that have reported information on a company (or a total of the number of sources).Request average values for all companies in an industry or geographic area.Request historic data for any month from the present back to December 2008. For questions or comments, contact: bahar@csrhub.com",
                            1014
                        ],
                        [
                            "This list contains the most recently published active medallion drivers list. This is a list of licensees who are currently authorized to operate NYC TLC licensed Taxicabs. The old data set is no longer being updated but can be accessed from the link given below to access data from 03/07/2013 through 01/04/2014 https://data.cityofnewyork.us/Transportation/Medallion-Drivers-Active/n776-dsqy. A new Change Log containing changes in status from 10/28/2013 onwards can be found at https://data.cityofnewyork.us/Transportation/TLC-MEDALLION-ACTIVE-Historical-Data/sjfe-fppp",
                            571
                        ],
                        [
                            "The data set contains information on work orders created through HPD's Emergency Repair Program, Alternative Enforcement Program and Demolition programs and fees assessed against properties by HPD pursuant the Housing Manteca Code.  The work orders are created to conduct emergency repair work when an owner fails to address a hazardous condition pursuant to the requirements of an HPD-issued violation, a Department of Buildings Declaration of Emergency, a Department of Health Commissioner's Order to Abate or an emergency violation issued by another City Agency",
                            564
                        ],
                        [
                            "The Lehman College Bronx Information Portal is a map-based open data platform with a focus on all things Bronx. Developed by Lehman College/CUNY with Socrata, the portal brings together Bronx-related open data all in one place.  Data sets include education, health, population, environment and sustainability, among others. Join us to engage students, researchers and communities in connecting the Bronx to enrich teaching, learning and community service initiatives. For questions or comments, contact: ronald.bergmann@lehman.cuny.edu",
                            535
                        ],
                        [
                            "Carpoolworld brings people together for ridesharing, using a pioneering search engine that matches individuals based on their trip origins and destinations, anywhere on the planet. The Carpoolworld API gives developers access to the web site's essential functions to create trips, find matches, and contact potential travel partners. The API is developed using the RESTful style. Responses are formatted in XML. For questions or comments, contact: iboulard@carpoolworld.com",
                            473
                        ]
                    ],
                    "average_length": 133.39086294416245
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Update Frequency",
            "number_non_empty_cells": 199,
            "number_empty_cells": 0,
            "number_distinct_values": 11,
            "frequent_values": [
                "As needed",
                "Annually",
                "Monthly",
                "Quarterly",
                "As Needed"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 199,
                    "shortest_values": [
                        [
                            "Daily",
                            5
                        ],
                        [
                            "Daily",
                            5
                        ],
                        [
                            "Daily",
                            5
                        ],
                        [
                            "Daily",
                            5
                        ],
                        [
                            "Daily",
                            5
                        ]
                    ],
                    "longest_values": [
                        [
                            "Historical Data",
                            15
                        ],
                        [
                            "Historical Data",
                            15
                        ],
                        [
                            "Historical Data",
                            15
                        ],
                        [
                            "Semi-Annually",
                            13
                        ],
                        [
                            "Biannually",
                            10
                        ]
                    ],
                    "average_length": 8.442211055276381
                }
            ],
            "semantic_types": []
        }
    ],
    "key_column_candidates": []
}