{
    "dataset_name": "tncb-agv4",
    "columns": [
        {
            "column_name": "Grade Band",
            "number_non_empty_cells": 63,
            "number_empty_cells": 0,
            "number_distinct_values": 16,
            "frequent_values": [
                "Pre-Kindergarten-12th Grade",
                "High School",
                "Kindergarten- 8th Grade",
                "Kindergarten- 12th Grade",
                "Pre-Kindergarten, Kindergarten"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 63,
                    "shortest_values": [
                        [
                            "High School",
                            11
                        ],
                        [
                            "High School",
                            11
                        ],
                        [
                            "High School",
                            11
                        ],
                        [
                            "High School",
                            11
                        ],
                        [
                            "High School",
                            11
                        ]
                    ],
                    "longest_values": [
                        [
                            "Pre-Kindergarten, Kindergarten, Gifted & Talented",
                            49
                        ],
                        [
                            "Pre-Kindergarten, Kindergarten, Gifted & Talented",
                            49
                        ],
                        [
                            "Pre-Kindergarten, Kindergarten, Gifted & Talented",
                            49
                        ],
                        [
                            "Elementary School- Middle School",
                            32
                        ],
                        [
                            "Kindergarten, Gifted & Talented",
                            31
                        ]
                    ],
                    "average_length": 22.857142857142858
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Activity",
            "number_non_empty_cells": 63,
            "number_empty_cells": 0,
            "number_distinct_values": 63,
            "frequent_values": [
                "Provided grant funding for schools to increase school diversity through recruitment & support of diverse learners",
                "Allowed school schedule flexibility and encouraged sharing of best practices to support diverse school communities",
                "Encourage the recruitment and retention of men of color to teach in New York City schools",
                "Dual language programs available on K & Pre-K application",
                "Implemented enrollment targets for 7 elementary schools as part of Pre-K and K admissions to increase school diversity"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 63,
                    "shortest_values": [
                        [
                            "DREAM-SHSI",
                            10
                        ],
                        [
                            "Re-zonings",
                            10
                        ],
                        [
                            "Discovery Program",
                            17
                        ],
                        [
                            "Expansion of ASD Nest program",
                            29
                        ],
                        [
                            "Federal Magnet school programs",
                            30
                        ]
                    ],
                    "longest_values": [
                        [
                            "Developed partnership with organizations included the Research Alliance at New York University and PASSNYC that focus on increasing access to high school admissions",
                            164
                        ],
                        [
                            "Built a new easy-to-use online tool that lets users search New York City’s hundreds of high school choices by school name, keyword, location, size, and more ",
                            157
                        ],
                        [
                            "Display seat targets and demand information for both General Education and Students with Disabilities in 2017 New York City High School Directory ",
                            146
                        ],
                        [
                            "Conducted additional outreach to students and families through 4410s, CPSEs, and the Turning 5 process for all elementary admissions processes",
                            142
                        ],
                        [
                            "Utilized Pre-K for All providers in raising family awareness about the Kindergarten and Gifted & Talented application processes",
                            127
                        ]
                    ],
                    "average_length": 74.33333333333333
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Description",
            "number_non_empty_cells": 63,
            "number_empty_cells": 0,
            "number_distinct_values": 63,
            "frequent_values": [
                "The Progressive Redesign Opportunity Schools for Excellence (PROSE) used funding from the National Education Association to provide $750 mini-grants and an opportunity to apply for up to $5000 in mini grant funding to 10 schools who sought to increase diversity in their school communities. Many of these schools utilized this funding to provide planning time for school staff working on diversity issues, as well as to do additional recruitment and outreach to underrepresented populations through school fairs and direct communication to families. Additionally, schools also utilized this funding to better equip their schools to support diverse learners. Examples of these activities included full-day professional development and guest speakers.",
                "As part of PROSE, schools were allowed flexibility in how their school day is organized and encouraged to implement models of teacher inter-visitation, with many schools centering this work on the goal of meeting the needs of a diverse student body. 71 schools participated in schedule flexibility, allowing leaders to tailor school structure to meet specific needs of school communities. Teacher inter-visitations have been implemented in many schools, and encouraged the sharing of best practices in how best to serve a diverse school community.",
                "In partnership with the Mayor's Young Men's Initiative, the City University of New York, and Teach for America, the DOE created new initiatives and programs aiming to put an additional 1,000 men of color on course to become NYC public school teachers over the next three years. These initiatives include building out principal and mentor networks and utilizing culturally-relevant professional and leadership workshops.",
                "As part of the central Kindergarten application, families were allowed to apply directly to Dual Language program offerings rather than just the school itself. This allowed families to express a preference for this type of pedagogy, as well as enabled the DOE to better anticipate incoming populations of English Language Learners. On this application families were asked three short questions (aligned with the home language survey) to identify potential ELLs.",
                "In partnership with principals and superintendents, the Office of Student Enrollment implemented admissions targets for seven elementary schools in an effort to increase school diversity and encourage access to schools for high-needs families. Each of these schools created admissions targets for students meeting certain criteria including Free and Reduced-price Lunch eligibility, English language learner status, and families impacted by incarceration. For schools with sufficient demand from these students, all were able to meet or exceed their stated targets. These schools will continue to maintain these targets for the coming admissions cycle."
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 63,
                    "shortest_values": [
                        [
                            "Target non-applicant groups using both English and Spanish.",
                            59
                        ],
                        [
                            "All high school open house and information session for admissions will be translated into 10 languages on the DOE website.",
                            122
                        ],
                        [
                            "~2,400 families were invited to targeted support centers to work with admissions counselors and develop their high school applications.",
                            135
                        ],
                        [
                            "Applications for all elementary admissions processes, including the Gifted & Talented request for testing, were available online in 10 languages. ",
                            146
                        ],
                        [
                            "The LGBT+ Advisory Council held its first meeting in June 2015 and its member organizations now total 34. These organizations meet bi-monthly to inform and support the LGBTQ work of the NYCDOE.",
                            193
                        ]
                    ],
                    "longest_values": [
                        [
                            "Introduced a 6-point plan focused on increasing outreach and preparation programs for students from underrepresented populations. Initiatives received $15 million from OMB for work through FY20, and an additional $2 million from New York State. The initiatives include: 1. Developing an outreach team to increase outreach to students from underrepresented backgrounds to encourage participation in the Specialized High School Admissions Test (SHSAT)2. Offer the SHSAT during the school day in 7 schools in fall 2016 to ease the burden of weekend testing3. Leverage existing middle school after school programs to implement new SHSAT preparation programs 4. Expand DREAM, a SHSAT preparation program, to serve additional rising 8th grade students in an Intensive program5. Expand Discovery, a preparation program for rising 9th graders who score below the minimum SHSAT offer score6. Improve school climate at the Specialized High Schools to create more welcoming school cultures for diverse learners",
                            999
                        ],
                        [
                            "The Office of School Design and Charter Partnerships works with Superintendents to collaborate with each school community - staff, parents, students, and other community stakeholders- to respond to educational needs, particularly when schools are exhibiting declining academic performance. The range of redesign strategies include: Addition of new programs or services (School Redesign),  New School development, School relocation (Reciting), Grade reconfiguration (Truncation / Expansion), Consolidation and Closure.  The end result is a better option for students, one whose culture reflects a single cohesive community and a higher instructional quality which leads to student achievement. These strategies are constructed with potential impacts on school diversity in mind. ",
                            778
                        ],
                        [
                            "Through a public-private partnership with lead partners NYC Foundation for Computer Science Education (CSNYC) and Robin Hood, DOE is seeking to implement computer science education at each school level. 246 elementary, middle, and high schools participated in 15-16. These programs seek to not only increase access to these programs broadly, but to diversify the population of students in these courses.  By end of 2015-16, the City released applications to add over 50 new middle and high-school programs for Fall 2016, an expansion of the Software Engineering Program and the AP Computer Science Principles course. The City has also begun working to offer new CS education in elementary schools and added a computer science track for the STEM institute.",
                            755
                        ],
                        [
                            "The Progressive Redesign Opportunity Schools for Excellence (PROSE) used funding from the National Education Association to provide $750 mini-grants and an opportunity to apply for up to $5000 in mini grant funding to 10 schools who sought to increase diversity in their school communities. Many of these schools utilized this funding to provide planning time for school staff working on diversity issues, as well as to do additional recruitment and outreach to underrepresented populations through school fairs and direct communication to families. Additionally, schools also utilized this funding to better equip their schools to support diverse learners. Examples of these activities included full-day professional development and guest speakers.",
                            749
                        ],
                        [
                            "In partnership with principals and superintendents, the Office of Student Enrollment implemented admissions targets for seven elementary schools in an effort to increase school diversity and encourage access to schools for high-needs families. Each of these schools created admissions targets for students meeting certain criteria including Free and Reduced-price Lunch eligibility, English language learner status, and families impacted by incarceration. For schools with sufficient demand from these students, all were able to meet or exceed their stated targets. These schools will continue to maintain these targets for the coming admissions cycle.",
                            652
                        ]
                    ],
                    "average_length": 377.1746031746032
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Target Population",
            "number_non_empty_cells": 63,
            "number_empty_cells": 0,
            "number_distinct_values": 24,
            "frequent_values": [
                "Families and communities",
                "Schools interested in additional supports for diverse learners and creating diverse schools",
                "High performing, high needs rising 8th graders from underrepresented populations",
                "English Language Learners & families with non-English home language",
                "Families and communities; School staff"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 63,
                    "shortest_values": [
                        [
                            "Families and communities",
                            24
                        ],
                        [
                            "Families and communities",
                            24
                        ],
                        [
                            "Families and communities",
                            24
                        ],
                        [
                            "Families and communities",
                            24
                        ],
                        [
                            "Families and communities",
                            24
                        ]
                    ],
                    "longest_values": [
                        [
                            "Low-income students, English Language Learners, families impacted by incarceration, students in the child welfare system",
                            120
                        ],
                        [
                            "Low-income students, English Language Learners, families impacted by incarceration, students in the child welfare system",
                            120
                        ],
                        [
                            "Low-income students, English Language Learners, families impacted by incarceration, students in the child welfare system",
                            120
                        ],
                        [
                            "Schools interested in additional supports for diverse learners and creating diverse schools",
                            91
                        ],
                        [
                            "Schools interested in additional supports for diverse learners and creating diverse schools",
                            91
                        ]
                    ],
                    "average_length": 45.07936507936508
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Category",
            "number_non_empty_cells": 63,
            "number_empty_cells": 0,
            "number_distinct_values": 6,
            "frequent_values": [
                "Creating Access Through Enrollment & School Planning",
                "Creating Access Through Outreach & Information Sharing",
                "Promoting Quality Schools for All Students",
                "Encouraging a Supportive School Climate",
                "Evaluation for Continuous Improvement"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 63,
                    "shortest_values": [
                        [
                            "Evaluation for Continuous Improvement",
                            37
                        ],
                        [
                            "Evaluation for Continuous Improvement",
                            37
                        ],
                        [
                            "Evaluation for Continuous Improvement",
                            37
                        ],
                        [
                            "Evaluation for Continuous Improvement",
                            37
                        ],
                        [
                            "Encouraging a Supportive School Climate",
                            39
                        ]
                    ],
                    "longest_values": [
                        [
                            "Creating Access Through Outreach & Information Sharing",
                            54
                        ],
                        [
                            "Creating Access Through Outreach & Information Sharing",
                            54
                        ],
                        [
                            "Creating Access Through Outreach & Information Sharing",
                            54
                        ],
                        [
                            "Creating Access Through Outreach & Information Sharing",
                            54
                        ],
                        [
                            "Creating Access Through Outreach & Information Sharing",
                            54
                        ]
                    ],
                    "average_length": 48.317460317460316
                }
            ],
            "semantic_types": []
        }
    ],
    "key_column_candidates": []
}