{
    "dataset_name": "ws4c-4g69",
    "columns": [
        {
            "column_name": "Agency",
            "number_non_empty_cells": 594,
            "number_empty_cells": 0,
            "number_distinct_values": 9,
            "frequent_values": [
                "Department of Youth and Community Development",
                "Criminal Justice Coordinator",
                "Human Resources Administration",
                "Department of Probation",
                "Administration for Children's Services"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 594,
                    "shortest_values": [
                        [
                            "Small Business Services",
                            23
                        ],
                        [
                            "Small Business Services",
                            23
                        ],
                        [
                            "Small Business Services",
                            23
                        ],
                        [
                            "Small Business Services",
                            23
                        ],
                        [
                            "Small Business Services",
                            23
                        ]
                    ],
                    "longest_values": [
                        [
                            "Department of Housing Preservation and Development",
                            50
                        ],
                        [
                            "Department of Housing Preservation and Development",
                            50
                        ],
                        [
                            "Department of Housing Preservation and Development",
                            50
                        ],
                        [
                            "Department of Housing Preservation and Development",
                            50
                        ],
                        [
                            "Department of Housing Preservation and Development",
                            50
                        ]
                    ],
                    "average_length": 42.148148148148145
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "EPIN",
            "number_non_empty_cells": 594,
            "number_empty_cells": 0,
            "number_distinct_values": 72,
            "frequent_values": [
                "26015I0006",
                "26015I0002",
                "26015I0007",
                "26015I0005",
                "26015I0004"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 594,
                    "shortest_values": [
                        [
                            "80114I0002",
                            10
                        ],
                        [
                            "80114I0002",
                            10
                        ],
                        [
                            "80114I0002",
                            10
                        ],
                        [
                            "80114I0003",
                            10
                        ],
                        [
                            "80114I0003",
                            10
                        ]
                    ],
                    "longest_values": [
                        [
                            "80114I0002",
                            10
                        ],
                        [
                            "80114I0002",
                            10
                        ],
                        [
                            "80114I0002",
                            10
                        ],
                        [
                            "80114I0003",
                            10
                        ],
                        [
                            "80114I0003",
                            10
                        ]
                    ],
                    "average_length": 10.0
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Procurement Title",
            "number_non_empty_cells": 594,
            "number_empty_cells": 0,
            "number_distinct_values": 72,
            "frequent_values": [
                "NDA - Opportunity Youth: Supported Work Experience",
                "NDA - Support Services for Healthy Families",
                "NDA - Adult Literacy",
                "NDA - Support Services for Housing",
                "NDA - Support Services for Immigrants"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 594,
                    "shortest_values": [
                        [
                            "Respite Care",
                            12
                        ],
                        [
                            "Respite Care",
                            12
                        ],
                        [
                            "Respite Care",
                            12
                        ],
                        [
                            "Respite Care",
                            12
                        ],
                        [
                            "Respite Care",
                            12
                        ]
                    ],
                    "longest_values": [
                        [
                            "Next STEPS (Striving Toward Engagement and Peaceful Solutions): A Transformative Mentoring Intervention",
                            103
                        ],
                        [
                            "Next STEPS (Striving Toward Engagement and Peaceful Solutions): A Transformative Mentoring Intervention",
                            103
                        ],
                        [
                            "Next STEPS (Striving Toward Engagement and Peaceful Solutions): A Transformative Mentoring Intervention",
                            103
                        ],
                        [
                            "Next STEPS (Striving Toward Engagement and Peaceful Solutions): A Transformative Mentoring Intervention",
                            103
                        ],
                        [
                            "Next STEPS (Striving Toward Engagement and Peaceful Solutions): A Transformative Mentoring Intervention",
                            103
                        ]
                    ],
                    "average_length": 44.341750841750844
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Procurement Description",
            "number_non_empty_cells": 594,
            "number_empty_cells": 0,
            "number_distinct_values": 42,
            "frequent_values": [
                "Mayor de Blasio and his administration have made a commitment to increase access to afterschool programs by New York City’s middle school students. These programs provide youth with the support of caring adults and engaging, fun activities that can help them address the challenges of early adolescence. In accordance with its mission to support the City’s youth and their families by funding high-quality youth and community development programs, DYCD launched its Out-of School Time (OST) initiative. The OST system offers students in grades K-12 a mix of academic, recreational and cultural activities. The programs are free of charge and located in neighborhoods across all five boroughs. DYCD is seeking qualified nonprofit organizations to operate OST programs in each public school (including charter schools) serving grades 6-8 and currently lacking comprehensive afterschool services (“Eligible Middle School”). For charter schools to be eligible, they must have a regular dismissal time of 3 p.m. and lack a comprehensive afterschool program. The new programs will operate for 15 hours per week during the school year for a total of 540 hours annually. At least 9 hours per week will be devoted to structured, goal-oriented programming, with the remaining 6 hours being available for drop-in activities. Of the total 540 hours, 216 hours of activities may be unstructured and offered during the school week or on school closing days. All programs will provide academic enrichment, leadership development and physical activity. Providers will work in close collaboration with the host school to recruit and retain struggling students, enhance the program design, and align structured activities with school-day learning. Schools, in turn, will make in-kind contributions to the programs, such as teacher time and curricular resources, in addition to providing classroom space and access to school facilities such as the gymnasium, computer labs and library. The procurement for the OST Middle School Expansion initiative will be organized into 32 solicitations, one for each school district with a cohort of Eligible Middle Schools. ",
                "As the City's Community Action Agency, DYCD is the recipient of federal Community Services Block Grant (CSBG) funds through the State of New York and is responsible for distributing funding for programs on a local level in accordance with the goals of the CSBG statute. In order to maximize the impact of CSBG funding, DYCD targets programs to low income communities, which it designates as Neighborhood Development Areas (NDA). Each NDA is represented by a Neighborhood Advisory Board (NAB) which conducts needs assessments for social services in their NDAs. According to the priorities identified by the NABs, this RFP will seek qualified organizations to provide supported work experience services to Opportunity Youth. These services would include a paid work experience for youth 16-24 who are not working and not in school. Only nonprofit organizations are eligible to propose.",
                "As the City’s Community Action Agency, DYCD is the recipient of federal Community Services Block Grant (CSBG) funds through the State of New York and is responsible for distributing funding for programs on a local level in accordance with the goals of the CSBG statute. In order to maximize the impact of CSBG funding, DYCD targets programs to low income communities, which it designates as Neighborhood Development Areas (NDA). Each NDA is represented by a Neighborhood Advisory Board (NAB) which conducts needs assessments for social services in their NDAs. According to the priorities identified by the NABs, this RFP will seek qualified organizations to provide Support Services for Healthy Families. Programs would assist families in accessing resources to address identified needs, including child care, elder care, child support, parenting, employment, education, housing, legal assistance, health, nutrition, and addressing violence, domestic violence and risky behaviors. Only nonprofit organizations will be eligible to apply.",
                "As the City’s Community Action Agency, DYCD is the recipient of federal Community Services Block Grant (CSBG) funds through the State of New York and is responsible for distributing funding for programs on a local level in accordance with the goals of the CSBG statute. In order to maximize the impact of CSBG funding, DYCD targets programs to low income communities, which it designates as Neighborhood Development Areas (NDA). Each NDA is represented by a Neighborhood Advisory Board (NAB) which conducts needs assessments for social services in their NDAs. According to the priorities identified by the NABs, this RFP will seek qualified organizations to provide literacy programs to adults. These programs will aim to assist adults in becoming literate and obtain the knowledge and skills necessary for employment, self-sufficiency and to pursue further education. Programs may include Adult Basic Education classes and/or High School Equivalency test preparation. Only nonprofit organizations will be eligible to apply.",
                "As the City's Community Action Agency, DYCD is the recipient of federal Community Services Block Grant (CSBG) funds through the State of New York and is responsible for distributing funding for programs on a local level in accordance with the goals of the CSBG statute. In order to maximize the impact of CSBG funding, DYCD targets programs to low income communities, which it designates as Neighborhood Development Areas (NDA). Each NDA is represented by a Neighborhood Advisory Board (NAB) which conducts needs assessments for social services in their NDAs. According to the priorities identified by the NABs, this RFP will seek qualified organizations to provide Support Services for Housing. Housing programs would provide assistance to low income tenants and homeowners and tenant groups with the goal of maintaining or attaining adequate, affordable, and safe housing. Only nonprofit organizations will be eligible to apply."
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 594,
                    "shortest_values": [
                        [
                            "Through Next STEPS, DOP is bringing a transformative mentoring approach to high risk youth (not necessarily on probation) who live in and around targeted New York City Housing Authority (NYCHA) housing developments. Through this RFP, DOP is seeking appropriately qualified vendors to provide these services in targeted NYCHA housing developments in Red Hook/Fort Greene, Brooklyn. Next STEPS is part of a broader initiative to make New York City’s neighborhoods and housing developments safer. As such, the NYCHA housing developments selected for Next STEPS are part of a citywide focus on reducing violent crime in those areas, as these housing developments account for nearly 20% of all violent crime in public housing. ",
                            722
                        ],
                        [
                            "Through Next STEPS, DOP is bringing a transformative mentoring approach to high risk youth (not necessarily on probation) who live in and around targeted New York City Housing Authority (NYCHA) housing developments. Through this RFP, DOP is seeking appropriately qualified vendors to provide these services in targeted NYCHA housing developments in Red Hook/Fort Greene, Brooklyn. Next STEPS is part of a broader initiative to make New York City’s neighborhoods and housing developments safer. As such, the NYCHA housing developments selected for Next STEPS are part of a citywide focus on reducing violent crime in those areas, as these housing developments account for nearly 20% of all violent crime in public housing. ",
                            722
                        ],
                        [
                            "Through Next STEPS, DOP is bringing a transformative mentoring approach to high risk youth (not necessarily on probation) who live in and around targeted New York City Housing Authority (NYCHA) housing developments. Through this RFP, DOP is seeking appropriately qualified vendors to provide these services in targeted NYCHA housing developments in Red Hook/Fort Greene, Brooklyn. Next STEPS is part of a broader initiative to make New York City’s neighborhoods and housing developments safer. As such, the NYCHA housing developments selected for Next STEPS are part of a citywide focus on reducing violent crime in those areas, as these housing developments account for nearly 20% of all violent crime in public housing. ",
                            722
                        ],
                        [
                            "Through Next STEPS, DOP is bringing a transformative mentoring approach to high risk youth (not necessarily on probation) who live in and around targeted New York City Housing Authority (NYCHA) housing developments. Through this RFP, DOP is seeking appropriately qualified vendors to provide these services in targeted NYCHA housing developments in Red Hook/Fort Greene, Brooklyn. Next STEPS is part of a broader initiative to make New York City’s neighborhoods and housing developments safer. As such, the NYCHA housing developments selected for Next STEPS are part of a citywide focus on reducing violent crime in those areas, as these housing developments account for nearly 20% of all violent crime in public housing. ",
                            722
                        ],
                        [
                            "Through Next STEPS, DOP is bringing a transformative mentoring approach to high risk youth (not necessarily on probation) who live in and around targeted New York City Housing Authority (NYCHA) housing developments. Through this RFP, DOP is seeking appropriately qualified vendors to provide these services in targeted NYCHA housing developments in Red Hook/Fort Greene, Brooklyn. Next STEPS is part of a broader initiative to make New York City’s neighborhoods and housing developments safer. As such, the NYCHA housing developments selected for Next STEPS are part of a citywide focus on reducing violent crime in those areas, as these housing developments account for nearly 20% of all violent crime in public housing. ",
                            722
                        ]
                    ],
                    "longest_values": [
                        [
                            "Mayor de Blasio and his administration have made a commitment to increase access to afterschool programs by New York City’s middle school students. These programs provide youth with the support of caring adults and engaging, fun activities that can help them address the challenges of early adolescence. In accordance with its mission to support the City’s youth and their families by funding high-quality youth and community development programs, DYCD launched its Out-of School Time (OST) initiative. The OST system offers students in grades K-12 a mix of academic, recreational and cultural activities. The programs are free of charge and located in neighborhoods across all five boroughs. DYCD is seeking qualified nonprofit organizations to operate OST programs in each public school (including charter schools) serving grades 6-8 and currently lacking comprehensive afterschool services (“Eligible Middle School”). For charter schools to be eligible, they must have a regular dismissal time of 3 p.m. and lack a comprehensive afterschool program. The new programs will operate for 15 hours per week during the school year for a total of 540 hours annually. At least 9 hours per week will be devoted to structured, goal-oriented programming, with the remaining 6 hours being available for drop-in activities. Of the total 540 hours, 216 hours of activities may be unstructured and offered during the school week or on school closing days. All programs will provide academic enrichment, leadership development and physical activity. Providers will work in close collaboration with the host school to recruit and retain struggling students, enhance the program design, and align structured activities with school-day learning. Schools, in turn, will make in-kind contributions to the programs, such as teacher time and curricular resources, in addition to providing classroom space and access to school facilities such as the gymnasium, computer labs and library. The procurement for the OST Middle School Expansion initiative will be organized into 32 solicitations, one for each school district with a cohort of Eligible Middle Schools. ",
                            2142
                        ],
                        [
                            "Mayor de Blasio and his administration have made a commitment to increase access to afterschool programs by New York City’s middle school students. These programs provide youth with the support of caring adults and engaging, fun activities that can help them address the challenges of early adolescence. In accordance with its mission to support the City’s youth and their families by funding high-quality youth and community development programs, DYCD launched its Out-of School Time (OST) initiative. The OST system offers students in grades K-12 a mix of academic, recreational and cultural activities. The programs are free of charge and located in neighborhoods across all five boroughs. DYCD is seeking qualified nonprofit organizations to operate OST programs in each public school (including charter schools) serving grades 6-8 and currently lacking comprehensive afterschool services (“Eligible Middle School”). For charter schools to be eligible, they must have a regular dismissal time of 3 p.m. and lack a comprehensive afterschool program. The new programs will operate for 15 hours per week during the school year for a total of 540 hours annually. At least 9 hours per week will be devoted to structured, goal-oriented programming, with the remaining 6 hours being available for drop-in activities. Of the total 540 hours, 216 hours of activities may be unstructured and offered during the school week or on school closing days. All programs will provide academic enrichment, leadership development and physical activity. Providers will work in close collaboration with the host school to recruit and retain struggling students, enhance the program design, and align structured activities with school-day learning. Schools, in turn, will make in-kind contributions to the programs, such as teacher time and curricular resources, in addition to providing classroom space and access to school facilities such as the gymnasium, computer labs and library. The procurement for the OST Middle School Expansion initiative will be organized into 32 solicitations, one for each school district with a cohort of Eligible Middle Schools. ",
                            2142
                        ],
                        [
                            "Mayor de Blasio and his administration have made a commitment to increase access to afterschool programs by New York City’s middle school students. These programs provide youth with the support of caring adults and engaging, fun activities that can help them address the challenges of early adolescence. In accordance with its mission to support the City’s youth and their families by funding high-quality youth and community development programs, DYCD launched its Out-of School Time (OST) initiative. The OST system offers students in grades K-12 a mix of academic, recreational and cultural activities. The programs are free of charge and located in neighborhoods across all five boroughs. DYCD is seeking qualified nonprofit organizations to operate OST programs in each public school (including charter schools) serving grades 6-8 and currently lacking comprehensive afterschool services (“Eligible Middle School”). For charter schools to be eligible, they must have a regular dismissal time of 3 p.m. and lack a comprehensive afterschool program. The new programs will operate for 15 hours per week during the school year for a total of 540 hours annually. At least 9 hours per week will be devoted to structured, goal-oriented programming, with the remaining 6 hours being available for drop-in activities. Of the total 540 hours, 216 hours of activities may be unstructured and offered during the school week or on school closing days. All programs will provide academic enrichment, leadership development and physical activity. Providers will work in close collaboration with the host school to recruit and retain struggling students, enhance the program design, and align structured activities with school-day learning. Schools, in turn, will make in-kind contributions to the programs, such as teacher time and curricular resources, in addition to providing classroom space and access to school facilities such as the gymnasium, computer labs and library. The procurement for the OST Middle School Expansion initiative will be organized into 32 solicitations, one for each school district with a cohort of Eligible Middle Schools. ",
                            2142
                        ],
                        [
                            "Mayor de Blasio and his administration have made a commitment to increase access to afterschool programs by New York City’s middle school students. These programs provide youth with the support of caring adults and engaging, fun activities that can help them address the challenges of early adolescence. In accordance with its mission to support the City’s youth and their families by funding high-quality youth and community development programs, DYCD launched its Out-of School Time (OST) initiative. The OST system offers students in grades K-12 a mix of academic, recreational and cultural activities. The programs are free of charge and located in neighborhoods across all five boroughs. DYCD is seeking qualified nonprofit organizations to operate OST programs in each public school (including charter schools) serving grades 6-8 and currently lacking comprehensive afterschool services (“Eligible Middle School”). For charter schools to be eligible, they must have a regular dismissal time of 3 p.m. and lack a comprehensive afterschool program. The new programs will operate for 15 hours per week during the school year for a total of 540 hours annually. At least 9 hours per week will be devoted to structured, goal-oriented programming, with the remaining 6 hours being available for drop-in activities. Of the total 540 hours, 216 hours of activities may be unstructured and offered during the school week or on school closing days. All programs will provide academic enrichment, leadership development and physical activity. Providers will work in close collaboration with the host school to recruit and retain struggling students, enhance the program design, and align structured activities with school-day learning. Schools, in turn, will make in-kind contributions to the programs, such as teacher time and curricular resources, in addition to providing classroom space and access to school facilities such as the gymnasium, computer labs and library. The procurement for the OST Middle School Expansion initiative will be organized into 32 solicitations, one for each school district with a cohort of Eligible Middle Schools. ",
                            2142
                        ],
                        [
                            "Mayor de Blasio and his administration have made a commitment to increase access to afterschool programs by New York City’s middle school students. These programs provide youth with the support of caring adults and engaging, fun activities that can help them address the challenges of early adolescence. In accordance with its mission to support the City’s youth and their families by funding high-quality youth and community development programs, DYCD launched its Out-of School Time (OST) initiative. The OST system offers students in grades K-12 a mix of academic, recreational and cultural activities. The programs are free of charge and located in neighborhoods across all five boroughs. DYCD is seeking qualified nonprofit organizations to operate OST programs in each public school (including charter schools) serving grades 6-8 and currently lacking comprehensive afterschool services (“Eligible Middle School”). For charter schools to be eligible, they must have a regular dismissal time of 3 p.m. and lack a comprehensive afterschool program. The new programs will operate for 15 hours per week during the school year for a total of 540 hours annually. At least 9 hours per week will be devoted to structured, goal-oriented programming, with the remaining 6 hours being available for drop-in activities. Of the total 540 hours, 216 hours of activities may be unstructured and offered during the school week or on school closing days. All programs will provide academic enrichment, leadership development and physical activity. Providers will work in close collaboration with the host school to recruit and retain struggling students, enhance the program design, and align structured activities with school-day learning. Schools, in turn, will make in-kind contributions to the programs, such as teacher time and curricular resources, in addition to providing classroom space and access to school facilities such as the gymnasium, computer labs and library. The procurement for the OST Middle School Expansion initiative will be organized into 32 solicitations, one for each school district with a cohort of Eligible Middle Schools. ",
                            2142
                        ]
                    ],
                    "average_length": 1734.473063973064
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Service Name",
            "number_non_empty_cells": 594,
            "number_empty_cells": 0,
            "number_distinct_values": 46,
            "frequent_values": [
                "Case Management",
                "Preventive Services",
                "Life Skills",
                "Academic Supports",
                "Language Skills"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 594,
                    "shortest_values": [
                        [
                            "Shelter",
                            7
                        ],
                        [
                            "Housing",
                            7
                        ],
                        [
                            "Housing",
                            7
                        ],
                        [
                            "Shelter",
                            7
                        ],
                        [
                            "Housing",
                            7
                        ]
                    ],
                    "longest_values": [
                        [
                            "Emergency Preparedness and Response",
                            35
                        ],
                        [
                            "Emergency Preparedness and Response",
                            35
                        ],
                        [
                            "Emergency Preparedness and Response",
                            35
                        ],
                        [
                            "Emergency Preparedness and Response",
                            35
                        ],
                        [
                            "Emergency Preparedness and Response",
                            35
                        ]
                    ],
                    "average_length": 16.968013468013467
                }
            ],
            "semantic_types": []
        }
    ],
    "key_column_candidates": []
}