{
    "dataset_name": "g9ub-hrve",
    "columns": [
        {
            "column_name": "Project ID",
            "number_non_empty_cells": 346,
            "number_empty_cells": 0,
            "number_distinct_values": 346,
            "frequent_values": [
                "PW29370M",
                "PV205ACAD",
                "F175EC293A",
                "HH112HMFA",
                "CO296RF"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 346,
                    "shortest_values": [
                        [
                            "MOCDV",
                            5
                        ],
                        [
                            "NC-61",
                            5
                        ],
                        [
                            "NC-61A",
                            6
                        ],
                        [
                            "REMPIV",
                            6
                        ],
                        [
                            "CBSTGW",
                            6
                        ]
                    ],
                    "longest_values": [
                        [
                            "C75FCADEMDC",
                            11
                        ],
                        [
                            "CO290BCHJ-2",
                            11
                        ],
                        [
                            "LQD122-QW-1",
                            11
                        ],
                        [
                            "C114NEWRIP2",
                            11
                        ],
                        [
                            "HL82BUSHX-1",
                            11
                        ]
                    ],
                    "average_length": 8.786127167630058
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Description",
            "number_non_empty_cells": 346,
            "number_empty_cells": 0,
            "number_distinct_values": 343,
            "frequent_values": [
                "NYPD 84th Precinct - EE Upgrade",
                "Remediation of Petroleum Contaminated Sites",
                "FUEL TANK REPLACEMENT",
                "70 Mulberry St. Ny. Fire Alarm Upgrade all Floors",
                "NYBG - Edible Academy"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 346,
                    "shortest_values": [
                        [
                            "flea theater",
                            12
                        ],
                        [
                            "NEW 116TH PCT",
                            13
                        ],
                        [
                            "122CC- Millwork",
                            15
                        ],
                        [
                            "New 40th Precinct",
                            17
                        ],
                        [
                            "Arverne Expansion",
                            17
                        ]
                    ],
                    "longest_values": [
                        [
                            "Marcy Houses Renovate 492 Marcy into a Community C",
                            50
                        ],
                        [
                            "Louis Lefkowitz Building Energy Efficiency Upgrade",
                            50
                        ],
                        [
                            "DCAS - Energy Conservation at Manhattan Supreme Ct",
                            50
                        ],
                        [
                            "DCAS - Energy Conserv. at Bx Family & Criminal Ct.",
                            50
                        ],
                        [
                            "SPRINGFIELD GDNS FAMILY RESIDENCE: FIRE ALARM UPGR",
                            50
                        ]
                    ],
                    "average_length": 38.10115606936416
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Client Agency",
            "number_non_empty_cells": 346,
            "number_empty_cells": 0,
            "number_distinct_values": 16,
            "frequent_values": [
                "DCAS",
                "Cultural Affairs",
                "Libraries-NYPL",
                "Homeless Services",
                "Libraries-QBPL"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 346,
                    "shortest_values": [
                        [
                            "-",
                            1
                        ],
                        [
                            "-",
                            1
                        ],
                        [
                            "-",
                            1
                        ],
                        [
                            "-",
                            1
                        ],
                        [
                            "-",
                            1
                        ]
                    ],
                    "longest_values": [
                        [
                            "Environmental Protection",
                            24
                        ],
                        [
                            "Environmental Protection",
                            24
                        ],
                        [
                            "Environmental Protection",
                            24
                        ],
                        [
                            "Environmental Protection",
                            24
                        ],
                        [
                            "Environmental Protection",
                            24
                        ]
                    ],
                    "average_length": 11.635838150289016
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Division",
            "number_non_empty_cells": 346,
            "number_empty_cells": 0,
            "number_distinct_values": 1,
            "frequent_values": [
                "Public Buildings"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 346,
                    "shortest_values": [
                        [
                            "Public Buildings",
                            16
                        ],
                        [
                            "Public Buildings",
                            16
                        ],
                        [
                            "Public Buildings",
                            16
                        ],
                        [
                            "Public Buildings",
                            16
                        ],
                        [
                            "Public Buildings",
                            16
                        ]
                    ],
                    "longest_values": [
                        [
                            "Public Buildings",
                            16
                        ],
                        [
                            "Public Buildings",
                            16
                        ],
                        [
                            "Public Buildings",
                            16
                        ],
                        [
                            "Public Buildings",
                            16
                        ],
                        [
                            "Public Buildings",
                            16
                        ]
                    ],
                    "average_length": 16.0
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Phase",
            "number_non_empty_cells": 346,
            "number_empty_cells": 0,
            "number_distinct_values": 9,
            "frequent_values": [
                "Design",
                "Construction",
                "Procurement",
                "Initiation",
                "Development"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 346,
                    "shortest_values": [
                        [
                            "-",
                            1
                        ],
                        [
                            "-",
                            1
                        ],
                        [
                            "-",
                            1
                        ],
                        [
                            "-",
                            1
                        ],
                        [
                            "-",
                            1
                        ]
                    ],
                    "longest_values": [
                        [
                            "Substantially Completed",
                            23
                        ],
                        [
                            "Substantially Completed",
                            23
                        ],
                        [
                            "Substantially Completed",
                            23
                        ],
                        [
                            "Construction",
                            12
                        ],
                        [
                            "Construction",
                            12
                        ]
                    ],
                    "average_length": 9.205202312138729
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Projected Construction Completion ",
            "number_non_empty_cells": 320,
            "number_empty_cells": 26,
            "number_distinct_values": 244,
            "frequent_values": [
                "",
                "08/31/2018",
                "07/15/2019",
                "09/19/2018",
                "12/18/2020"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 320,
                    "max_value": "10/22/2026, 00:00:00",
                    "min_value": "12/31/2015, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Scope",
            "number_non_empty_cells": 346,
            "number_empty_cells": 0,
            "number_distinct_values": 329,
            "frequent_values": [
                "The purpose of the project is to have a Code compliant fire alarm system (meet FDNY AND the State OTDA standards) and protect the multiple clients, staff and the general public in the facility.",
                "Installation of new building wide fire alarm system.",
                "Roof Replacement",
                "The purpose of the project is to upgrade the existing fire alarm system. The current system does not comply with Code and has had numerous OTDA violations related to the fire alarm system. The fire alarm system has not been approved by FDNY",
                "Roof replacement"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 346,
                    "shortest_values": [
                        [
                            "-",
                            1
                        ],
                        [
                            "122CC Millwork",
                            14
                        ],
                        [
                            "Roof Replacement",
                            16
                        ],
                        [
                            "Roof replacement",
                            16
                        ],
                        [
                            "HVAC replacement",
                            16
                        ]
                    ],
                    "longest_values": [
                        [
                            "Tower D BIN: 1089411.  CS Fixed Building will be an Alt 1 to Tower D, so should have the same BIN.Site block/lot:  Block 702, parts of Lots 4 and 10Site address:  545 West 30th Street, NY NY  10001Anticipated construction completion date for the fixed building, phase 1, is Oct 16, 2019. The Culture Shed is a brand new cultural facility (“the Culture Shed facility”) of approximately 199,000 square feet that will be located on West 30th Street in the Eastern Rail Yards at the Hudson Yards. The facility will be a multi-purpose venue. Culture Shed will produce and present a full calendar of events in its architecturally dynamic spaces that include galleries as well as flexible spaces to accommodate a range of performance disciplines.The Culture Shed facility includes a non-moving, fixed building (the “Culture Shed Building”) and a moving, retractable shed (the “Shed”) that may be deployed over the Culture Shed Plaza (“the Plaza”) to the east of the Culture Shed Building to provide additional indoor or covered outdoor space for exhibitions and other programming.Phase 1, “The Project” (the Culture Shed Building) is the subject of this CCG application.  Phases 2 and 3 are not the subject of this CCG application, but are described below to provide a full description of the entire Culture Shed facility and the context for Phase 1.  The overall Culture Shed facility will consist of the following phases:•\tPhase 1:  The Culture Shed Building:  This portion of the facility is referred to as the “fixed building”.  It is an 84,733 square foot, 107 foot tall, seven story structure containing museum-quality exhibition and performance galleries, a café, a roof gallery, circulation, and support spaces. It features expansive column-free floor plates that are suitable for the presentation of exhibitions and a wide range of performance productions and will include all the essential operating infrastructure to produce visual art exhibits, performances, and events.  The Culture Shed will only initiate Phase 1 in concert with the building of the Tower D core and shell where the mechanical, electrical, plumbing, and life safety systems that serve the fixed building reside.  These systems are included in the Phase 1 scope. Phase 1 is “The Project” that is the subject of this CCG application.  Anticipated construction completion date is Oct 16, 2019•\tPhase 2:  The Shed and the Plaza:  The Shed is a 125 foot tall movable structure comprised of 3 sides (north, east,south) and a roof. Its western side is open and is filled by the eastern face of the Culture Shed Building to which it is connected.  In the nested position, the Shed covers the Culture Shed Building (north, east, south, overhead).  In the deployed position, the Shed no longer covers the Culture Shed Building, but is still connected to it at the fixed building’s easternmost façade.   The Plaza is an 18,000 square foot open space directly east of the Culture Shed Building.  When deployed, the Shed covers the Plaza creating a large, tall, and flexible space for a multitude of programming.   When the Shed is not deployed (ie it is nested over the Culture Shed Building), the Plaza will be completely open-air and used for a variety of cultural activities that will be open to the public.  Phase 2 is part of the overall Culture Shed facility, but is not included in “The Project” that is the subject of this CCG application.•\tPhase 3:  Portions of Culture Shed in Tower D and the Podium:  Portions of the Culture Shed facility, primarily back office, service facilities, and mechanical rooms will be located in the residential building currently known as Tower D to be developed by the Eastern Rail Yard (ERY) Developer, Related Properties. Tower D is located on the east side of Eleventh Avenue between West 30th and West 31st Streets, immediately west of and adjacent to the Culture Shed Building.  The portions of the Culture Shed facility within Tower D are easily accessible from the Culture Shed Building as they are co-level, adjacent, and separated only by a structural construction joint.  Portions of the Culture Shed facility, primarily lobbies, restrooms, coffee bar, bookstore, back offices, catering kitchen, loading and service facilities, and mechanical rooms will also be located in the Podium.  The Podium is defined as the area below plaza level, below the Culture Shed Building and the Plaza,that is to be developed by Related Properties.  The portions of the Culture Shed facility within the Podium are easily accessible from the Culture Shed Building above via stairs and elevators.  Culture Shed Inc. is responsible for reimbursing Related Properties for the core and shell construction of the portions of Tower D and the Podium occupied by the Culture Shed facility (foundations, floor and roof structure, slabs,roofing, waterproofing, and curtainwall).  Culture Shed Inc. is responsible for construction and payment for the fit-out of these spaces (interior partitions, finishes, vertical transporation, glazing, etc.) by its own construction manager.  Phase 3 is part of the overall Culture Shed facility, but is not included in “The Project” that is the subject of this CCG application.",
                            5198
                        ],
                        [
                            "The Flea is building a brand new three-theater performing arts complex at 20 Thomas Street, just four blocks south of our current home. The new facility will be home to all our programming and administrative activities, housing three performance spaces, two lobbies, a ground floor box office and concessions area, administrative offices, technical space, dressing rooms, a green room and a small garden. The scope includes enlargement of the existing cellar by excavating approximately two feet below its current floor, incorporating vault space and decking over a rear yard area, raising the roof of the building to a height of 40 feet above street level, permitting the new main stage theater to have a 25-foot high ceiling height, all-new mechanicals and a newly clad, architecturally distinctive façade.Scope to include;Sitework:Includes removal of interior walls, the front façade and the existing roof; and bringing new sanitary and water/fire services to the building.Foundation/Concrete:Includes excavation for and pouring of a new cellar floor; rebuilding the vault; foundation for the cellar extension; decking for the new cellar roof; a utility vault for new electric service; replacement of the existing sidewalk; and a new concrete beam above the current level of the existing western roof line. We have permits from DOT for the sidewalk replacement work.Masonry:Includes the new façade and new perimeter walls above the existing roof line.Metals:Includes new stairs from roof to cellar; a new steel beam at the first floor level; new steel at new stair and elevator openings; new steel framing for support of façade and penthouse structure; structural reinforcement of floors; metal canopy; and stair railings.Millwork/Casework:Includes pantry/green room cabinetry, storage shelving, and dressing room counters.Thermal & Moisture Protection:Includes installation of new membrane roof and fluid applied waterproofing at cellar extension; foundation waterproofing; and spray-on fire-proofing.Exterior Glass:Includes all-new storefront, as well as a new stage door at the Thomas Street entry; new windows between the first floor theater and the garden plaza formed by the roof of the cellar extension; a new window at the second-floor lobby; and all interior doors.Specialties:Consists of purchase and installation of toilet partitions, towel holders, paper holders, mirrors and waste containers in the public bathrooms and dressing rooms throughout the buildings.Conveying Systems:Consists of a new ADA-compliant elevator, relocated from the existing location, with stops at the cellar, first floor, second floor and mezzanine levels.Fire Protection:Includes new sprinkler system for the entire building.HVAC:Work includes all new heating, ventilating and air conditioning systems throughout the building, sized and engineered to meet LEED requirements and to provide acoustic isolation appropriate for the three theaters. Electrical:Includes all conduit; theatrical and power wiring; HVAC equipment power; main switchboard; transformer; and fire alarm system.",
                            3073
                        ],
                        [
                            "BRONX HALL OF JUSTICE POST CONSTRUCTION BID PACKAGE 2-HVAC AIRFLOW ISSUESThis scope includes the installation of a new transfer air fan and associated ductwork with sound attenuation on the inlet and outlet of a fan serving the Judge’s Lounge located at the 7th Floor.  New transfer air ducts are being installed on floors 2, 7 & 8 to assist in the proper function of the return air system. Additional fan coil units are being installed to serve several rooms on the 8th floor & the 7th floor elevator lobby.ENGINATOR EXHAUST HEATThis scope involves a means of venting excessive heat that builds up in a shaft way that houses the enginator exhaust pipe that begins in lower level 2 up and out through the roof of the building. The heat emanates through the shaft way walls into the building.  This will be accomplished by installing a new exhaust fan and a makeup air fan that pumps outside air into the shaft way.CURTAINWALL SHADOW BOX HEAT TRANSFEROriginal design created conditions where curtain wall mullions heated to temperatures in excess of 110 F. This scope of works involves installing new metal stud with sheetrock finishes over interior curtain wall mullions. Affected locations are portions of the 2nd floor east side exposure.WATER PENETRATION THROUGH UNDERGROUND CONDUITSAn existing underground conduit experienced water infiltration which caused those conductors to fail. Those conductors are going to be removed and the conduit abandoned. A new above ground path has been designed for the new feeder.INTERIOR GLASS REPLACEMENTReplace 4 sections of glazing at Stair A and 1 section at Stair B.CONDENSER WATER SYSTEM WITH THREE ROOF TOP DRY COOLERSFurnish and install a complete new A/C condenser cooling glycol system that includes roof top dry coolers and associated piping. This new system will serve chilled water A/C units in IT closets and elevator machine rooms throughout the building.",
                            1908
                        ],
                        [
                            "This City supported project is the renovation of the JALC Rose Theater flooring and upgradesto the equipment systems in the theater. The project will upgrade the flooring on the mezzanineand balcony of Rose Theater to the same level of flooring completed on the orchestra level in aprior City-funded project in 2008. In addition, an audio monitoring system will be purchased toupgrade the current capacity of programming at JALC.The scope consists of:• Concrete prep including paint removal and smoothing/scoring• Metals work including removal and reconfiguring railing footing and banisters toaccommodate stair-nosings and mesquite tile floor• Installation of step lighting at stairway• Millwork - baseboard removal and reinstallation as well as specialty maplebull-nosings on stair treads designed to increase visibility and receive step lights• Mesquite flooring installation and tier riser facings to match Orchestra levelMonitoring System:Additionally, the City funded project will upgrade the sound system in the Rose Theater andAppel Room, JALC's multi-purpose space. Two audio monitoring systems will be purchasedincluding consoles and speakers to integrate with existing audio equipment. Each system iscomposed of a monitor mixing console {VI-6), a local rack which contains the processing enginefor the mixing console, a stage rack which accepts the microphone and instrument inputs, fourmonitor wedges {speakers), and connecting cables to plug it all together.flooring.• Application of penetrating oil and polyurethane finishing• Removal and reinstallation of seating",
                            1578
                        ],
                        [
                            "A Condition Assessment Report dated September 4, 2014 and a Rehabilitation Analysis and Recommendations report dated December 8, 2014 were prepared by The Burns Group and Greeley & Hansen. Also DDC issued a Field Inspection Report dated March 3, 2014. All reports should be reviewed and used as a basis to prepare preliminary and final design. The selected consultant shall utilize the structural scheme partially developed in the December 8, 2014 Greeley & Hansen report which is to provide intermediate columns and footings to reduce the span of the existing W36 members currently spanning over 100 feet. The selected consultant will be required to evaluate/analyze structural elements in accordance with the requirements of the latest DNSY Garage Design Standards for the heaviest fully loaded salt spreader trucks. The building is to be rehabilitated including extensive structural work (demolition and replacement of cellar-level slab and entrance ramp slab, demolition, and replacement of first floor slab, adding intermediate columns and footings, etc.). Total replacement of building systems (electrical, fire protection, plumbing, HVAC including building management system) and architectural renovation of the entire building is required. Remedial options /scopes of work and cost estimates shall be submitted to DSNY for review prior to starting design. After first floor slab and ramp demolition, the existing exposed structural steel shall be inspected, evaluated and repaired/reinforced as required.",
                            1512
                        ]
                    ],
                    "average_length": 234.5028901734104
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Dollar Amount",
            "number_non_empty_cells": 346,
            "number_empty_cells": 0,
            "number_distinct_values": 4,
            "frequent_values": [
                "1M-5M",
                "5M+",
                "0-500k",
                "501k-1M"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 346,
                    "shortest_values": [
                        [
                            "5M+",
                            3
                        ],
                        [
                            "5M+",
                            3
                        ],
                        [
                            "5M+",
                            3
                        ],
                        [
                            "5M+",
                            3
                        ],
                        [
                            "5M+",
                            3
                        ]
                    ],
                    "longest_values": [
                        [
                            "501k-1M",
                            7
                        ],
                        [
                            "501k-1M",
                            7
                        ],
                        [
                            "501k-1M",
                            7
                        ],
                        [
                            "501k-1M",
                            7
                        ],
                        [
                            "501k-1M",
                            7
                        ]
                    ],
                    "average_length": 4.453757225433526
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Status",
            "number_non_empty_cells": 346,
            "number_empty_cells": 0,
            "number_distinct_values": 1,
            "frequent_values": [
                "Active"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 346,
                    "shortest_values": [
                        [
                            "Active",
                            6
                        ],
                        [
                            "Active",
                            6
                        ],
                        [
                            "Active",
                            6
                        ],
                        [
                            "Active",
                            6
                        ],
                        [
                            "Active",
                            6
                        ]
                    ],
                    "longest_values": [
                        [
                            "Active",
                            6
                        ],
                        [
                            "Active",
                            6
                        ],
                        [
                            "Active",
                            6
                        ],
                        [
                            "Active",
                            6
                        ],
                        [
                            "Active",
                            6
                        ]
                    ],
                    "average_length": 6.0
                }
            ],
            "semantic_types": []
        }
    ],
    "key_column_candidates": []
}