{
    "dataset_name": "nntm-ht5m",
    "columns": [
        {
            "column_name": "Grade Band",
            "number_non_empty_cells": 126,
            "number_empty_cells": 0,
            "number_distinct_values": 24,
            "frequent_values": [
                "Elementary School - High School",
                "High School",
                "Middle School, High School",
                "Middle School",
                "Elementary, Middle, and High School"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 126,
                    "shortest_values": [
                        [
                            "3-K",
                            3
                        ],
                        [
                            "Pre-K",
                            5
                        ],
                        [
                            "Pre-K/ 3K",
                            9
                        ],
                        [
                            "High School",
                            11
                        ],
                        [
                            "High School",
                            11
                        ]
                    ],
                    "longest_values": [
                        [
                            "Pre-Kindergarten, Kindergarten, Gifted & Talented",
                            49
                        ],
                        [
                            "3-K, Pre-Kindergarten, Kindergarten",
                            35
                        ],
                        [
                            "Elementary, Middle, and High School",
                            35
                        ],
                        [
                            "Elementary, Middle, and High School",
                            35
                        ],
                        [
                            "Elementary, Middle, and High School",
                            35
                        ]
                    ],
                    "average_length": 24.738095238095237
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Activity",
            "number_non_empty_cells": 126,
            "number_empty_cells": 0,
            "number_distinct_values": 124,
            "frequent_values": [
                "Implemented re-zoning with a focus on diversity",
                "Released diversity plan to facilitate more diverse and inclusive schools and programs",
                "Issued policy statement to facilitate more diverse and inclusive schools and programs",
                "Established School Diversity Advisory Group to support diverse and inclusive schools and programs",
                "Community School District 1 SIPP Grant and Diversity in Admissions Plan established"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 126,
                    "shortest_values": [
                        [
                            "PFLAG Training",
                            14
                        ],
                        [
                            "WNET LGBT Identity PD",
                            21
                        ],
                        [
                            "Cops and Conversation",
                            21
                        ],
                        [
                            "Gender Equity Modules",
                            21
                        ],
                        [
                            "Expansion of Just Say Hi",
                            24
                        ]
                    ],
                    "longest_values": [
                        [
                            "The IB/CRE team will work to fulfill the goals of increasing awareness about implicit bias and of reducing these biases by providing a professional learning series that will set a two-year target to reach 140,000 NYCDOE staff members citywide. Inherent in this training is a focus on culturally responsive practices as an approach to promoting greater systemic equity.",
                            368
                        ],
                        [
                            "Professional learning offered to district 75 pool of Adapted Physical Education teachers to introduce them to newly created resources that support teachers in designing learning experiences to access general curriculum for students with disabilities",
                            249
                        ],
                        [
                            "Professional learning offered to citywide pool of General Education Physical Education teachers to provide developmental and functionally appropriate physical education experiences for students with disabilities",
                            211
                        ],
                        [
                            "Mayor de Blasio and Chancellor Carranza Announce Plan to Immediately Expand Specialized High Schools Discovery Program, and to Eliminate Specialized High Schools Admissions Test Over Three Years",
                            194
                        ],
                        [
                            "Worked with teachers to examine their beliefs and their pedagogy. A personal and professional journey that led to critically conscious examination of instruction, policies and practices.",
                            186
                        ]
                    ],
                    "average_length": 80.2063492063492
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Description",
            "number_non_empty_cells": 126,
            "number_empty_cells": 0,
            "number_distinct_values": 126,
            "frequent_values": [
                "In June 2017, the DOE released Equity and Excellence for All: Diversity in New York City Public Schools. The release of this diversity plan is the next step in the City’s ongoing work to increase school diversity. It represents a critical milestone in the City’s Equity and Excellence for All agenda, and begins to lay out an approach to increasing diversity in the school system. This includes 12 proposals to address policies and practices that pose challenges to school diversity; this report is organized in a way that aligns each activity to one of these proposals.",
                "In June 2017, as part of the diversity plan, the DOE issued a policy statement identifying its commitment to school diversity and belief that all students benefit from diverse and inclusive classrooms. This statement provides a platform for the DOE to implement its vision of Equity and Excellence for all NYC students with a focus on diversity and inclusion.",
                "In June 2017, as part of the diversity plan, the DOE established a School Diversity Advisory Group (SDAG) to make formal policy recommendations to the Mayor and Chancellor. The chairs of the Advisory Group are José Calderón, President of the Hispanic Federation, Maya Wiley, chair of the Civilian Complaint Review Board and Professor of Urban Policy and Management at the New School, Hazel Dukes, President of the NAACP New York State Conference, Amy Hsin, Associate Professor of Sociology at Queens College, and Richard Kahlenberg, Senior Fellow at The Century Foundation. The Advisory Group also includes city government stakeholders, local and national experts on school diversity, parents, advocates, students, and other community leaders. During the 2017-18 school year, the SDAG and its subcommittees have collectively held approximately 30 meetings and one day-long retreat to facilitate research and discussion of a number of key policy areas related to diversity. The SDAG hosted public town halls in every borough across NYC and a youth symposium to collect data from communities on the issues important to them. In December 2018, the SDAG will release a preliminary report and will continue to serve in its capacity into the new year.",
                "In collaboration with the District 1 Community Education Council and the District 1 Community School District Superintendent's Office, the DOE piloted a district-wide diversity in admissions plan for the 2017-18 pre-Kindergarten and Kindergarten admissions cycle (for the entering class of fall 2018). Through the pre-K, kindergarten and Gifted and Talented admissions processes, ELL, STH and students eligible for FRL received priority for 67% of offers.For fall 2018 admissions, seven of the 16 elementary schools in District 1 made offers within their target range – offering 57 to 77 percent of kindergarten seats to students identified as FRL, ELL, and/or STH. This is nearly double the four elementary schools in District 1 whose kindergarten enrollment was within the target range in the 2017-18 school year. Of the nine District 1 elementary schools that are not in the target range for offers, five moved closer to the target range as compared to their 2017-18 enrollment. Additionally, as part of District 1’s Diversity in Admissions priorities, 15 of the 16 elementary schools made kindergarten offers to a percentage of students with disabilities (SWD) near the district average – offering 9 to 29 percent of kindergarten seats to SWD. This progress is supported by the district’s Family Resource Center, which opened in October 2017 and is a one-stop shop for families to learn about and enroll in District 1 schools.",
                "The Department of Education worked with the urban planning and design firm WXY Studio and the D15 community to develop the D15 Diversity Plan over the 2017-18 school year. DOE and WXY worked with community leaders and stakeholders to convene a project Working Group responsible for ensuring an inclusive community process and for incorporating community feedback into a framework and set of recommendations. Three large Public Workshops and one final Community Presentation were held, reaching more than 500 D15 community members. A final set of draft recommendations was presented at a Community Presentation in June. As part of the plan, all District 15 middle schools will use an open admissions method for fall 2019 admissions and prioritize 52% of seats at each schools for students from low-income families, students in temporary housing, and English Language Learners."
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 126,
                    "shortest_values": [
                        [
                            "The DOE distributed resources at NYC Youth Pride.",
                            49
                        ],
                        [
                            "The DOE targets families who did not apply through admissions in English and Spanish.",
                            85
                        ],
                        [
                            "Over 300 educators attended the inaugural Sexuality, Women, and Gender Instructional Equity Conference.",
                            103
                        ],
                        [
                            "Professional development session for 72 staff to learn about incorporating LGBT identity into their classroom.",
                            110
                        ],
                        [
                            "In 2017-18, families continued to have the opportunity to select testing sites that met their accessibility needs.",
                            114
                        ]
                    ],
                    "longest_values": [
                        [
                            "In collaboration with the District 1 Community Education Council and the District 1 Community School District Superintendent's Office, the DOE piloted a district-wide diversity in admissions plan for the 2017-18 pre-Kindergarten and Kindergarten admissions cycle (for the entering class of fall 2018). Through the pre-K, kindergarten and Gifted and Talented admissions processes, ELL, STH and students eligible for FRL received priority for 67% of offers.For fall 2018 admissions, seven of the 16 elementary schools in District 1 made offers within their target range – offering 57 to 77 percent of kindergarten seats to students identified as FRL, ELL, and/or STH. This is nearly double the four elementary schools in District 1 whose kindergarten enrollment was within the target range in the 2017-18 school year. Of the nine District 1 elementary schools that are not in the target range for offers, five moved closer to the target range as compared to their 2017-18 enrollment. Additionally, as part of District 1’s Diversity in Admissions priorities, 15 of the 16 elementary schools made kindergarten offers to a percentage of students with disabilities (SWD) near the district average – offering 9 to 29 percent of kindergarten seats to SWD. This progress is supported by the district’s Family Resource Center, which opened in October 2017 and is a one-stop shop for families to learn about and enroll in District 1 schools.",
                            1430
                        ],
                        [
                            "In June 2018, Mayor de Blasio and Chancellor Carranza  joined parents, educators, advocates and students and announced a new plan to make admissions to New York City’s eight testing Specialized High Schools (SHS) more equitable while maintaining their high standards. The two-part plan includes:  (1) Expanding the Discovery program for disadvantaged students who just miss the SHSAT score required to receive an offer to an SHS. The DOE will begin to expand the Discovery program to 20 percent of seats at each SHS and adjust the eligibility criteria to target students attending high-poverty schools. Based on modeling of current offer patterns, an estimated 16 percent of offers would go to black and Latino students, compared to 9 percent currently. (2) Eliminating the use of the Specialized High Schools Admissions Test (SHSAT) as the sole criterion for admissions over three years. The elimination of the SHSAT would require State legislation. By the end of the elimination, the SHS would use the “University of Texas model,” where seats are reserved for top performers at each New York City middle school. Based on modeling of current offer patterns, 45 percent of offers would go to black and Latino students, compared to 9 percent currently; 62 percent of offers would go to female students, compared to 44 percent currently; and four times more offers would go to Bronx residents.",
                            1391
                        ],
                        [
                            "In June 2017, as part of the diversity plan, the DOE established a School Diversity Advisory Group (SDAG) to make formal policy recommendations to the Mayor and Chancellor. The chairs of the Advisory Group are José Calderón, President of the Hispanic Federation, Maya Wiley, chair of the Civilian Complaint Review Board and Professor of Urban Policy and Management at the New School, Hazel Dukes, President of the NAACP New York State Conference, Amy Hsin, Associate Professor of Sociology at Queens College, and Richard Kahlenberg, Senior Fellow at The Century Foundation. The Advisory Group also includes city government stakeholders, local and national experts on school diversity, parents, advocates, students, and other community leaders. During the 2017-18 school year, the SDAG and its subcommittees have collectively held approximately 30 meetings and one day-long retreat to facilitate research and discussion of a number of key policy areas related to diversity. The SDAG hosted public town halls in every borough across NYC and a youth symposium to collect data from communities on the issues important to them. In December 2018, the SDAG will release a preliminary report and will continue to serve in its capacity into the new year.",
                            1245
                        ],
                        [
                            "Supports and interventions have been put into place to increase awareness of and access to 3K through High School admissions processes for students in temporary housing and their families. These interventions have included transportation provided to admissions events, admissions hubs for students at fairs, trainings for shelter staff, shelter-based workshops, direct outreach to pre-Kindergarten non-applicants and other opportunities for targeted admissions support. In the 2018 admissions cycle, 52 percent of eligible students in shelter applied for Kindergarten, up from 41 the previous year.  74 percent of 5th graders in shelter participated in middle school admissions, compared to 79 percent last year.  98% of shelter students received an offer compared to 95% of all students.     In 2018-19, the DOE has expanded the number of admissions hubs and targeted shelter-based events. We are holding hubs in 38 fairs this year as compared to 24 fairs last year. We held or participated in almost 20 shelter-based events, new for this year.",
                            1045
                        ],
                        [
                            "DREAM-SHSI is an extracurricular program of rigorous coursework designed to assist economically disadvantaged NYC students in preparing for the Specialized High Schools Admissions Test (SHSAT). There are two DREAM programs: the Specialized High School Institute (DREAM-SHSI), which runs from the middle of grade 6 to the fall of grade 8, and the Summer/Fall Intensive, which runs during the summer and fall before students plan to take the SHSAT. In summer 2016, the DOE implemented the Summer/Fall Intensive for the first time, targeting the highest-performing rising 8th graders from underrepresented districts. For summer 2017, the DREAM Summer/Fall Intensive more than doubled, serving about 650 students. 185 students received an offer, up from 113 last year. For summer 2018, the DREAM Intensive program served over 1,000 students. DREAM participants who took the fall 2017 SHSAT comprised 8 percent of Black and Latino testers, but 29 percent of Black and Latino students who received Specialized High School offers.",
                            1023
                        ]
                    ],
                    "average_length": 486.8888888888889
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Category",
            "number_non_empty_cells": 126,
            "number_empty_cells": 0,
            "number_distinct_values": 18,
            "frequent_values": [
                "Fostering Welcoming School Climates for All Students",
                "Equity & Excellence for All",
                "Streamlining and increasing access for families to learn about school options and apply",
                "Improving Efforts to Support Students in Temporary Housing",
                "Planning for Diversity When Opening New Schools and Programs"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 126,
                    "shortest_values": [
                        [
                            "Transition Services",
                            19
                        ],
                        [
                            "Equity & Excellence for All",
                            27
                        ],
                        [
                            "Equity & Excellence for All",
                            27
                        ],
                        [
                            "Equity & Excellence for All",
                            27
                        ],
                        [
                            "Equity & Excellence for All",
                            27
                        ]
                    ],
                    "longest_values": [
                        [
                            "Increasing Participation of Underrepresented Students in STEM and Other Rigorous Courses",
                            88
                        ],
                        [
                            "Increasing Participation of Underrepresented Students in STEM and Other Rigorous Courses",
                            88
                        ],
                        [
                            "Increasing Participation of Underrepresented Students in STEM and Other Rigorous Courses",
                            88
                        ],
                        [
                            "Increasing Participation of Underrepresented Students in STEM and Other Rigorous Courses",
                            88
                        ],
                        [
                            "Increasing Participation of Underrepresented Students in STEM and Other Rigorous Courses",
                            88
                        ]
                    ],
                    "average_length": 51.82539682539682
                }
            ],
            "semantic_types": []
        }
    ],
    "key_column_candidates": []
}