{
    "dataset_name": "rcz9-btkn",
    "columns": [
        {
            "column_name": "Agency Name",
            "number_non_empty_cells": 220,
            "number_empty_cells": 0,
            "number_distinct_values": 36,
            "frequent_values": [
                "Department of Consumer Affairs (DCA)",
                "Department of Transportation (DOT)",
                "Department of Buildings (DOB)",
                "Department of Health and Mental Hygiene (DOHMH)",
                "Department of Youth and Community Development (DYCD)"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 220,
                    "shortest_values": [
                        [
                            "311 *",
                            5
                        ],
                        [
                            "Police Department (NYPD)",
                            24
                        ],
                        [
                            "Police Department (NYPD)",
                            24
                        ],
                        [
                            "Police Department (NYPD)",
                            24
                        ],
                        [
                            "Police Department (NYPD)",
                            24
                        ]
                    ],
                    "longest_values": [
                        [
                            "Financial Information Services Agency (FISA) & Office of Payroll Administration (OPA)",
                            85
                        ],
                        [
                            "Financial Information Services Agency (FISA) & Office of Payroll Administration (OPA)",
                            85
                        ],
                        [
                            "Office of Administrative Tax Appeals (OATA) / (Tax Commission & Tax Appeals Tribunal)",
                            85
                        ],
                        [
                            "Department of Social Services (DSS) - Department of Homeless Services (DHS)",
                            75
                        ],
                        [
                            "Department of Social Services (DSS) - Department of Homeless Services (DHS)",
                            75
                        ]
                    ],
                    "average_length": 39.304545454545455
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Data Set Title",
            "number_non_empty_cells": 218,
            "number_empty_cells": 2,
            "number_distinct_values": 206,
            "frequent_values": [
                "DOB NOW: Safety Elevator Compliance Filings",
                "DOB NOW: Build Elevator Job Filings",
                "DOB Complaints Received",
                "",
                "Subject Matter List"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 218,
                    "shortest_values": [
                        [
                            "AMPS",
                            4
                        ],
                        [
                            "CEMS",
                            4
                        ],
                        [
                            "Arrests",
                            7
                        ],
                        [
                            "GangMenu",
                            8
                        ],
                        [
                            "ICAP File",
                            9
                        ]
                    ],
                    "longest_values": [
                        [
                            "All Equal Employment Opportunity (EEO) complaints and aggregate Bureau of Investigation and Trials (BITS) Data",
                            110
                        ],
                        [
                            "List of Recipients of the RFP for the Installation and Use of Telecommunications Equipment and Facilities",
                            105
                        ],
                        [
                            "Discretionary Contract Registration and Cash Flow Report Fiscal Years 2016-2019",
                            79
                        ],
                        [
                            "Equal Employment Opportunity (EEO) religious accommodation and complaint Data",
                            77
                        ],
                        [
                            "DOB Cellular Antenna Filings, DOB NOW: Build – Job Application Filings",
                            70
                        ]
                    ],
                    "average_length": 32.39449541284404
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Data Set Description",
            "number_non_empty_cells": 214,
            "number_empty_cells": 6,
            "number_distinct_values": 211,
            "frequent_values": [
                "",
                "n/a",
                "This report lists Vendor performance evaluations conducted by MOCS in Fiscal Year 2018.",
                "Application materials regarding a specific application or property",
                "All emails sent or received by the Agency pertaining to a specific matter"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 214,
                    "shortest_values": [
                        [
                            "n/a",
                            3
                        ],
                        [
                            "n/a",
                            3
                        ],
                        [
                            "n/a",
                            3
                        ],
                        [
                            "n/a",
                            3
                        ],
                        [
                            "All boiler data",
                            15
                        ]
                    ],
                    "longest_values": [
                        [
                            "This data set contains information and locations of (E) Designations, including CEQR Environment Requirements (Table 1) and CEQR Restrictive Declarations (Table 2), in Appendix C of the Zoning Resolution. An (E) Designation provides notice of the presence of an environmental requirement pertaining to potential hazardous materials contamination, high ambient noise levels or air emission concerns on a particular tax lot.",
                            422
                        ],
                        [
                            "The New York City Department of Transportation is responsible for keeping the City's streets in good repair. The Agency performs ongoing assessment of New York City streets. Ratings are based on a scale from 1 to 10, and results are grouped in the following categories: Good (%) - ratings of 8 to 10, Fair (%) - ratings of 4 to 7, and Poor (%) - ratings of 1 to 3. This data will allow you to create a map.",
                            406
                        ],
                        [
                            "The Parking Regulations are drawn from DOT’s Sign Information Management System (SIMS) which is used by DOT in managing its inventory of over one million traffic signs in New York City. The database keeps track of the description, location and installation dates for DOT traffic signs. The Locations and Signs datasets need to be used in combination.",
                            350
                        ],
                        [
                            "The information in the City's computer records with respect to open petitions challenging real property tax assessments pursuant to Article 7 of the Real Property Tax Law.  Contains the index number and year the petition was commenced, the name of the petitioner, the name of the attorney for the petitioner and various note of issue codes.",
                            340
                        ],
                        [
                            "The core permit data, including permittee, type of permit, date issued, location. DOT issues over 150 different types of sidewalk and roadway construction permits to utilities, contractors, government agencies and homeowners. Permits cover activities such as street openings, sidewalk construction and installing canopies over sidewalks.",
                            337
                        ]
                    ],
                    "average_length": 90.84579439252336
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Number of FOIL requestThe number of responses to FOIL requests, in the past fiscal year, using data from this dataset.",
            "number_non_empty_cells": 218,
            "number_empty_cells": 2,
            "number_distinct_values": 37,
            "frequent_values": [
                "1",
                "2",
                "3",
                "6",
                "5"
            ],
            "data_type": [
                {
                    "type": "INTEGER",
                    "count": 218,
                    "max_value": 3756,
                    "min_value": 1,
                    "mean": 53.9954128440367,
                    "stddev": 313.18228267383313
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Dataset on Open Data?Is this dataset published on the Open Data portal or listed on the Open Data plan for future publication?",
            "number_non_empty_cells": 218,
            "number_empty_cells": 2,
            "number_distinct_values": 4,
            "frequent_values": [
                "Not on Open Data Plan",
                "Already on Open Data Portal",
                "Scheduled for Future Release",
                ""
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 218,
                    "shortest_values": [
                        [
                            "Not on Open Data Plan",
                            21
                        ],
                        [
                            "Not on Open Data Plan",
                            21
                        ],
                        [
                            "Not on Open Data Plan",
                            21
                        ],
                        [
                            "Not on Open Data Plan",
                            21
                        ],
                        [
                            "Not on Open Data Plan",
                            21
                        ]
                    ],
                    "longest_values": [
                        [
                            "Scheduled for Future Release",
                            28
                        ],
                        [
                            "Scheduled for Future Release",
                            28
                        ],
                        [
                            "Scheduled for Future Release",
                            28
                        ],
                        [
                            "Scheduled for Future Release",
                            28
                        ],
                        [
                            "Scheduled for Future Release",
                            28
                        ]
                    ],
                    "average_length": 24.39908256880734
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Reason not publicIf \"not on open data,\" is there any reason the dataset should not be made public? If not, please add reason (e.g., privacy, security, other)",
            "number_non_empty_cells": 115,
            "number_empty_cells": 105,
            "number_distinct_values": 59,
            "frequent_values": [
                "",
                "There is very limited interest in this data.",
                "Under consideration for Open Data but not part of a current commitment.",
                "Contains PII",
                "This dataset requires further review and documentation prior to publication."
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 115,
                    "shortest_values": [
                        [
                            "Other",
                            5
                        ],
                        [
                            "Privacy.",
                            8
                        ],
                        [
                            "Privacy.",
                            8
                        ],
                        [
                            "Privacy.",
                            8
                        ],
                        [
                            "Contains PII",
                            12
                        ]
                    ],
                    "longest_values": [
                        [
                            "Performance Evaluation reports will not be made public at this time.  As of FY 2018, Performance Evaluations are being conducted in PASSPort, and the previous source of record (VENDEX) has been deprecated.  Matters of governance including the structure of public-facing data, the presentation of current (PASSPort) vs legacy (MOCS) data and retention policies are all under development.  It is expected that the publication of this data will fall outside the 2020 Fiscal Year.",
                            476
                        ],
                        [
                            "Performance Evaluation reports will not be made public at this time.  As of FY 2018, Performance Evaluations are being conducted in PASSPort, and the previous source of record (VENDEX) has been deprecated.  Matters of governance including the structure of public-facing data, the presentation of current (PASSPort) vs legacy (MOCS) data and retention policies are all under development.  It is expected that the publication of this data will fall outside the 2020 Fiscal Year.",
                            476
                        ],
                        [
                            "Complete Entity reports will not be made public at this time.  As of FY 2018, Complete Entity reports are being conducted in PASSPort, and the previous source of record (VENDEX) has been deprecated.  Matters of governance including the structure of public-facing data, the presentation of current (PASSPort) vs legacy (MOCS) data and retention policies are all under development.  It is expected that the publication of this data will fall outside the 2020 Fiscal Year.",
                            469
                        ],
                        [
                            "Caution reports will not be made public at this time.  As of FY 2018, Cautions are being conducted in PASSPort, and the previous source of record (VENDEX) has been deprecated.  Matters of governance including the structure of public-facing data, the presentation of current (PASSPort) vs legacy (MOCS) data and retention policies are all under development.  It is expected that the publication of this data will fall outside the 2019 Fiscal Year.",
                            446
                        ],
                        [
                            "The Hearings Division Cooling Tower dataset contains information from the OATH Hearings Division Case Status Dataset on the Open Data Portal, with the addition of dismissal reasons. Although OATH provides a data feed to DOITT/MODA for the OATH Hearings Division Case Status Dataset nightly which contains dismissal reasons for all cases, the Open Data Portal only reflects dismissal reasons for Health and Consumer cases.",
                            421
                        ]
                    ],
                    "average_length": 98.3913043478261
                }
            ],
            "semantic_types": []
        }
    ],
    "key_column_candidates": []
}