{
    "dataset_name": "tm5c-buy3",
    "columns": [
        {
            "column_name": "Agency",
            "number_non_empty_cells": 407,
            "number_empty_cells": 0,
            "number_distinct_values": 62,
            "frequent_values": [
                "Civilian Complaint Review Board (CCRB)",
                "Taxi and Limousine Commission (TLC)",
                "Department of City Planning (DCP)",
                "Department of Environmental Protection (DEP)",
                "311"
            ],
            "data_type": [
                {
                    "type": "INTEGER",
                    "count": 11,
                    "max_value": 311,
                    "min_value": 311,
                    "mean": 311.0,
                    "stddev": 0.0
                },
                {
                    "type": "TEXT",
                    "count": 396,
                    "shortest_values": [
                        [
                            "Yelp",
                            4
                        ],
                        [
                            "Twilio",
                            6
                        ],
                        [
                            "Embedly",
                            7
                        ],
                        [
                            "Carto DB",
                            8
                        ],
                        [
                            "NYC ACRE",
                            8
                        ]
                    ],
                    "longest_values": [
                        [
                            "Department of Information Technology & Telecommunications (DoITT)",
                            65
                        ],
                        [
                            "Department of Information Technology & Telecommunications (DoITT)",
                            65
                        ],
                        [
                            "Department of Information Technology & Telecommunications (DoITT)",
                            65
                        ],
                        [
                            "Department of Housing Preservation and Development (HPD)",
                            56
                        ],
                        [
                            "Department of Records and Information Services (RECORDS)",
                            56
                        ]
                    ],
                    "average_length": 36.30808080808081
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Dataset Name",
            "number_non_empty_cells": 407,
            "number_empty_cells": 0,
            "number_distinct_values": 398,
            "frequent_values": [
                "Directory of Senior News Services in NYCHA Journal",
                "Demographics and profiles at the Public Use Microdata Area (PUMA) subarea level",
                "Employment Opportunities",
                "CCR Annual Report",
                "Watershed statistics"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 407,
                    "shortest_values": [
                        [
                            "Embedly",
                            7
                        ],
                        [
                            "Revenue",
                            7
                        ],
                        [
                            "Open NY",
                            7
                        ],
                        [
                            "Yelp API",
                            8
                        ],
                        [
                            "Link Test",
                            9
                        ]
                    ],
                    "longest_values": [
                        [
                            "Demographic Projection Report - Enrollment Projections - New York City Public Schools prepared by the Grier Partnership Part B",
                            126
                        ],
                        [
                            "Demographic Projection Report - Enrollment Projections - New York City Public Schools prepared by the Grier Partnership Part C",
                            126
                        ],
                        [
                            "CCRB: Assignment Of Officers Against Whom Allegations Were Substantiated - Organized Crime Control Bureau 2005 - 2009",
                            117
                        ],
                        [
                            "CCRB: Assignment of Officers against Whom Allegations Were Substantiated - Patrol Borough Manhattan North 2005 - 2009",
                            117
                        ],
                        [
                            "CCRB: Assignment of Officers against Whom Allegations Were Substantiated - Patrol Borough Manhattan South 2005 - 2009",
                            117
                        ]
                    ],
                    "average_length": 44.8992628992629
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Reason for Removal",
            "number_non_empty_cells": 406,
            "number_empty_cells": 1,
            "number_distinct_values": 118,
            "frequent_values": [
                "N/A",
                "These are all spreadsheets that are either outdated or repetitive. There is nothing on this list that does not have a comparable document that is staying up.",
                "This data is no longer maintained and has been removed by the Open Data Team in efforts to declutter and improve the qualiity Open Data Asset inventory.",
                "This dataset was scraped from reports or one-time analysis on our website that will not be maintained, and therefore, should not be included on the Open Data portal",
                "311 Service Request from 2010-Present is already contained in this dataset here: https://data.cityofnewyork.us/Social-Services/311-Service-Requests-from-2010-to-Present/erm2-nwe9"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 406,
                    "shortest_values": [
                        [
                            "N/A",
                            3
                        ],
                        [
                            "N/A",
                            3
                        ],
                        [
                            "N/A",
                            3
                        ],
                        [
                            "N/A",
                            3
                        ],
                        [
                            "N/A",
                            3
                        ]
                    ],
                    "longest_values": [
                        [
                            "The NYC DOHMH Division of Disease Control is requesting the temporary removal of the Communicable Disease Surveillance Data module that is currently posted on NYC OpenData Portal. The EpiQuery module from which this dataset’s current and historical crude and age-adjusted rates are manually extracted is updated whenever a new population estimate (denominator) becomes available. For example, when vintage 2016 population estimates become available, EpiQuery updates 2014 and 2015 rates.  As a result, rates change for historical years, creating discrepancies between Open Data and current EpiQuery.  The program requests that the OpenData module remains fully consistent with the EpiQuery module. However, to update the OpenData module would require the team to manually update the OpenData source file for all 10 diseases and all years that are currently listed, which the team currently does not have the bandwidth for. The Agency’s Bureau of Epidemiology Services is currently working to develop a process that would allow for automated data extraction from EpiQuery to the OpenData portal.  Once automated, this will ensure that there are no discrepancies between what is presented on Open Data and EpiQuery. When this process is activated, we will request that the dataset be made available again on OpenData.  In the interim, interested users should visit the Communicable Disease Surveillance Data module on EpiQuery for the most current data: https://a816-healthpsi.nyc.gov/epiquery/CDSS/index.html.",
                            1508
                        ],
                        [
                            "This data can be found in Capital Commitment Plan at the URL: https://data.cityofnewyork.us/City-Government/Capital-Commitment-Plan/2cmn-uidm. In order for a better presentation and management of datasets in open data portal, this dataset is created to replace the dataset of “Capital Commitments—Prel\\Adpt” and the dataset “Capital Commitments—Exec” in open data portal.  All historical data in these two datasets have been merged in this new created dataset.  Going forward from 2018 preliminary budget,  all Capital Commitment Plan datasets will be updated within this new dataset.",
                            584
                        ],
                        [
                            "This data can be found in Capital Commitment Plan at the URL: https://data.cityofnewyork.us/City-Government/Capital-Commitment-Plan/2cmn-uidm. In order for a better presentation and management of datasets in open data portal, this dataset is created to replace the dataset of “Capital Commitments—Prel\\Adpt” and the dataset “Capital Commitments—Exec” in open data portal.  All historical data in these two datasets have been merged in this new created dataset.  Going forward from 2018 preliminary budget,  all Capital Commitment Plan datasets will be updated within this new dataset.",
                            584
                        ],
                        [
                            "This dataset is a duplicate of the dataset directly above and will be archived. This dataset was not created by the Agency. The ODP will be programmed to redirect ODP users, through a link, to the orignal version above. Prior ODP users may have incorporated the link in their own personal data feeds. The title of this data set has recently been changed to OATH Hearings Division Case Status. \"ECB\" no longer exists as an entity that has cases status information.",
                            463
                        ],
                        [
                            "At some point in the last couple of years, we split the above dataset into its two component datasets, “Free Residential at-the-tap Lead and Copper Data” and “Compliance at-the-tap Lead and Copper Data”. The old dataset was supposed to get archived but seeming never did. Please archive the \"Lead At The Tap Results\" dataset. There will be no data loss from this archiving as the data is still contained in the two other datasets.",
                            430
                        ]
                    ],
                    "average_length": 113.92364532019704
                }
            ],
            "semantic_types": []
        }
    ],
    "key_column_candidates": []
}