{
    "dataset_name": "wye7-nyek",
    "columns": [
        {
            "column_name": "Project Name",
            "number_non_empty_cells": 271,
            "number_empty_cells": 0,
            "number_distinct_values": 267,
            "frequent_values": [
                "South Beach Area Streets",
                "Installation of Coastal Storm Mechanical Closure Devices (MCD's) at various locations in Manhattan",
                "Four Retaining Wall in Brooklyn, Bronx, Queens (RWK013, RWX022, RWQ008, RWQ009)",
                "Removal, upgrade and replacement of city owned heating oil tanks",
                "Fordham Station Capacity Improvements / ADA Ramp"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 271,
                    "shortest_values": [
                        [
                            "BEDA002",
                            7
                        ],
                        [
                            "Governor 195",
                            12
                        ],
                        [
                            "Gateway Signs NYS",
                            17
                        ],
                        [
                            "3 Hudson Boulevard",
                            18
                        ],
                        [
                            "gas main relocation",
                            19
                        ]
                    ],
                    "longest_values": [
                        [
                            "Trunk and Distribution Water Mains Replacement in Leonard Street between Driggs Avenue and Maujer Street, AND, Chamber Roof Slab Replacement and Support Columns Rehabilitation at the intersection of Flatbush Ave and Lafayette Ave",
                            229
                        ],
                        [
                            "Construction of Sanitary Sewers and Appurtenances in Richard Ave [etc], Construction of Storm Sewers, BMP, and Appurtenances in Hylan Blvd [etc], and Installation of Distribution Water Main in Hylan Blvd [etc].",
                            210
                        ],
                        [
                            "Landscape Planting on Grand Central Parkway from 82nd to 111th Street for Visual Enhancement of the Corridor and Mitigation Impacts from the Rehabilitation of 94th Street Interchange in Queens County, NYC",
                            204
                        ],
                        [
                            "Mitigation and Restoration Strategies for Habitat and Ecological Sustainability(MARSHES) Pre-Construction Invasive Species Management at the Saw Mill Creek PilotWetland Mitigation Bank",
                            184
                        ],
                        [
                            "Replacement of Seven (7) Hydraulic Elevators at Three Stations, Lexington Avenue Line (IRT) Borough of Manhattan - Elevator #314 Brooklyn Bridge Station at City Hall Park",
                            170
                        ]
                    ],
                    "average_length": 58.845018450184504
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Project Received Date",
            "number_non_empty_cells": 271,
            "number_empty_cells": 0,
            "number_distinct_values": 239,
            "frequent_values": [
                "07/06/2016",
                "09/12/2016",
                "03/07/2017",
                "09/13/2017",
                "10/01/2013"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 271,
                    "max_value": "12/16/2017, 00:00:00",
                    "min_value": "10/20/2003, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Project ID Number OP",
            "number_non_empty_cells": 170,
            "number_empty_cells": 101,
            "number_distinct_values": 165,
            "frequent_values": [
                "",
                "HB107014Q",
                "HWR1132B ",
                "GXHP24-04",
                "HB107008Q"
            ],
            "data_type": [
                {
                    "type": "INTEGER",
                    "count": 1,
                    "max_value": 134994,
                    "min_value": 134994,
                    "mean": 134994.0,
                    "stddev": 0.0
                },
                {
                    "type": "TEXT",
                    "count": 169,
                    "shortest_values": [
                        [
                            "33B",
                            3
                        ],
                        [
                            "n/a",
                            3
                        ],
                        [
                            "X356",
                            4
                        ],
                        [
                            "M279",
                            4
                        ],
                        [
                            "BQI 2",
                            5
                        ]
                    ],
                    "longest_values": [
                        [
                            "14-CN00-DKCGE-008.00, BBLL-22",
                            29
                        ],
                        [
                            "SER002317 BMPs AH-3 AH-4 AH-5",
                            29
                        ],
                        [
                            "X110.27 D263484 BIN 1067099",
                            27
                        ],
                        [
                            "PSC-12-2891, RK-04 Task #59",
                            27
                        ],
                        [
                            "WO186317676 SEC20004T NCM23",
                            27
                        ]
                    ],
                    "average_length": 10.266272189349113
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Project Description/Type",
            "number_non_empty_cells": 271,
            "number_empty_cells": 0,
            "number_distinct_values": 267,
            "frequent_values": [
                "also SE793. Roadway reconstruction with sewer work. Work is close to two greenstreet tree medians and one larger landscaped triangle",
                "Installation of Coastal Storm Mechanical Closure Devices (MCD's) at various locations in Manhattan",
                "Rehab work on four retaining walls: RWK013, RWX022, RWQ008, and RWQ009. Combined under one DDC contract: RWK013.",
                "Removal, upgrade and replacement of city owned heating oil tanks",
                "Railroad Station Improvement"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 271,
                    "shortest_values": [
                        [
                            "TBD",
                            3
                        ],
                        [
                            "Storm Sewers",
                            12
                        ],
                        [
                            "Bridge Repair",
                            13
                        ],
                        [
                            "City Hall Park",
                            14
                        ],
                        [
                            "Soil remediation",
                            16
                        ]
                    ],
                    "longest_values": [
                        [
                            "Con Edison needs to gain access to MH63307 which is located inside Canarsie Park to dewater and then enter the structure to cut and cap (i.e. de-energize and abandon) three electric cables inside. No cables will be pulled from this manhole and no intrusive work is proposed. The proposed plan is to have a tanker truck on the adjacent property (pending access agreement) and run a hose over the fence and into the manhole (this is the shortest distance). The manhole is located in a vegetated portion of the Park. To provide safe access to the manhole, a small path would need to be cleared for the crew and their equipment. Con Edison is requesting authorization to clear a path approximately 3-ft wide to the manhole and around the structure. The duration of the work is approximately 2-3 days",
                            795
                        ],
                        [
                            "As a part of Con Ed’s Overhead Reliability Initiative. Feeder 33R07 has substantial percentages of Paper Impregnated Lead Cable (PILC) and Corrugated Metal Polyethylene Finished (CMPF) type cable along the feeder route. Upon the loss of Feeder 33R07, contingency within the grid is compromised and the mobilization of generators would be required to alleviate any potential overloads or voltage issues.  A total of 2 miles of new aerial cable and 75 pole replacements will be undertaken as a part of the upgrade.  Within the Green Street area, two poles are proposed to be replaced and limited amount of trenching is also required between Pole 20672 and Manholes 7068 and 7067.",
                            677
                        ],
                        [
                            "protection of medians during work next to malls. \"There are islands in the middle of the road that fall under the Greenstreets program, and I think it would be wise to get the construction permit as a contingency plan.  We do not plan to touch these islands at all.  There will be no material stored on or around the islands on this street, I will direct the contractor to barricade each of the islands, and be wary of their outriggers, tires, and equipment.  We should be able to disconnect and re-connect the majority of these services, and those that need to be replaced will be gophered.\"",
                            592
                        ],
                        [
                            "The purpose of this project is to improve safety deficiencies and restore pavement to good condition along the Harlem River Drive from the Metro North Railroad overpass at 133rd Street to 167th Street. The scope of work of this project includes: milling; resurfacing, and pavement marking of the Harlem River Drive mainline, ramps, and asphalt overlayed viaduct; median replacement and upgrade with single slope concrete barrier, median lampposts, and chain link fence; minor ground mounted sign and reference marker replacement; roadside guiderail barrier and appurtenances.",
                            575
                        ],
                        [
                            "The scope of work includes the trenching (approximately 850' long x 7' wide x 7' deep) on the eastern sidewalk of Sedgwick Ave between Fort Independence St and Giles pl, to expose Con Edison's existing electric feeder pipes in service below the sidewalk to perform the needed feeder pipe coating maintenance and pipe repairs necessary for system reliability. As each section of feeder pipe repairs are completed new concrete sidewalk will be installed (8' wide) within the affected sidewalk area replacing the old concrete sidewalk.",
                            532
                        ]
                    ],
                    "average_length": 106.98154981549816
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Impacted Park ID(s)",
            "number_non_empty_cells": 244,
            "number_empty_cells": 27,
            "number_distinct_values": 184,
            "frequent_values": [
                "",
                "Q099",
                "X092",
                "M005",
                "M360"
            ],
            "data_type": [
                {
                    "type": "INTEGER",
                    "count": 1,
                    "max_value": 482,
                    "min_value": 482,
                    "mean": 482.0,
                    "stddev": 0.0
                },
                {
                    "type": "TEXT",
                    "count": 243,
                    "shortest_values": [
                        [
                            "TBD",
                            3
                        ],
                        [
                            "TBD",
                            3
                        ],
                        [
                            "n/a",
                            3
                        ],
                        [
                            "n/a",
                            3
                        ],
                        [
                            "n/a",
                            3
                        ]
                    ],
                    "longest_values": [
                        [
                            "MZ10; MZ66; MZ106; MZ116; MZ117; MZ118; MZ119; MZ125; MZ127; MZ132; MZ270",
                            73
                        ],
                        [
                            "(tbd if impacts): M124; M066; MZ29; MZ312; MZ313; MZ309",
                            55
                        ],
                        [
                            "RZ058A, RZ302, RZ303, RZ305, RZ105, RZ102, R046",
                            47
                        ],
                        [
                            "XZ47, XZ46, X037, XZ256. XZ32, XZ31, X042, X033",
                            47
                        ],
                        [
                            "Melrose New Generation Community Garden",
                            39
                        ]
                    ],
                    "average_length": 6.934156378600823
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Impacted Park Name(s)",
            "number_non_empty_cells": 253,
            "number_empty_cells": 18,
            "number_distinct_values": 200,
            "frequent_values": [
                "",
                "Flushing Meadows Corona Park",
                "Van Cortlandt Park",
                "Riverside Park",
                "The Battery"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 253,
                    "shortest_values": [
                        [
                            "TBD",
                            3
                        ],
                        [
                            "n/a",
                            3
                        ],
                        [
                            "n/a",
                            3
                        ],
                        [
                            "n/a",
                            3
                        ],
                        [
                            "Pier 42",
                            7
                        ]
                    ],
                    "longest_values": [
                        [
                            "Park at Beach 108 Street, American Veterans Memorial Pier; Hallets Cove Playground; Carl Schurz Park; East River Esplanade; and other locations TBD",
                            147
                        ],
                        [
                            "Greenstreets along Jerome Avenue from E 196th to Morris Ave as well as a triangle on Jerome Parkview Terrace, and Morris Avenue",
                            127
                        ],
                        [
                            "Long Pond Park; Greenstreet at Richmond Valley Rd & Amboy Road; Greenstreet at Richmond and Richmond Valley Rd",
                            110
                        ],
                        [
                            "(tbd if impacts): First Park; Gertrude Kelly PG; four greenstreets on 9th Ave between W. 16 St and W. 17 St",
                            107
                        ],
                        [
                            "Theodore Roosevelt Park, Frank D. O'Connor Playground, and other properties to be determined ",
                            93
                        ]
                    ],
                    "average_length": 24.66403162055336
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Address/Intersection",
            "number_non_empty_cells": 177,
            "number_empty_cells": 94,
            "number_distinct_values": 177,
            "frequent_values": [
                "",
                "Norway Ave & McClean Ave",
                "Webster Ave near E. Fordham Road",
                "BQE between Remsen and Clark",
                "155 St & Harlem River Drive"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 177,
                    "shortest_values": [
                        [
                            "37 Ave & 114 St",
                            15
                        ],
                        [
                            "240 St & 53 Ave",
                            15
                        ],
                        [
                            "130 St & 11 Ave",
                            15
                        ],
                        [
                            "Broadway and 157",
                            16
                        ],
                        [
                            "E 60 St and 2nd Av",
                            18
                        ]
                    ],
                    "longest_values": [
                        [
                            "Astor Place from Lafayette St. to 3rd Ave; E. 8th St. from Lafayette St. to 4th Ave; Lafayette St. from Astor Pl. to E. 9th St.; 4th Ave south of e. 9th St. ",
                            157
                        ],
                        [
                            "Cross Bay Blvd over Belt Pkwy, Linden Blvd at S Conduit Ave, Sunrise Hwy over Belt Pkwy, and the Whitelaw Pedestrian Bridge",
                            123
                        ],
                        [
                            "Leonard Street between Driggs Avenue and Maujer Street, AND, intersection of Flatbush Ave and Lafayette Ave",
                            107
                        ],
                        [
                            "BAY ST AND SCHOOL RD, FOREST AV AND VICTORY BLVD, TARGEE ST AND WAVERLY PL, WILLOW RD E AND WYONA AV",
                            100
                        ],
                        [
                            "Schermerhorn St. between 3 Av. and Nevins St., and other locations to be determined. ",
                            85
                        ]
                    ],
                    "average_length": 34.84180790960452
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Borough",
            "number_non_empty_cells": 271,
            "number_empty_cells": 0,
            "number_distinct_values": 16,
            "frequent_values": [
                "Manhattan",
                "Queens",
                "Brooklyn",
                "Bronx",
                "Staten Island"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 271,
                    "shortest_values": [
                        [
                            "Bronx",
                            5
                        ],
                        [
                            "Bronx",
                            5
                        ],
                        [
                            "Bronx",
                            5
                        ],
                        [
                            "Bronx",
                            5
                        ],
                        [
                            "Bronx",
                            5
                        ]
                    ],
                    "longest_values": [
                        [
                            "Bronx;#Brooklyn;#Manhattan;#Queens;#Staten Island",
                            49
                        ],
                        [
                            "Bronx;#Brooklyn;#Manhattan;#Queens;#Staten Island",
                            49
                        ],
                        [
                            "Bronx;#Brooklyn;#Manhattan;#Queens;#Staten Island",
                            49
                        ],
                        [
                            "Bronx;#Brooklyn;#Manhattan;#Queens;#Staten Island",
                            49
                        ],
                        [
                            "Bronx;#Brooklyn;#Queens;#Staten Island",
                            38
                        ]
                    ],
                    "average_length": 9.07749077490775
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Multisite Project? ",
            "number_non_empty_cells": 271,
            "number_empty_cells": 0,
            "number_distinct_values": 3,
            "frequent_values": [
                "Single Site",
                "Multi Site",
                "Multi Borough"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 271,
                    "shortest_values": [
                        [
                            "Multi Site",
                            10
                        ],
                        [
                            "Multi Site",
                            10
                        ],
                        [
                            "Multi Site",
                            10
                        ],
                        [
                            "Multi Site",
                            10
                        ],
                        [
                            "Multi Site",
                            10
                        ]
                    ],
                    "longest_values": [
                        [
                            "Multi Borough",
                            13
                        ],
                        [
                            "Multi Borough",
                            13
                        ],
                        [
                            "Multi Borough",
                            13
                        ],
                        [
                            "Multi Borough",
                            13
                        ],
                        [
                            "Multi Borough",
                            13
                        ]
                    ],
                    "average_length": 11.011070110701107
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Sponsoring Agency/Entity",
            "number_non_empty_cells": 271,
            "number_empty_cells": 0,
            "number_distinct_values": 23,
            "frequent_values": [
                "DDC",
                "SDOT",
                "DEP",
                "CDOT",
                "ConEd"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 271,
                    "shortest_values": [
                        [
                            "DDC",
                            3
                        ],
                        [
                            "DDC",
                            3
                        ],
                        [
                            "DDC",
                            3
                        ],
                        [
                            "SCA",
                            3
                        ],
                        [
                            "DDC",
                            3
                        ]
                    ],
                    "longest_values": [
                        [
                            "Parks - Partner Group",
                            21
                        ],
                        [
                            "Parks - Partner Group",
                            21
                        ],
                        [
                            "Parks - Partner Group",
                            21
                        ],
                        [
                            "Parks - Partner Group",
                            21
                        ],
                        [
                            "Parks - Partner Group",
                            21
                        ]
                    ],
                    "average_length": 6.767527675276753
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Primary Scope of Work",
            "number_non_empty_cells": 123,
            "number_empty_cells": 148,
            "number_distinct_values": 19,
            "frequent_values": [
                "",
                "Sewer/Water Main",
                "Bridge Component Rehabilitation",
                "Utility (gas, electric, telephone)",
                "Roadway Reconstruction"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 123,
                    "shortest_values": [
                        [
                            "Plaza",
                            5
                        ],
                        [
                            "Plaza",
                            5
                        ],
                        [
                            "Plaza",
                            5
                        ],
                        [
                            "Plaza",
                            5
                        ],
                        [
                            "Resiliency",
                            10
                        ]
                    ],
                    "longest_values": [
                        [
                            "Environmental Improvement/Remediation",
                            37
                        ],
                        [
                            "Environmental Improvement/Remediation",
                            37
                        ],
                        [
                            "Environmental Improvement/Remediation",
                            37
                        ],
                        [
                            "Utility (gas, electric, telephone)",
                            34
                        ],
                        [
                            "Utility (gas, electric, telephone)",
                            34
                        ]
                    ],
                    "average_length": 22.260162601626018
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Impacted Parks Division(s)",
            "number_non_empty_cells": 184,
            "number_empty_cells": 87,
            "number_distinct_values": 71,
            "frequent_values": [
                "",
                "Borough Operations;#Borough Forestry",
                "Borough Operations",
                "Borough Forestry",
                "Other"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 184,
                    "shortest_values": [
                        [
                            "Other",
                            5
                        ],
                        [
                            "Other",
                            5
                        ],
                        [
                            "Other",
                            5
                        ],
                        [
                            "Other",
                            5
                        ],
                        [
                            "Other",
                            5
                        ]
                    ],
                    "longest_values": [
                        [
                            "Capital Projects;#Borough Operations;#Revenue/Concession;#Arts & Antiquities;#Legal/MOUs;#Borough Forestry;#Planning and Parklands",
                            130
                        ],
                        [
                            "Borough Horticulture;#Borough Operations;#Central Forestry;#Capital Projects;#CPI Site;#Revenue/Concession;#ADA Accessibility",
                            125
                        ],
                        [
                            "Borough Operations;#Legal/MOUs;#Natural Resources Group (NRG);#ADA Accessibility;#Borough Forestry;#Planning and Parklands",
                            122
                        ],
                        [
                            "CPI Site; Capital Projects;#Environmental Remediation;#Environmental Review (EIS/EAS);#Central Forestry;#Borough Forestry",
                            121
                        ],
                        [
                            "Capital Projects;#Borough Operations;#Revenue/Concession;#Legal/MOUs;#Borough Forestry;#Planning and Parklands;#Other",
                            117
                        ]
                    ],
                    "average_length": 38.983695652173914
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Park Impact Type",
            "number_non_empty_cells": 179,
            "number_empty_cells": 92,
            "number_distinct_values": 52,
            "frequent_values": [
                "",
                "Staging",
                "Other",
                "No Parkland Impact",
                "Sidewalk Closure"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 179,
                    "shortest_values": [
                        [
                            "Other",
                            5
                        ],
                        [
                            "Other",
                            5
                        ],
                        [
                            "Other",
                            5
                        ],
                        [
                            "Other",
                            5
                        ],
                        [
                            "Other",
                            5
                        ]
                    ],
                    "longest_values": [
                        [
                            "Staging;#Excavation;#Partial Park Closure;#Sidewalk Closure;#Park Improvement;#Other",
                            84
                        ],
                        [
                            "Staging;#Excavation;#Partial Park Closure;#Sidewalk Closure;#Park Improvement;#Other",
                            84
                        ],
                        [
                            "Staging;#Excavation;#Partial Park Closure;#Sidewalk Closure;#Park Improvement",
                            77
                        ],
                        [
                            "Staging;#Excavation;#Partial Park Closure;#Sidewalk Closure;#Park Improvement",
                            77
                        ],
                        [
                            "Excavation;#Partial Park Closure;#Sidewalk Closure;#Park Improvement;#Other",
                            75
                        ]
                    ],
                    "average_length": 26.435754189944134
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Contract Value ($)  OP",
            "number_non_empty_cells": 79,
            "number_empty_cells": 192,
            "number_distinct_values": 77,
            "frequent_values": [
                "",
                "8000.00",
                "100000.00",
                "500000.00",
                "25220000.00"
            ],
            "data_type": [
                {
                    "type": "REAL",
                    "count": 79,
                    "max_value": 263720253.0,
                    "min_value": 5000.0,
                    "mean": 21470638.401392404,
                    "stddev": 43515923.893865444
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Current Phase",
            "number_non_empty_cells": 222,
            "number_empty_cells": 49,
            "number_distinct_values": 7,
            "frequent_values": [
                "Construction",
                "Permitting",
                "",
                "Presumed Complete",
                "Conditional-Accepted (Subst. Compl.)"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 222,
                    "shortest_values": [
                        [
                            "Closeout",
                            8
                        ],
                        [
                            "Closeout",
                            8
                        ],
                        [
                            "Permitting",
                            10
                        ],
                        [
                            "Permitting",
                            10
                        ],
                        [
                            "Permitting",
                            10
                        ]
                    ],
                    "longest_values": [
                        [
                            "Conditional-Accepted (Subst. Compl.)",
                            36
                        ],
                        [
                            "Conditional-Accepted (Subst. Compl.)",
                            36
                        ],
                        [
                            "Conditional-Accepted (Subst. Compl.)",
                            36
                        ],
                        [
                            "Conditional-Accepted (Subst. Compl.)",
                            36
                        ],
                        [
                            "Conditional-Accepted (Subst. Compl.)",
                            36
                        ]
                    ],
                    "average_length": 15.324324324324325
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Scoping Initiated/Kick-Off OP",
            "number_non_empty_cells": 2,
            "number_empty_cells": 269,
            "number_distinct_values": 3,
            "frequent_values": [
                "",
                "02/15/2017 12:00:00 AM",
                "06/09/2016 12:00:00 AM"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 2,
                    "max_value": "02/15/2017, 00:00:00",
                    "min_value": "06/09/2016, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Scoping Response Due Date OP",
            "number_non_empty_cells": 0,
            "number_empty_cells": 271,
            "number_distinct_values": 1,
            "frequent_values": [
                ""
            ],
            "data_type": [],
            "semantic_types": []
        },
        {
            "column_name": "Design Consultant OP",
            "number_non_empty_cells": 2,
            "number_empty_cells": 269,
            "number_distinct_values": 3,
            "frequent_values": [
                "",
                "AECOM",
                "Dewberry"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 2,
                    "shortest_values": [
                        [
                            "AECOM",
                            5
                        ],
                        [
                            "Dewberry",
                            8
                        ]
                    ],
                    "longest_values": [
                        [
                            "Dewberry",
                            8
                        ],
                        [
                            "AECOM",
                            5
                        ]
                    ],
                    "average_length": 6.5
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Public Design Commission Approval Required",
            "number_non_empty_cells": 6,
            "number_empty_cells": 265,
            "number_distinct_values": 3,
            "frequent_values": [
                "",
                "No",
                "Yes"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 6,
                    "shortest_values": [
                        [
                            "No",
                            2
                        ],
                        [
                            "No",
                            2
                        ],
                        [
                            "No",
                            2
                        ],
                        [
                            "No",
                            2
                        ],
                        [
                            "Yes",
                            3
                        ]
                    ],
                    "longest_values": [
                        [
                            "Yes",
                            3
                        ],
                        [
                            "Yes",
                            3
                        ],
                        [
                            "No",
                            2
                        ],
                        [
                            "No",
                            2
                        ],
                        [
                            "No",
                            2
                        ]
                    ],
                    "average_length": 2.3333333333333335
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Preliminary Public Design Commission Approval",
            "number_non_empty_cells": 2,
            "number_empty_cells": 269,
            "number_distinct_values": 3,
            "frequent_values": [
                "",
                "08/03/2015 12:00:00 AM",
                "10/15/2010 12:00:00 AM"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 2,
                    "max_value": "08/03/2015, 00:00:00",
                    "min_value": "10/15/2010, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Final Public Design Commission Approval",
            "number_non_empty_cells": 1,
            "number_empty_cells": 270,
            "number_distinct_values": 2,
            "frequent_values": [
                "",
                "08/22/2016 12:00:00 AM"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 1,
                    "max_value": "08/22/2016, 00:00:00",
                    "min_value": "08/22/2016, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Mass Mailing #1 Received Date",
            "number_non_empty_cells": 2,
            "number_empty_cells": 269,
            "number_distinct_values": 3,
            "frequent_values": [
                "",
                "05/19/2017 12:00:00 AM",
                "02/08/2017 12:00:00 AM"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 2,
                    "max_value": "05/19/2017, 00:00:00",
                    "min_value": "02/08/2017, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Mass Mailing #2 Received Date",
            "number_non_empty_cells": 0,
            "number_empty_cells": 271,
            "number_distinct_values": 1,
            "frequent_values": [
                ""
            ],
            "data_type": [],
            "semantic_types": []
        },
        {
            "column_name": "Mass Mailing #3 Received Date",
            "number_non_empty_cells": 1,
            "number_empty_cells": 270,
            "number_distinct_values": 2,
            "frequent_values": [
                "",
                "02/16/2017 12:00:00 AM"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 1,
                    "max_value": "02/16/2017, 00:00:00",
                    "min_value": "02/16/2017, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Design Completion Date OP",
            "number_non_empty_cells": 2,
            "number_empty_cells": 269,
            "number_distinct_values": 3,
            "frequent_values": [
                "",
                "07/28/2014 12:00:00 AM",
                "02/07/2016 12:00:00 AM"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 2,
                    "max_value": "02/07/2016, 00:00:00",
                    "min_value": "07/28/2014, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Construction Manager OP",
            "number_non_empty_cells": 27,
            "number_empty_cells": 244,
            "number_distinct_values": 13,
            "frequent_values": [
                "",
                "EIC",
                "RE",
                "Construction Manager",
                "D&B Eng"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 27,
                    "shortest_values": [
                        [
                            "RE",
                            2
                        ],
                        [
                            "RE",
                            2
                        ],
                        [
                            "RE",
                            2
                        ],
                        [
                            "EIC",
                            3
                        ],
                        [
                            "EIC",
                            3
                        ]
                    ],
                    "longest_values": [
                        [
                            "Resident Project Representative[RE is Terence McCormick]",
                            56
                        ],
                        [
                            "Greenman-Pedersen, Inc.",
                            23
                        ],
                        [
                            "Greenman-Pedersen Inc.",
                            22
                        ],
                        [
                            "Construction Director",
                            21
                        ],
                        [
                            "Construction Manager",
                            20
                        ]
                    ],
                    "average_length": 9.333333333333334
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Construction Manager Company OP",
            "number_non_empty_cells": 7,
            "number_empty_cells": 264,
            "number_distinct_values": 7,
            "frequent_values": [
                "",
                "NYSDOT",
                "D&B Engineers",
                "GPI",
                "STV, Inc."
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 7,
                    "shortest_values": [
                        [
                            "GPI",
                            3
                        ],
                        [
                            "DDC",
                            3
                        ],
                        [
                            "NYSDOT",
                            6
                        ],
                        [
                            "NYSDOT",
                            6
                        ],
                        [
                            "STV, Inc.",
                            9
                        ]
                    ],
                    "longest_values": [
                        [
                            "ARCADIS U.S., Inc. 44 South Broadway, 9th Floor, White Plains, New York 10601",
                            77
                        ],
                        [
                            "D&B Engineers",
                            13
                        ],
                        [
                            "STV, Inc.",
                            9
                        ],
                        [
                            "NYSDOT",
                            6
                        ],
                        [
                            "NYSDOT",
                            6
                        ]
                    ],
                    "average_length": 16.714285714285715
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Construction Kickoff OP",
            "number_non_empty_cells": 9,
            "number_empty_cells": 262,
            "number_distinct_values": 10,
            "frequent_values": [
                "",
                "02/08/2016",
                "04/09/2017",
                "08/22/2017",
                "10/03/2017"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 9,
                    "max_value": "10/03/2017, 00:00:00",
                    "min_value": "06/21/2010, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Expected Construction End Date OP",
            "number_non_empty_cells": 18,
            "number_empty_cells": 253,
            "number_distinct_values": 19,
            "frequent_values": [
                "",
                "03/31/2017",
                "06/06/2018",
                "12/31/2016",
                "08/23/2019"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 18,
                    "max_value": "02/13/2021, 00:00:00",
                    "min_value": "06/19/2013, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Actual Construction End Date OP",
            "number_non_empty_cells": 4,
            "number_empty_cells": 267,
            "number_distinct_values": 5,
            "frequent_values": [
                "",
                "31/03/2016",
                "10/05/2016",
                "13/10/2017",
                "30/10/2017"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 1,
                    "max_value": "10/05/2016, 00:00:00",
                    "min_value": "10/05/2016, 00:00:00"
                },
                {
                    "type": "TEXT",
                    "count": 3,
                    "shortest_values": [
                        [
                            "31/03/2016",
                            10
                        ],
                        [
                            "13/10/2017",
                            10
                        ],
                        [
                            "30/10/2017",
                            10
                        ]
                    ],
                    "longest_values": [
                        [
                            "31/03/2016",
                            10
                        ],
                        [
                            "13/10/2017",
                            10
                        ],
                        [
                            "30/10/2017",
                            10
                        ]
                    ],
                    "average_length": 10.0
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Contractor for Construction Permit Firm Name",
            "number_non_empty_cells": 173,
            "number_empty_cells": 98,
            "number_distinct_values": 151,
            "frequent_values": [
                "",
                "National Grid",
                "River Bend Construction Corp.",
                "NUCO Painting Corp.",
                "Ecco III"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 173,
                    "shortest_values": [
                        [
                            "Tully",
                            5
                        ],
                        [
                            "DeFoe",
                            5
                        ],
                        [
                            "El Sol",
                            6
                        ],
                        [
                            "Row NY",
                            6
                        ],
                        [
                            "El Sol",
                            6
                        ]
                    ],
                    "longest_values": [
                        [
                            "The I T Verdin Company Inc. Canterbury Designs of c/o Steve Kemme",
                            65
                        ],
                        [
                            "Glass Armor of New York, Inc. DBA Empire Environmental Services",
                            63
                        ],
                        [
                            "Glass Armor of New York, Inc. DBAEmpire Environmental Services",
                            62
                        ],
                        [
                            "United States Rowing Association And Row New York, Inc.",
                            55
                        ],
                        [
                            "Ferreira Construction(for the 2017 North portion)",
                            49
                        ]
                    ],
                    "average_length": 23.6878612716763
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Construction Permit Request Received Date",
            "number_non_empty_cells": 98,
            "number_empty_cells": 173,
            "number_distinct_values": 83,
            "frequent_values": [
                "",
                "03/07/2017",
                "05/23/2016",
                "08/25/2016",
                "05/15/2017"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 98,
                    "max_value": "10/13/2017, 00:00:00",
                    "min_value": "12/03/2014, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Construction Permit ID",
            "number_non_empty_cells": 184,
            "number_empty_cells": 87,
            "number_distinct_values": 185,
            "frequent_values": [
                "",
                "X-13-14NF",
                "M-30-16NF",
                "Q005.20161025",
                "B-44-13NF"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 184,
                    "shortest_values": [
                        [
                            "Q-4-12F",
                            7
                        ],
                        [
                            "M.17.12F",
                            8
                        ],
                        [
                            "M-3-13NF",
                            8
                        ],
                        [
                            "X-2-16NF",
                            8
                        ],
                        [
                            "B-5-12NF",
                            8
                        ]
                    ],
                    "longest_values": [
                        [
                            "M-60-15NF; M-61-15NF",
                            20
                        ],
                        [
                            "QZ1039.20170322",
                            15
                        ],
                        [
                            "B223DG.09092016",
                            15
                        ],
                        [
                            "B210W.20160714",
                            14
                        ],
                        [
                            "B113A.20160810",
                            14
                        ]
                    ],
                    "average_length": 12.26086956521739
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Latest Site Visit",
            "number_non_empty_cells": 77,
            "number_empty_cells": 194,
            "number_distinct_values": 71,
            "frequent_values": [
                "",
                "08/22/2017",
                "07/13/2016",
                "09/07/2016",
                "09/14/2017"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 77,
                    "max_value": "11/02/2018, 00:00:00",
                    "min_value": "02/18/2016, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Forestry Permit Status",
            "number_non_empty_cells": 104,
            "number_empty_cells": 167,
            "number_distinct_values": 5,
            "frequent_values": [
                "",
                "Approved",
                "Not Required",
                "Pending",
                "Not Received"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 104,
                    "shortest_values": [
                        [
                            "Pending",
                            7
                        ],
                        [
                            "Pending",
                            7
                        ],
                        [
                            "Pending",
                            7
                        ],
                        [
                            "Pending",
                            7
                        ],
                        [
                            "Pending",
                            7
                        ]
                    ],
                    "longest_values": [
                        [
                            "Not Required",
                            12
                        ],
                        [
                            "Not Required",
                            12
                        ],
                        [
                            "Not Required",
                            12
                        ],
                        [
                            "Not Required",
                            12
                        ],
                        [
                            "Not Required",
                            12
                        ]
                    ],
                    "average_length": 9.375
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Forestry Permit ID Number",
            "number_non_empty_cells": 51,
            "number_empty_cells": 220,
            "number_distinct_values": 51,
            "frequent_values": [
                "",
                "FY16-405",
                "WSP01MF16",
                "QP16-248",
                "WSP17MF16"
            ],
            "data_type": [
                {
                    "type": "INTEGER",
                    "count": 1,
                    "max_value": 21353,
                    "min_value": 21353,
                    "mean": 21353.0,
                    "stddev": 0.0
                },
                {
                    "type": "TEXT",
                    "count": 50,
                    "shortest_values": [
                        [
                            "X17-53",
                            6
                        ],
                        [
                            "I16-001",
                            7
                        ],
                        [
                            "Z16-252",
                            7
                        ],
                        [
                            "Z16-145",
                            7
                        ],
                        [
                            "I16-017",
                            7
                        ]
                    ],
                    "longest_values": [
                        [
                            "I17-018 & 22406",
                            15
                        ],
                        [
                            "WSP130MF17",
                            10
                        ],
                        [
                            "WSP110MF17",
                            10
                        ],
                        [
                            "WSU302MF17",
                            10
                        ],
                        [
                            "WSP01MF16",
                            9
                        ]
                    ],
                    "average_length": 8.12
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Construction Permit Special Conditions",
            "number_non_empty_cells": 67,
            "number_empty_cells": 204,
            "number_distinct_values": 67,
            "frequent_values": [
                "",
                "i.\tDisturbed park areas including sidewalks, pedestrian paths, bike paths, planted areas, etc. must be replaced in kind. ii.\tDecorative pavers must be restored to original state. Any damaged or lost pavers must be replaced to match. iii.\tSidewalk trenching within 50 feet of a tree requires approval from Forestry.iv.\tEquipment installations that require tree pruning also require Forestry Permits. v.\tEquipment should be painted to match pole aesthetics.vi.\tConstruction activities should not restrict park access.vii.\tSafe work zones should be established as necessary to protect users from construction.",
                "see attachment",
                "This is a specuil permit drafted by legal due to the permanent installation of a utility",
                "Contractor to relocate solar powered trash cans as discussed and agreed to at 3/15/16 coordination meetingContractor responsible for any damages to solar powered trash cansAccess to DPR RPZ to be maintained at all times"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 67,
                    "shortest_values": [
                        [
                            "see attachment",
                            14
                        ],
                        [
                            "  also WW10MF16",
                            15
                        ],
                        [
                            "Must replace/protect pergola and path",
                            37
                        ],
                        [
                            "tree work entity is Harder Landscaping",
                            38
                        ],
                        [
                            "Use a type S mortar mix in 1.5 : 1: 4 ratio.",
                            44
                        ]
                    ],
                    "longest_values": [
                        [
                            "  i.\tNew Fence at Pier 2: Following removal of the abandoned Pier 2, and prior to the substantial completion of work under this permit, Permittee will furnish and install new railing to match existing rail, safely and aesthetically closing access to the former pier. (Attachment B shows existing condition and existing rail detail; further construction detail may be available from Parks)ii.\tCoordination of work with Marina Operationsa)\tTo minimize disruption to marina operations, Permittee is reminded of scheduling obligations laid out on Drawing DRG-FB-C1-28, particularly restricting  dates and timing of work in Areas II and III (Appendix E).b)\tParks and DEP have coordinated extensively on the design and scheduling of the permitted work, and expect to continue to coordinate with Permittee, through the DEP engineer, as has been occurring.iii.\tDocumentation and Report of In-Water Removals: Permittee will track and provide to Parks a report, appropriate documentation, of the following operations completed:a)\tVolume of pilings removed (number of pilings with each piling’s length and diameter)b)\tVolume and square footage of walkway removedc)\tVolume of submerged docks, barges, and vessels removediv.\tStockpile Prohibited: No stockpile of materials on land has been requested, nor is permitted, under this agreement.v.\tCoordination with Park eventsa)\tThere can be no deliveries or construction activities on land from August 15, 2017 through September 16, 2017. b)\tThere can be no deliveries or construction activities on land during Mets home games.c)\tNYC Parks reserves the right to add additional blackout dates as necessary.",
                            1639
                        ],
                        [
                            "Permittee must make restitution to NYC Parks/GreenThumb for existing damages prior to beginning of work. Permittee must install protective structures and filter fabroc/netting as necessary to catch all debris and protect the garden from work. Permittee must protect all plant material on the ground before, during and after all work. permittee must replace any and all impacted plants in the work zone of the same variety, or of another type approved by both the garden group and NYC Parks. garden must be cleaned up and the work areas restored to NYC Parks standards. Permittee must provide a replacement plant material for any damaged/destroyed during work, of a type approved by both the garden group and NYC Parks. All proposals for work or replacement materials must be preapporved by GreenThumb. Permittee must enter the work site only with permission and as agreed to by the gardening group. Permittee must coordinate all activities with the gardening group. Any failure to comply with the permit or stipulations is cause for immediate revocation of the permit.",
                            1068
                        ],
                        [
                            "i.\tTimber Rails: Existing timber barrier rail may be temporarily removed and reinstalled if necessary to facilitate the Work. Parks is providing our standard specifications for this item.ii.\tLimit Fence: Where timber rail does not separate work from park property, temporary fence must be placed and maintained between permitted premise and adjacent parkland from before work is begun until work is accepted by Parks.iii.\tFinal Restoration: Unpaved (soil) areas disturbed by the Work are to be restored by preparing and establishing the following seed mix. Parks will accept the Permitted Premises when Work is complete, and restoration work is established. a)\tCustom Restoration Seed Mix to be applied at 75 lb/acre, comprised of•\tone-third Festuca rubra; •\ttwo-ninths Lolium perenne, ‘Fastball RGL’•\ttwo-ninths Lolium perenne, ‘Blackcat II’•\ttwo-ninths Lolium perenne, ‘Confetti III’This composition may be achieved by mixing one part Festuca rubra with two parts Ernst Seeds product ERNMX-149 or equal.",
                            1005
                        ],
                        [
                            "  i.\tThe work area is referenced below as four quadrants, divided north-south by W 135th Street and east-west by the overhead centerline of the Henry Hudson Parkway. Special conditions for each of these areas:a)\tSouthwest quadrant: This area may not be occupied before 8 am or after 230 am. Emergency access to the gas transmission plant on the pier to the west must be maintained at all times.b)\tSoutheast quadrant: Access shall be coordinated with the district supervisor Benjamin Kramer, c: (646) 879-6630ii.\tStaging Area: a staging area measuring forty-five feet by eighteen, for the storage of work vehicles, is permitted to be located in the northeast quadrant, as diagrammed in Attachment B. This area must be entirely outside of the bicycle path.iii.\tThe area below active work is to be closed to the public. When necessary, the bicycle path shall be safely redirected to accommodate work. The path shall never be closed.",
                            929
                        ],
                        [
                            "i.\tNo access to parkland is granted. Permitted Premises are all Greenstreets in the subject boros, and areas of the City right of way adjacent to park lands.ii.\tFor each pole removed or replaced, at least 48 hours in advance of work, Permittee shall send location map, identification code(s), and photos to interagency@parks.nyc.gov.iii.\tPermittee may not bring vehicles onto unpaved surfaces where work may be performed from pavementiv.\tWhere Permittee must bring a vehicle onto an unpaved portion of the right of way to perform the work, a)\tno vegetation clearing is permitted, b)\tweight of vehicle must be dispersed over the ground by maintaining load-bearing mats, plywood, or similar measures below all tires, c)\tno staging, storage or parking is allowed within the dripline of trees.",
                            789
                        ]
                    ],
                    "average_length": 302.65671641791045
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Borough Approval Date",
            "number_non_empty_cells": 78,
            "number_empty_cells": 193,
            "number_distinct_values": 73,
            "frequent_values": [
                "",
                "11/22/2016",
                "05/11/2017",
                "11/09/2016",
                "10/30/2017"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 78,
                    "max_value": "04/25/3016, 00:00:00",
                    "min_value": "12/02/2015, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Permit Issuance Date",
            "number_non_empty_cells": 144,
            "number_empty_cells": 127,
            "number_distinct_values": 117,
            "frequent_values": [
                "",
                "11/15/2016",
                "07/06/2016",
                "09/30/2016",
                "10/21/2016"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 144,
                    "max_value": "10/31/2017, 00:00:00",
                    "min_value": "02/08/2013, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Permit Start Date",
            "number_non_empty_cells": 172,
            "number_empty_cells": 99,
            "number_distinct_values": 132,
            "frequent_values": [
                "",
                "10/24/2016",
                "10/19/2016",
                "06/01/2017",
                "09/27/2016"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 172,
                    "max_value": "12/01/2017, 00:00:00",
                    "min_value": "03/05/2012, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Original Permit Expiration Date",
            "number_non_empty_cells": 174,
            "number_empty_cells": 97,
            "number_distinct_values": 122,
            "frequent_values": [
                "",
                "12/31/2017",
                "05/15/2017",
                "11/30/2016",
                "12/31/2016"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 174,
                    "max_value": "10/23/2019, 00:00:00",
                    "min_value": "12/31/2013, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Latest Permit Extension/Amendment Request Date",
            "number_non_empty_cells": 37,
            "number_empty_cells": 234,
            "number_distinct_values": 38,
            "frequent_values": [
                "",
                "03/14/2016",
                "06/16/2017",
                "09/27/2017",
                "05/12/2017"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 37,
                    "max_value": "10/19/2018, 00:00:00",
                    "min_value": "07/16/2015, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Latest Permit Extension/Amendment Issuance Date",
            "number_non_empty_cells": 41,
            "number_empty_cells": 230,
            "number_distinct_values": 37,
            "frequent_values": [
                "",
                "10/13/2017",
                "03/28/2017",
                "07/11/2017",
                "06/01/2017"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 41,
                    "max_value": "11/22/2017, 00:00:00",
                    "min_value": "01/14/2014, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Latest Permit Expiration Date",
            "number_non_empty_cells": 56,
            "number_empty_cells": 215,
            "number_distinct_values": 48,
            "frequent_values": [
                "",
                "12/31/2017",
                "07/31/2017",
                "10/06/2017",
                "12/30/2016"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 56,
                    "max_value": "10/23/2019, 00:00:00",
                    "min_value": "03/01/2014, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Permit Amendment Content",
            "number_non_empty_cells": 24,
            "number_empty_cells": 247,
            "number_distinct_values": 25,
            "frequent_values": [
                "",
                "2017 May: seperate permit for north area staging issued2017 Feb: Amend to extend work area north 1000' of the Highbridge. Includes special path building and turf paver restoration requirements.Amend to extend work area south 725' to ConEd manhole located slightly north of John T. Brush Stairs Park.",
                "  1. West Side Area added2. dewatering pipe on Lakeview",
                "  Ext 3Ext 2D263048 Work Orders No. 144, 147 & 149 are deemed included.1.C. “Special Conditions” are as follows:i.\tOne location at a time: At any given time, contractor may occupy not more than one of the three permitted work locations in the park.ii.\tNo weekend work: Work is prohibited at all sites during weekends and holidays (existing laydown is permitted).iii.\tProvide Schedule: Three business days in advance of work, provide schedule of work to jonathan.landsman@parks.nyc.gov. You need not wait for an approval of schedule to proceed with work.Ext 11.C. “Special Conditions” are amended as follows:ii.\tOrder of Sites: Pier 66 must be completed first. Following 66, work is to then proceed southward through the piers, with only one location occupied or worked on at a time.iii.\tBlackout Dates: No sites may be occupied in any manner or worked on between September 30 and October 2nd, inclusive.iv.\tDelivery Embargoes: This section is deleted.",
                "Contractor’s proposal for a roadway detour at the Park entrance on the West side of the bridge is granted, as detailed in attached diagrams and with stipulations for landscape protection as detailed in Tree Work Permit WS413MF16•\tAdditional area described above shall be restored with new asphalt paving and grass established"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 24,
                    "shortest_values": [
                        [
                            "  The Battery added to scope. ",
                            30
                        ],
                        [
                            "Staging permit to Defoe is X-12-14NF Defoe Corp 051214",
                            54
                        ],
                        [
                            "  1. West Side Area added2. dewatering pipe on Lakeview",
                            55
                        ],
                        [
                            "Extension held up due to graffiti at construction site. ",
                            56
                        ],
                        [
                            "1/31 - lawn op 700 Victory Blvd SI, lawn restoration needed",
                            59
                        ]
                    ],
                    "longest_values": [
                        [
                            "•\tRevised Scope of work: Access is granted to the Queens Anchorage of the RFK Bridge through Astoria Park (Q004). o\tWork in Astoria Park cannot begin until January 9, 2017, after the conclusion of MulchFest.o\tContractor to submit before/after photos of any operations on the Astoria Park tennis courts. o\tPlywood protection or approved equal to be used in all tennis court operations. o\tStandard tree protection must be installed if inspection access circumvents use of the Astoria Park tennis courts. o\tAn additional NYC Parks Tree Work Permit will be required if any pruning is deemed necessary to the inspection. Details can be found at: https://www.nycgovparks.org/services/forestry/tree-work-permito\tStaging permitted in front of bridge anchorage. o\tContact Brendan Shera and Norman Chan at Brendan.Shera@parks.nyc.gov and Norman.Chan@parks.nyc.gov 48 hours prior to start of work. •\tExtended Duration: Permit No. CNYG.20161104 is hereby extended to the new Expiration date given above.  All other terms and conditions of said permit remain in full force and effect.",
                            1071
                        ],
                        [
                            "  Ext 3Ext 2D263048 Work Orders No. 144, 147 & 149 are deemed included.1.C. “Special Conditions” are as follows:i.\tOne location at a time: At any given time, contractor may occupy not more than one of the three permitted work locations in the park.ii.\tNo weekend work: Work is prohibited at all sites during weekends and holidays (existing laydown is permitted).iii.\tProvide Schedule: Three business days in advance of work, provide schedule of work to jonathan.landsman@parks.nyc.gov. You need not wait for an approval of schedule to proceed with work.Ext 11.C. “Special Conditions” are amended as follows:ii.\tOrder of Sites: Pier 66 must be completed first. Following 66, work is to then proceed southward through the piers, with only one location occupied or worked on at a time.iii.\tBlackout Dates: No sites may be occupied in any manner or worked on between September 30 and October 2nd, inclusive.iv.\tDelivery Embargoes: This section is deleted.",
                            951
                        ],
                        [
                            "  i.\tDisturbed park areas including sidewalks, pedestrian paths, bike paths, planted areas, etc. must be replaced in kind. ii.\tDecorative pavers must be restored to original state. Any damaged or lost pavers must be replaced to match. iii.\tSidewalk trenching within 50 feet of a tree requires approval from Forestry.iv.\tEquipment installations that require tree pruning also require Forestry Permits. v.\tEquipment should be painted to match pole aesthetics.vi.\tConstruction activities should not restrict park access.vii.\tSafe work zones should be established as necessary to protect users from construction.viii.\tPermittee to request the addition of further locations to this permit by contacting interagency@parks.nyc.gov. Work at additional locations not permitted without an amendment to this permit. ",
                            805
                        ],
                        [
                            "  Permit No. B210W.20160714 is hereby extended to the new Expiration date given above.  Permittee cannot mobilize on site without first holding an onsite meeting to discuss staging and operations for the authorized work, or without written authorization from Parks to waive this requirement. Please additionally note that a Parks Capital Project in John J. Carty Park is expected to begin in March of 2018. Should the current schedule for that project hold, there will be no further extensions possible under this permit, other than to perform site restoration work. All other terms and conditions of said permit remain in full force and effect.",
                            645
                        ],
                        [
                            " This amendment includes the portion of the gas main alignment excluded in amendment 1.The gas main alignment will not be installed along the Bronx Kills as previously contemplated. The gas main alignment will follow the original contract drawings.•\tAll disturbed or damaged areas shall be properly restored as follows: 1. All paved surfaces shall be smooth and free of trip hazards. 2. All materials shall be replaced in-kind. From extension issued 4/18/2017, there is a special provision: sodding, seeding, and irrigation must be completed by 10/15/17.",
                            554
                        ]
                    ],
                    "average_length": 298.0833333333333
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Exploratory Permit ID",
            "number_non_empty_cells": 8,
            "number_empty_cells": 263,
            "number_distinct_values": 9,
            "frequent_values": [
                "",
                "M037.20170515",
                "M-29-14NF",
                "X004.E.20160728",
                "B269.20160808"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 8,
                    "shortest_values": [
                        [
                            "M-29-14NF",
                            9
                        ],
                        [
                            "CNYG 3-15NF",
                            11
                        ],
                        [
                            "M037.20170515",
                            13
                        ],
                        [
                            "B269.20160808",
                            13
                        ],
                        [
                            "Q104.20160916",
                            13
                        ]
                    ],
                    "longest_values": [
                        [
                            "M-60-15NF; M-61-15NF",
                            20
                        ],
                        [
                            "X004.E.20160728",
                            15
                        ],
                        [
                            "R148.E.20171006",
                            15
                        ],
                        [
                            "M037.20170515",
                            13
                        ],
                        [
                            "B269.20160808",
                            13
                        ]
                    ],
                    "average_length": 13.625
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Substantial Completion Date OP",
            "number_non_empty_cells": 17,
            "number_empty_cells": 254,
            "number_distinct_values": 18,
            "frequent_values": [
                "",
                "12/04/2015",
                "05/05/2016",
                "04/28/2017",
                "03/31/2016"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 17,
                    "max_value": "10/30/2017, 00:00:00",
                    "min_value": "11/12/2014, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Final Inspection Date",
            "number_non_empty_cells": 12,
            "number_empty_cells": 259,
            "number_distinct_values": 13,
            "frequent_values": [
                "",
                "12/04/2015",
                "04/28/2017",
                "10/17/2017",
                "05/10/2016"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 12,
                    "max_value": "11/21/2017, 00:00:00",
                    "min_value": "12/04/2015, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Latest Inspection Site Visit",
            "number_non_empty_cells": 18,
            "number_empty_cells": 253,
            "number_distinct_values": 19,
            "frequent_values": [
                "",
                "06/05/2016",
                "04/28/2017",
                "07/07/2017",
                "10/17/2017"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 18,
                    "max_value": "11/21/2017, 00:00:00",
                    "min_value": "05/10/2016, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Punchlist Generated",
            "number_non_empty_cells": 17,
            "number_empty_cells": 254,
            "number_distinct_values": 18,
            "frequent_values": [
                "",
                "05/05/2016",
                "04/28/2017",
                "03/31/2016",
                "08/28/2017"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 17,
                    "max_value": "10/11/2017, 00:00:00",
                    "min_value": "08/07/2014, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Conditional Letter issued",
            "number_non_empty_cells": 14,
            "number_empty_cells": 257,
            "number_distinct_values": 15,
            "frequent_values": [
                "",
                "06/20/2016",
                "05/02/2017",
                "03/31/2016",
                "01/15/2015"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 14,
                    "max_value": "11/27/2017, 00:00:00",
                    "min_value": "01/15/2015, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Final Acceptance of Park by Borough",
            "number_non_empty_cells": 9,
            "number_empty_cells": 262,
            "number_distinct_values": 10,
            "frequent_values": [
                "",
                "06/06/2017 12:00:00 AM",
                "06/02/2016 12:00:00 AM",
                "11/16/2016 12:00:00 AM",
                "04/27/2017 12:00:00 AM"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 9,
                    "max_value": "11/13/2017, 00:00:00",
                    "min_value": "06/02/2016, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Final Acceptance Letter Date",
            "number_non_empty_cells": 10,
            "number_empty_cells": 261,
            "number_distinct_values": 11,
            "frequent_values": [
                "",
                "03/29/2016 12:00:00 AM",
                "07/01/2016 12:00:00 AM",
                "07/11/2016 12:00:00 AM",
                "11/04/2016 12:00:00 AM"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 10,
                    "max_value": "11/27/2017, 00:00:00",
                    "min_value": "03/29/2016, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Created",
            "number_non_empty_cells": 271,
            "number_empty_cells": 0,
            "number_distinct_values": 159,
            "frequent_values": [
                "11/09/2017",
                "03/14/2017",
                "09/07/2016",
                "05/03/2017",
                "06/09/2017"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 271,
                    "max_value": "11/16/2017, 00:00:00",
                    "min_value": "03/29/2016, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Modified",
            "number_non_empty_cells": 271,
            "number_empty_cells": 0,
            "number_distinct_values": 12,
            "frequent_values": [
                "11/07/2017",
                "11/09/2017",
                "11/16/2017",
                "11/08/2017",
                "11/13/2017"
            ],
            "data_type": [
                {
                    "type": "DATE/TIME",
                    "count": 271,
                    "max_value": "11/28/2017, 00:00:00",
                    "min_value": "11/07/2017, 00:00:00"
                }
            ],
            "semantic_types": []
        },
        {
            "column_name": "Coordinates",
            "number_non_empty_cells": 87,
            "number_empty_cells": 184,
            "number_distinct_values": 88,
            "frequent_values": [
                "",
                "40.695843, -73.998101",
                "40.828021, -73.934955",
                "40.680024, -73.784590",
                "40.711041, -73.980484"
            ],
            "data_type": [
                {
                    "type": "TEXT",
                    "count": 87,
                    "shortest_values": [
                        [
                            "40.767 -73.884",
                            14
                        ],
                        [
                            "40.822 -73.958",
                            14
                        ],
                        [
                            "40.878 -73.870",
                            14
                        ],
                        [
                            "40.761 -73.855",
                            14
                        ],
                        [
                            "40.720 -73.980",
                            14
                        ]
                    ],
                    "longest_values": [
                        [
                            "40.775738, -73.767134; 40.716386, -73.728942",
                            44
                        ],
                        [
                            "(40.61187172450284, -74.03173953294754)",
                            39
                        ],
                        [
                            "40.75551111324965, -74.0010617673397",
                            36
                        ],
                        [
                            "40.72984470000001,-73.96076849999997",
                            36
                        ],
                        [
                            "40.69355056929209,-73.77995998254846",
                            36
                        ]
                    ],
                    "average_length": 21.057471264367816
                }
            ],
            "semantic_types": []
        }
    ],
    "key_column_candidates": []
}