{
    "dataset_name": "63us-eqtq",
    "columns": [
        {
            "column_name": "Request",
            "number_non_empty_cells": 1287,
            "number_empty_cells": 20,
            "number_distinct_values": 1265,
            "frequent_values": [
                "Dataset of tax lots that are part of a Zoning Lot Development Agreement (ZLDA). The dataset should label lots with updated BBL numbers, differentiate receiving sites from transferring sites, provide document ID of the ZLDA, and disclose amount of development rights transferred.",
                "tlc -",
                "Hello Sir,I am unable to get parking data in newyork city through apis. I used multiple apis as listed below1. Weekly Traffic2. Weekend Traffic3. Traffic Special Alerts4. Street Construction - Citywide Arterials Schedule5. Street Construction - Bronx Schedule6. Street Construction - Brooklyn Schedule7. Street Construction - Manhattan Schedule8. Street Construction - Queens Schedule9. Street Construction - Staten Island Schedule10. Street Construction - Concrete Schedule11. Street Construction - Sidewalk Inspection Schedule12. Street Changes13. Parking Reminders14. Parking Locations15. Parking Signs16. CityWide Low Bridges Listing17. All Truck Routes18. Thru Truck Routes19. Local Truck Routes20. Bicycle Racks21. NYC Cycle Map22. Bicycle Shelters23. Traffic Link Speeds24. Traffic Speeds25. DOT News - Combined Methodbut none of above api gives us proper response as we deserved,  we want parking api which provides parking spot along with parking status as available, booked and will available soon. parking time according to day wise. please suggest us which api will provides us parking detail. if there are any premium api please provide us link so we can get that premium also.Thanks & Regards",
                "I am looking for data on all subway maintenance performed between 2004 and 2012. I will need to know how long the maintenance went on for, which line/stops were affected, whether the subway was running during the maintenance, and what caused the maintenance to take place (eg signal system update, track work, etc).",
                "311 -"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1287,
                    "shortest_values": [
                        "HIV -",
                        "tlc -",
                        "shl -",
                        "DOB -",
                        "311 -"
                    ],
                    "longest_values": [
                        "Indices to NYC vital records (i.e. birth index, death index, etc.) - I was to make a formal request for these datasets here, as a follow-up up to a Twitter and e-mail conversation I had with her recently.  I am requesting that the city publish its vital records indices online as open data.Please note that this is not a request for any actual certificate information, which of course have strict privacy rules, but merely the indices to the basic data.  These data sets, which are held by the New York City Department of Health, have been previously published in other (older) forms, although all are incomplete.  For example, the city birth index from 1881-1965 is available as microfilm images at Family History Libraries across the world, and the city death index through 1982 or 1983 is available in a tiny number of libraries in printed book form.Agreeing that the indices are public data, the New York State (not city) Department of Health has recently begun adding their State death index data to their Socrata portal for the years 1957-1962.  It would be nice to see the city follow suit.Here are the data sets that would be helpful:1) Index of all births reported in the city of New York, 1881 (or as early as data is available) through 2012 (or as recently as data is available)  Fields in this dataset should include, at a minimum:- first name- surname- gender- date of birth (or year, if date is unavailable)- borough of birth- certificate number2) Index of all deaths reported in the city of New York, 1881 (or as early as data is available) through 2012 (or as recently as data is available)  Fields in this dataset should include, at a minimum:- first name- surname- gender- date of death (or year, if date is unavailable)- borough of death- certificate number3) Index of all marriages reported in the city of New York, 1881 (or as early as data is available) through 2012 (or as recently as data is available)  Fields in this dataset should include, at a minimum:- first name of bride (or spouse #1)- surname of bride (or spouse #1)- gender of of bride (or spouse #1)- date of birth (or year, if date is unavailable) of bride (or spouse #1)- first name of groom (or spouse #2)- surname of groom (or spouse #2)- gender of of groom (or spouse #2)- date of birth (or year, if date is unavailable) of groom (or spouse #2)- date of marriage (or date of issuance of marriage license)- borough where marriage took place- certificate number4) Index of all domestic partnerships reported in the city of New York, 1997 through 2012 (or as recently as data is available)  Fields in this dataset should include, at a minimum:- first name of partner #1- surname of partner #1- gender of of partner #1- date of birth (or year, if date is unavailable) of partner #1- first name of partner #2- surname of partner #2- gender of of partner #2- date of birth (or year, if date is unavailable) of partner #2- date of issuance of partnership certificate- borough of residence of the partners- certificate numberFor the index to divorce decrees and/or certificates, you will probably have to direct this request to each individual borough in the city, to their courts, not to the city's Department of Health:5) Index of all divorces reported in the city of New York, 1881 (or as early as data is available) through 2012 (or as recently as data is available)  Fields in this dataset should include, at a minimum:- first name of bride (or spouse #1)- surname of bride (or spouse #1)- gender of of bride (or spouse #1)- date of birth (or year, if date is unavailable) of bride (or spouse #1)- first name of groom (or spouse #2)- surname of groom (or spouse #2)- gender of of groom (or spouse #2)- date of birth (or year, if date is unavailable) of groom (or spouse #2)- date of divorce decree or certificate- borough where divorce took place- certificate number or decree numberI anticipate that the NYC Department of Health may try to claim to you that these indices are private or protected data, but as I mentioned in my initial request e-mails, this is clearly not the case.  The certificates are private, yes, but the indices are not private, are not copyrighted, and have been published in other forms previously.Please let me know if there is any other information you'd like me to provide regarding this request.  Thanks.",
                        "I'd like for NYC to open the Public Access Defibrillation registry, which is held by the Fire Department of New York and/or New York City Department of Health and Mental Hygiene in coordination with NYC's Regional Emergency Medical Services Council (NYC REMSCO).Context and details:There are various programs in New York City & New York State eitherencouraging or requiring buildings/businesses/locations to have automated external defibrillators (AEDs) available for public use. New York state law & NYC law applies; also see NYC local law 20 - mandated, and New York City Administrative Code §  17-188.Per the New York State Department of Health advisory on Public Access Defibrillation at  https://www.health.ny.gov/professionals/ems/policy/09-03.htm , each regional emergency medical services council holds a PAD registry. In New York City, that is NYC REMSCO http://www.nycremsco.org/bcls.asp?intCategoryID=10&intArticleID=329 . The REMSCO shares this with 911 operators, who, in case of cardiac arrest, can advise callers if there's a PAD at the address they're calling from.The last publicly published map of PAD locations in New York City was in 2006 http://www.nyc.gov/html/records/pdf/govpub/2498reportonlocallaw20july2006final.pdf . Per that report, NYC REMSCO has \"an online registration system intended to facilitate registration, reduce paperwork, and improve the scope and accuracy of future reporting to City Council\", and this was developed in coordination with New York City Department of Health and Mental Hygiene (DOHMH).The Fire Department of NY advertises a Be 911 apphttp://www1.nyc.gov/site/fdny/about/resources/mobile-applications/fdny-be-911-life-saver-app.page which accesses NYC's PAD registry and tells the user of 3 AEDs near the user's location. Thus we know that this dataset is available, machine-readable, and regularly updated, and that at least part of the stewardship of this dataset is through the Fire Department.Per NYC REMSCO's \"Elements of a Successful and Compliant PAD Program\" http://www.nycremsco.org/images/articlesserver/01-Elements%20of%20a%20Successful%20and%20Compliant%20PAD%20Program.pdf , the PAD registry includes data from the following forms:* Notice of Intent to Provide Public Access Defibrillation* PAD Provider Information Form* Collaborative Agreement* Quality Assurance Report",
                        "I'm looking for 2 sets of data that were suppose to be available according to the City Council's FY19 Terms and Conditions (https://council.nyc.gov/budget/wp-content/uploads/sites/54/2018/06/FY19-Terms-and-Conditions-FINAL.pdf) (page 5)DATA SET (1) Data regarding \"As a condition of the funds in unit of appropriation number 406, the Department of Education shallsubmit to the Council, no later than January 31, 2019, a report which shall list each building leasedby a charter school for which the charter school is paid a lease subsidy by the Department. The reportshall include, for each building: 1) the names of the charter school and charter operator; 2) theaddress; 3) the start and end dates of the lease, 4) the annual cost of the lease; 5) the monthly leasepayment from the Department; 6) the total lease payments from the Department to date, and 7)projected total lease payments from the Department.\"DATA SET (2) \"As a condition of the funds in unit of appropriation number 436, the Department of Education shallsubmit a semi-annual report to the Council regarding charter matching projects, including a list ofall charter matching projects and the amount spent on each project. The semi-annual report shall besubmitted as follows: the first report shall be submitted no later than January 15, 2019 and shall coverthe period beginning July 1, 2018 and ending December 31, 2018. The second report shall besubmitted no later than July 15, 2019 and shall cover the period beginning January 1, 2019 andending June 30, 2019\"(3) Also - not related to FY19 terms and conditions - any data regarding Charter matching funds for FY 17 and later. Thank you!",
                        "Zinc deficiency induces apoptosis via mitochondrial p53- and caspase-dependent pathways in human neuronal precursor cells - Previous studies have shown that zinc deficiency leads to apoptosis of neuronal precursor cells in vivoand in vitro. In addition to the role of p53 as a nuclear transcription factor in zinc deficient culturedhuman neuronal precursors (NT-2), we have now identified the translocation of phosphorylated p53 tothe mitochondria and p53-dependent increases in the pro-apoptotic mitochondrial protein BAX leadingto a loss of mitochondrial membrane potential as demonstrated by a 25% decrease in JC-1 red:greenfluorescence ratio. Disruption of mitochondrial membrane integrity was accompanied by efflux of theapoptosis inducing factor (AIF) from the mitochondria and translocation to the nucleus with a significantincrease in reactive oxygen species (ROS) after 24 h of zinc deficiency. Measurement of caspase cleavage,mRNA, and treatment with caspase inhibitors revealed the involvement of caspases 2, 3, 6, and 7 inzinc deficiency-mediated apoptosis. Down-stream targets of caspase activation, including the nuclearstructure protein lamin and polyADP ribose polymerase (PARP), which participates in DNA repair, werealso cleaved. Transfection with a dominant-negative p53 construct and use of the p53 inhibitor, pifithrin-è‰¶ï½¨, established that these alterations were largely dependent on p53. Together these data identify a cascadeof events involving mitochondrial p53 as well as p53-dependent caspase-mediated mechanisms leadingto apoptosis during zinc deficiency.",
                        "hope this email finds you in a great space today. I am writing today to ask for your support in obtaining information on Supportive housing within the Bedford Stuyvesant Brooklyn area.Presently, I am conducting research on the impacts of Supportive housing within our community. The comprehensive  approach to Creating stabilize housing for those transition to society and those displaced are amazing. Consequently, I found your site and organization as an expert within the field. If possible, can you share any reports that outline and speak to the questions raised below: A)  How many Supportive Housing units exist in Brooklyn and Bed-Sty?**    Currently trying to obtain dataset from open data      Looking to identify the ratio of supportive housing in our district to other districts  and boroughs. B) what is the operating and projected budget for this initiative? ***  C) Are there any future plans of expansion?D) Are there any alternative plans to supportive housing and its  impacts ?E) Are there any reports highlighting the Social and Economic impacts made to communities from these developments ?E) Are there any datasets that support the findings?   I have researched tons of reports; however, nothing can trump going to the direct source.  I would like to reference and correlate my data using NYC OPENDATA.com portal.  https://opendata.cityofnewyork.us/data/If possible,  can you share any reports supporting thepoints above? Anything you can give me would be helpful. Whatever you have will be fine.Sincerely, OR"
                    ],
                    "average_length": 208.97746697746697
                }
            ]
        },
        {
            "column_name": "What question are you trying to answer with this data?",
            "number_non_empty_cells": 886,
            "number_empty_cells": 421,
            "number_distinct_values": 865,
            "frequent_values": [
                "I am attempting to estimate the causal link between noise pollution and crime. There is a small but growing literature on how factors from the built environment can affect people's propensity for violence. I plan to use a difference-in-differences approach to isolate noise from elevated subways in New York.",
                "If reports of graffiti have risen or fallen within the past five years and in what areas of the city.",
                "Where are the most drug arrests occurring in our community (Harlem/East Harlem) and how do they compare to other neighborhoods in the city.",
                "I am a unit owner in the building and I'm trying to understand the overall tax position of my unit.",
                "I am trying to answer the following two questions. First, does charter school funding policy influence traditional public schools' enrollment and performance? Second, what is the equilibrium effect of funding in the competition between charter and traditional public schools?"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 886,
                    "shortest_values": [
                        "-",
                        ".",
                        "No,",
                        "Help",
                        "\"1-6\""
                    ],
                    "longest_values": [
                        "My name is Morgan Nevins and I am a graduate student at Columbia University's School of Social Work (CSSW). With a small group of my colleagues, we are building our quantitative skills at CSSW in our Advanced Research and Statistics class, with Dr. Eva Haldane, and are looking for secondary data to inform a semester-long research project.  Our project is intended for class purposes only, not for publication.  We would like to investigate access to health care services, especially STI and/or HIV prevention and treatment, for sex workers, but the scope of our project will be defined in detail once we obtain a data set.  While reviewing literature for our research proposal, we came across an article citing data from the Bureau of Correctional Health Services, the NYC Department of Health and Mental Hygiene, published in 2013, entitled \"Female sex workers incarcerated in New York City jails: prevalence of sexually transmitted infections and associated risk behaviors\" (https://www.ncbi.nlm.nih.gov/pubmed/23687128).  This article was helpful in conceptualizing our research question.  We are still looking for a data set that is U.S. focused and were wondering if DOC Health Services or other NYC gov open data might be available and able to help. We appreciate any information you might be able to provide and hope to hear from you soon. Sincerely,Morgan NevinsMaster of International Affairs/Master of Science in Social Work Dual Degree Candidatemnn2116@columbia.edu(603)828-4501",
                        "I am unable to get parking data in newyork city through apis. I used multiple apis as listed below1. Weekly Traffic2. Weekend Traffic3. Traffic Special Alerts4. Street Construction - Citywide Arterials Schedule5. Street Construction - Bronx Schedule6. Street Construction - Brooklyn Schedule7. Street Construction - Manhattan Schedule8. Street Construction - Queens Schedule9. Street Construction - Staten Island Schedule10. Street Construction - Concrete Schedule11. Street Construction - Sidewalk Inspection Schedule12. Street Changes13. Parking Reminders14. Parking Locations15. Parking Signs16. CityWide Low Bridges Listing17. All Truck Routes18. Thru Truck Routes19. Local Truck Routes20. Bicycle Racks21. NYC Cycle Map22. Bicycle Shelters23. Traffic Link Speeds24. Traffic Speeds25. DOT News - Combined Methodbut none of above api gives us proper response as we deserved, we want parking api which provides parking spot along with parking status as available, booked and will available soon. parking time according to day wise. please suggest us which api will provides us parking detail. if there are any premium api please provide us link so we can get that premium also.Thanks & RegardsWhat question are you trying to answer with this data?we want parking api which provides parking spot along with parking status as available, booked and will available soon. parking time according to day wise. please suggest us which api will provides us parking detail",
                        "Data team will get back to you soon!Update: Can't seem to get the reply system to load your response other than through email, so editing here. Thanks for the reply! Great information. Regarding the million BIN question, there are some that exist in PAD Release 17A which are actual \"million\" BINs, or temporary according to the documentation, i.e. BIN 1000000. I'm wondering if there will ever be more than one of those per BBL? Thanks--------------------------------------------Hi, I'm wondering if there's a data set available that provides historical and current buildings along with the addresses that were associated with them at the time. I have the Bytes of the Big Apple data sets such as PAD, PLUTO, and SND, but these seem to only be up-to-date resources. I see that PLUTO has historical data sets, but was not able to locate them for PAD and SND. Are these available? My goal is to put together a database that has a list of all the buildings in NYC, which can be searched by any of their addresses, and also by year built and demolition year.Other questions I have - are buildings ever associated with more than one tax lot? In other words, tax plots X and Y, and part of building A is on plot X and part of building A is on plot Y? Can there be more than one million BIN on a tax plot at any given time?",
                        "1、I want to know the participation rate of pension of NYC's employees, but I have found many websites and there is no result. Can you give me some help? (Note: I am currently working on a paper on public pensions in New York City, which is not very familiar with some of New York City data) of employee pensions in New York City, but I have found many websites and there is no result. Can you give me some help? (Note: I am currently working on a paper on public pensions in New York City, which is not very familiar with some of New York City data)2、“The sources of income you may have for your retirement are often compared to a 3-legged stool: one leg is your pension, the second leg is Social Security, and the third leg is your personal savings.”What is the proportion of pension contributions（the first leg)？Is the second leg an occupational pension?  How to pay?Is the third leg for individuals to buy commercial insurance?  How much?Thank you very much.",
                        "Dear Ms/Mr, hope this e-mail find you well!This is a request under the Freedom of Information Act.I am a PhD student at UIC and we are currently studying housing assistantship waitlist composition. I searched through your website; however, I could not find the 3 important information that are key to our study, please see below:Data Format: \t \t \tPeriod:\tFrom 2001 to 2019\tFrequency:\tMonthly\t\tBreakdown:\tIndication of the type of housing assistantship program applied (i.e. vouchers (Section 8, Public Housing…) Information:\t \tSize of the waiting list (i.e. Number of households on the waiting list)\tFraction of the waiting list considered as having: \t\t- At least one person with disability \t\t- At least one elderly member (+65)\t\t- At least one elderly member (+65) with disabilityWould you have the above information available or something similar to share with us? Thank you beforehand for your consideration of this request.Sincerely,Raissa Dantas"
                    ],
                    "average_length": 148.5959367945824
                }
            ]
        },
        {
            "column_name": "Submission Date",
            "number_non_empty_cells": 1307,
            "number_empty_cells": 0,
            "number_distinct_values": 915,
            "frequent_values": [
                "05/10/2019 12:00:00 AM",
                "11/09/2017 12:00:00 AM",
                "07/19/2018 12:00:00 AM",
                "05/04/2017 12:00:00 AM",
                "04/03/2018 12:00:00 AM"
            ],
            "data_types": [
                {
                    "type": "DATE/TIME",
                    "count": 1307,
                    "max_value": "2019-07-15 00:00:00",
                    "min_value": "2011-10-10 00:00:00"
                }
            ]
        },
        {
            "column_name": "Response",
            "number_non_empty_cells": 1199,
            "number_empty_cells": 108,
            "number_distinct_values": 1054,
            "frequent_values": [
                "To whom it may concern,At this time, we believe that your nominated data set is not maintained by a New York City agency.Some entities may not be covered by NYC open data law. You can find further detail on the law here: http://www1.nyc.gov/site/doitt/initiatives/open-data-law.pageYou can also submit a new nomination with additional detail and specifically named agencies for referral.Thank you,NYC Open Data team",
                "Thank you for your dataset nomination. Your request is being forwarded to the appropriate agency.",
                "This dataset exists within the Department of Buildings (DOB) and we anticipate releasing it on the Open Data Portal when the work type is added to DOB NOW.Best,Department of Buildings (DOB)",
                "To whom it may concern,Based on the information provided we are unable to determine what data you are looking for.  You can find data from the Taxi and Limousine Commission (TLC) at the following link.  https://data.cityofnewyork.us/data?agency=Taxi+and+Limousine+Commission+%28TLC%29&cat=&type=&browseSearch=&scope=You can also submit a new nomination with additional detail and specifically named agencies for referral.Thank you,NYC Open Data team",
                "Please use the Freedom of Information Law Request (FOIL) Form to make a data request - https://www1.nyc.gov/assets/nycha/downloads/pdf/FOIL.FAQ.pdf"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1199,
                    "shortest_values": [
                        "Duplicate inquiry closed out.",
                        "Thank you R, for your suggestion.",
                        "NYC Department of Health and Mental Hygiene",
                        "This data can be aggregated to any geography using GIS.",
                        "*Nomination request closed, due to user unresponsiveness*"
                    ],
                    "longest_values": [
                        "Hello,The data you've requested can be found here:https://data.cityofnewyork.us/Transportation/Parki...Your question regarding the relationship of location and signs can be found in the metadata attached in the section called \"About this Dataset\"As a reminder, you can always find the list of datasets maintained by the Department of Transportation here: https://data.cityofnewyork.us/browse?Dataset-Infor...- DOT Open Data---------------------------------Original Response:Hello, We would like to request you that can you guys help us in nycdot.info website. We are going through the files which you have used in the website “locations” and “signs”. We are developing a mobile application where we would like to use the details which are shown on the nycdot website. Can you please let us know how the two files are related and how can we retrieve the parking details from both the files. We would like to know the relationship between both the files and how the files are used to show the parking restrictions. Because both files are connected by the Status-Order Number and Boro code. But how it’s used in the depicting the parking restrictions we can’t find it. I would like to request you that can you please help us in the API. We are developing an application for one of our client. The application will showcase the users to view the parking restrictions in New York. The users will be able to view the parking status on the app like your nycdot.info website.Hello, We would like to request you that can you guys help us in nycdot.info website. We are going through the files which you have used in the website “locations” and “signs”. We are developing a mobile application where we would like to use the details which are shown on the nycdot website. Can you please let us know how the two files are related and how can we retrieve the parking details from both the files. We would like to know the relationship between both the files and how the files are used to show the parking restrictions. Because both files are connected by the Status-Order Number and Boro code. But how it’s used in the depicting the parking restrictions we can’t find it. I would like to request you that can you please help us in the API. We are developing an application for one of our client. The application will showcase the users to view the parking restrictions in New York. The users will be able to view the parking status on the app like your nycdot.info website.NOTE: To respond to this inquiry, you must edit your original submission by opening the following link and selecting \"Edit Response\": https://nyc-moda.forms.fm/nyc-open-data-team-help-desk/responses/dB0uP3VrU5Po",
                        "The local law defines data as final versions of statistical or factual information (1) in alphanumeric form reflected in a list, table, graph, chart or other non-narrative form, that can be digitally transmitted or processed; and (2) regularly created or maintained by or on behalf of and owned by an agency that records a measurement, transaction, or determination related to the mission of an agency.  Such term shall not include information provided to an agency by other governmental entities, nor shall it include image files, such as designs, drawings, maps, photos, or scanned copies of original documents, provided that it shall include statistical or factual information about such image files and shall include geographic information system data.  The Zoning Resolution is a set of regulations - it is not a data set.  To try to distill zoning regulations into a table or even a series of tables is overly reductive and not an accurate representation of the law.  The table that you refer to that is available from DCPs website is an extract from the Zoning Handbook, last published in 2011.  While the Handbook is a helpful guide, it is just that, and there's a context for its utility. DCP does not regularly create or maintain such tables, and data, per the definition, is required to be regularly created or maintained and excludes image files and copies of original documents.  We will likely have to update the Handbook tables in the near future, since the Zoning for Quality and Affordability zoning text amendment was adopted by the City Council on March 22nd and represents one of the most comprehensive changes to the ZR in decades.  That said, we would not update them on a regular basis going forward to reflect every nuance of zoning that changes.  That is why referring people to the ZR itself is the \"safest\" and most accurate thing to do.  We don't disagree that these tables are useful and helpful, but we do not believe they belong in Open Data. While they represent the framework of zoning, we do not want to overemphasize or mischaracterize their utility.  Moreover, there are various tables within the Zoning Resolution, and we would not want to confuse the public with additional tables that look like the legal tables but which are not.",
                        "Hi ,I would not suggest aggregating and dividing any census information into arbitrary districts or geometries. You would end up splitting census tracts and then would have to estimate how to reassign split population to each new cube. For example, if one of your cubes splits a census tract by 80% and that tract has 10,000 people - you would most likely assign 80% (8,000 people) to that cube, but in reality, only 2,000 people might actually live in that split up portion.I would suggest using City Planning's Neighborhood Tabulation Area's (NTAs). NTAs are small geographic areas that were created by the New York City Department of City Planning, using whole census tracts from the 2010 Census as building blocks. Each NTA’s boundaries are consistent with Public Use Microdata Areas (PUMAs), approximations of New York City's Community Districts developed for use with the Census Bureau's Public Use Microdata Samples (PUMS). You could then divide population by NTA without splitting census tracts and the data will virtually align to Community Districts (with slight variance).Data Access:NTA boundaries: https://data.cityofnewyork.us/City-Government/Neig...Census Demographics at NTA level: https://data.cityofnewyork.us/City-Government/Cens...Demographic Profiles by PUMA boundaries: https://data.cityofnewyork.us/City-Government/Demo...PUMA boundaries: https://data.cityofnewyork.us/Housing-Development/...For land use information use MapPLUTO:https://www1.nyc.gov/site/planning/data-maps/open-...The lots can be split up by NTA and re-aggregated to get percentage of uses in each NTA.Use the Land Use field. To find out the meaning of each Land Use value use the the PLUTO data dictionary (page 21):https://www1.nyc.gov/assets/planning/download/pdf/...Thank you,- Department of City Planning",
                        "Hi ,At this time, we believe that your requested dataset is not maintained by a New York City agency.This may be due to the fact that some organizations that operate in the City of New York may not fall under the purview of the NYC open data law. You can find further detail on the law here:http://www1.nyc.gov/site/doitt/initiatives/open-da...Furthermore, there are no official neighborhood boundaries, since neighborhoods are not defined by the City (i.e. nothing says Chelsea ends at 23rd st, etc). The closest dataset available to a neighborhood is the Neighborhood Tabulation Areas (NTAs). This is the full description of NTAs: Geographic files of Neighborhood Tabulation Areas (NTAs) as created by the New York City Department of City Planning, using whole census tracts from the 2010 Census as building blocks. These aggregations of census tracts are subsets of New York City's 55 Public Use Microdata Areas (PUMAs). Primarily due to these constraints, NTA boundaries and their associated names may not definitively represent historical or traditional neighborhoods.Available here: https://data.cityofnewyork.us/City-Government/Neighborhood-Tabulation-Areas/cpf4-rkhqSee also, neighborhood name points for map label display purposes only: https://data.cityofnewyork.us/City-Government/Neighborhood-Names-GIS/99bc-9p23Since you are specifically looking for homeowner associations and subdivisions within SI, you may also want to query the Owner Name field in the MapPLUTO dataset - which is a dataset of all tax parcels in NYC with additional attribute information added. You can access that file here:https://www1.nyc.gov/site/planning/data-maps/open-...Thank you,- Department of City Planning",
                        "Hi , Unfortunately, I do not think you can reliably identify homeowners vs renters using the Multiple Dwelling Registration data. It is not uncommon, for example, for a landlord owning a 4 unit (or larger) building to personally reside in that building while the other units are rental. That same landlord may register the building as owned by \"Jane Smith\" or owned by \"123 Park St LLC\" -- the registration information doesn't reveal homeowner/rental status. As you probably know, coop and condo buildings make up a large part of NYC's housing stock. It's very common for condo and coop buildings to contain renters in addition to homeowners. All of that said, the best proxy for this information that I’m aware of is through the NYC Dept. of Finance data. Citywide building data can be downloaded here: https://www1.nyc.gov/site/finance/taxes/property-assessments.page Building classification codes provide approximate data for rental vs. owned. There is no official guide on this, but what I can tell you is that, broadly speaking, building classes that start with “A” or “B” are small 1 or 2 family dwellings which may be owner occupied and/or rented. Building classes that start with “C” or “D” are rentals or co-ops, depending upon if the specific description for each contains the word co-op/cooperative. And classes that start with “R” are condo. https://www1.nyc.gov/assets/finance/jump/hlpbldgcode.htmlBut again, buildings that with a co-op or condo building class may contain individual units that are being rented out at any given point in time - it's very common in my experience. I hope this is helpful.NYC Housing Preservation & Development (HPD)"
                    ],
                    "average_length": 350.0550458715596
                }
            ]
        },
        {
            "column_name": "Final Determination Given (Y/N)",
            "number_non_empty_cells": 0,
            "number_empty_cells": 1307,
            "number_distinct_values": 0,
            "frequent_values": [],
            "data_types": []
        }
    ],
    "key_column_candidates": []
}