{
    "dataset_name": "799n-b76v",
    "columns": [
        {
            "column_name": "Business Organization",
            "number_non_empty_cells": 83,
            "number_empty_cells": 0,
            "number_distinct_values": 10,
            "frequent_values": [
                "Cultural Center",
                "Theater",
                "Dance Company",
                "Museum/Gallery",
                "Music Ensemble/Orchestra"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 83,
                    "shortest_values": [
                        "Theater",
                        "Dance Company",
                        "Museum/Gallery",
                        "Cultural Center",
                        "Other (advocacy)"
                    ],
                    "longest_values": [
                        "Other (Film development program)",
                        "Other (Film Distributors)",
                        "Music Ensemble/Orchestra",
                        "ResearchAcademic Center",
                        "Other - Multi Arts"
                    ],
                    "average_length": 14.421686746987952
                }
            ]
        },
        {
            "column_name": "Business Type Other",
            "number_non_empty_cells": 0,
            "number_empty_cells": 83,
            "number_distinct_values": 0,
            "frequent_values": [],
            "data_types": []
        },
        {
            "column_name": "Company Name",
            "number_non_empty_cells": 83,
            "number_empty_cells": 0,
            "number_distinct_values": 83,
            "frequent_values": [
                "Americas Society",
                "Clemente Soto Velez Cultural Center",
                "NY Artists Unlimited, Inc.",
                "El Museo Del Barrio",
                "Hispanic Organization of Latin Actors (HOLA)"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 83,
                    "shortest_values": [
                        "El Puente ",
                        "ABC No Rio",
                        "Teatro TEBA",
                        "PAMAR, Inc.",
                        "Teatro IATI"
                    ],
                    "longest_values": [
                        "Caribbean Cultural Center/African Diaspora Institute",
                        "Mano a Mano:  Mexican Culture Without Borders",
                        "Hispanic Organization of Latin Actors (HOLA)",
                        "Casa De La Herencia Cultural Puertorriquena",
                        "Harbor Conservatory for the Performing Arts"
                    ],
                    "average_length": 26.771084337349397
                }
            ]
        },
        {
            "column_name": "Company Description",
            "number_non_empty_cells": 83,
            "number_empty_cells": 0,
            "number_distinct_values": 83,
            "frequent_values": [
                "LP21 presents the traditional Bomb and Plena from Puerto Rico in venues all over New around the world. They have performed from coast to coast in the US and Canada and have even performed in Russia and Hawaii.  LP21 is also very much involved in education and play nearly everyday throughout the year in one of the many public and parochial school in New York City, New Jersey and Connecticut. We also play colleges and other types of institutions including the non-academic.",
                "Through an integrated program of workshops, productions of works in progress, and mainstage productions, INTAR continues to raise standards of the theater arts.  INTAR brings to the public vital and energetic voices of both promising and accomplished Latino theater professionals, replacing stereotypes while giving expression to the diversity and depth of today's Latino-American community. \n \n \n",
                "Art gallery dedicated to the promotion of outstanding artworks by Latin American artists.",
                "Latin America Parents Association (LAPA) is a not-for-profit organization registered in the State of New York. LAPA is not an adoption agency. It is an all-volunteer organization of families who have adopted or who are in the process of adopting children from Latin America. Our mission is to provide accurate and timely information as well as support before, during, and after the adoption process. ",
                "Arthur Aviles Typical Theatre (AATT) is a Bronx-based contemporary modern dance company committed to carving a permanent niche in the Bronx cultural landscape with a repertory of works that explore life on the margins of Latino and gay cultures, and to bring these works to a local, national and international audience. \n"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 83,
                    "shortest_values": [
                        "Art gallery dedicated to the promotion of outstanding artworks by Latin American artists.",
                        "Empowering people through classes and performances on Capoeira, Brazilian self-defense disguised as dance.",
                        "A musical group expressing the diverse Afro-Caribbean music of New York city: Salsa, Plena, Bomba, Merengue, boogalu and Latin-jazz. ",
                        "A Salsa/Mambo dance company that also teaches classes in salsa and other Latin dances. We also provide music classes, dance socials, and an online store.",
                        "The Center for Puerto Rican Studies is the nation's leading university-based research center devoted to the study of the Puerto Rican experience in the United States."
                    ],
                    "longest_values": [
                        "Since 1970, the Harbor Conservatory for the Performing Arts, a division of Boys and Girls Harbor, Inc., has undertaken an important role in the preservation of AfroCaribbean Latin music. The Conservatory's efforts have revolved around three equally important activities: instruction and development of the next generation of Latin musicians; the amassing of materials which make up the unprecedented 16,000 piece Raices Latin Music Collection; and the production of historical concerts. The Harbor's world-renowned Latin Music program is complemented by equally strong Classical Music, Dance and Drama programs. With a curriculum that ranges from Contemporary Salsa and Latin Jazz to traditional Afro-Caribbean folkloric music, and a faculty of \"who's who in Latin music\" students study a variety of musical forms such as danzon, son, cha cha cha and mambo, as they learn music illustrating different periods and artists in Latin music history. At the Conservatory students enjoy the unique opportunity to learn while playing classic music made popular by artists such as Tito Puente, Celia Cruz, Johnny Pacheco and others. The Conservatory has been a recipient of both the Tito Puente Scholarship Fund and Celia Cruz Foundation.",
                        "DreamYard is committed to helping transform Bronx schools and communities through the power of innovative, project based arts education. Our schools and students are based in the nation's poorest urban county, with one-third of the Bronx's residents living below the poverty line. In response, DreamYard programs are designed to challenge the cyclical systems of inequality and poverty by empowering youth to discover and develop their best possible selves and to locate meaningful paths and ways to engage with their fellow students, schools, families, and communities. As the largest arts education provider in the Bronx, DreamYard critically impacts the social and intellectual growth of thousands of Bronx youth through safe, positive and creatively challenging programs. DreamYard's team of professional artists partner with classroom teachers and community educators to help students learn how to express, write and perform their own stories. Through yearlong programs offered during the school day, after school, on weekends and during the summer, DreamYard supports youth development, enhances life-long learning skills, and promotes creative thinking and expression.",
                        "Bread and Roses is the not-for-profit cultural arm of New York's Health and Human Service Union, 1199/SEIU. Its 220,000 predominantly Latina and African American women members are employed in all job categories in health care institutions throughout the metropolitan area, New Jersey and Florida. Bread and Roses actively strives to depict artistic, cultural and historical themes and issues affecting people from many backgrounds. The New York Times has recognized us as \"the most important cultural project in the labor movement\". Bread and Roses established the only permanent union exhibition space in the nation, Gallery 1199, at the union's New York City headquarters. Because of its diverse constituency of working people, many of whom are immigrants, Bread and Roses is the national leader for collaborative work, with a union, to bring the arts to an enormous group of people largely not reached by traditional arts institutions and programs. ",
                        "Mariachi Tapatio De Alvaro Paulino began in 1983 under the direction of Alvaro Paulino. Born in Puebla, Mexico, Alvaro Paulino studied at Pueblaâ\u0080\u0099s Conservatory with Edmundo Cruz (a professional cornet and trumpet player who his known throughout Mexico). Alvaro began playing the trumpet at age 15 and has continued with his talent and expanded his skills over the years by playing and studying with many well-known mariachis in Mexico, such as Mariachi Metepec, Mariachi Puebla, Mariachi Cocula, Mariachi Los Arrieros, Mariachi Continental, Mariachi Los Caporales, Mariachi Los Cuervos, and many more! Alvaro has also accompanied many great artists such as Vicente Fernandez, Lola Beltran, Miguel Aceves Mejia, Lucha Villa, Gerardo Reyes, Yolanda Del Rio, Pedro Fernandez, Alicia Juarez, Paco Michel, Hermanas Huerta, Emilio Galvez, Leo Dan, Manuel Lopez Ochoa, Placido Domingo, etc.",
                        "Taller Boricua was established in 1970, in New York as a non-profit arts organization. Taller Boricua/Puerto Rican Workshop Inc. has expanded into a multi cultural institution by providing a variety of programs that stimulate the social, cultural and economic development of the community. Our workshops offer artists the opportunity to share ideas and inspirations with colleagues, enhances productivity and collaborations with other non profit organizations, schools, artists, public service providers, private corporations, and the community. The Taller Boricua (translation: workshop Puerto Rican) has evolved into a highly respected community arts organization that continues to be a proactive resource for the promotion of the arts. We have been very successful in attracting the art community to function as an essential nucleus supporting creative means of expression."
                    ],
                    "average_length": 465.3734939759036
                }
            ]
        },
        {
            "column_name": "Organization Location",
            "number_non_empty_cells": 83,
            "number_empty_cells": 0,
            "number_distinct_values": 83,
            "frequent_values": [
                "Americas Society",
                "Alianza Dominicana, Inc.",
                "Bronx Dance Theatre, Inc.",
                "Hunter College",
                "KR3TS"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 83,
                    "shortest_values": [
                        "AHA",
                        "KR3TS",
                        "En Foco",
                        "INTAR 53",
                        "El Puente"
                    ],
                    "longest_values": [
                        "Mano a Mano:  Mexican Culture Without Borders",
                        "Hispanic Organization of Latin Actors (HOLA)",
                        "Casa De La Herencia Cultural Puertorriquena",
                        "Harbor Conservatory for the Performing Arts",
                        "Learning Through an Expanded Arts Program"
                    ],
                    "average_length": 25.27710843373494
                }
            ]
        },
        {
            "column_name": "Street Address",
            "number_non_empty_cells": 83,
            "number_empty_cells": 0,
            "number_distinct_values": 77,
            "frequent_values": [
                "107 Suffolk Street",
                "1680 Lexington Avenue",
                "841 Barretto Street",
                "1738 Hone Avenue",
                "59-61  East 4th Street"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 83,
                    "shortest_values": [
                        "310 Bowery",
                        "2710 Broadway",
                        "611 Broadway ",
                        "4 East 107th ",
                        "1230 5th Ave. "
                    ],
                    "longest_values": [
                        " P.O. Box 572, Coney Island Station",
                        "P.O. Box 2608, Times Square Station",
                        "1040 Grand Concourse at 165th St.",
                        "585 East 187th Street, 2nd Floor",
                        "2410 Amsterdam Avenue, 4th floor"
                    ],
                    "average_length": 19.867469879518072
                }
            ]
        },
        {
            "column_name": "Apt Number",
            "number_non_empty_cells": 33,
            "number_empty_cells": 50,
            "number_distinct_values": 32,
            "frequent_values": [
                "6th Floor",
                "3rd Floor",
                "#403",
                "4th Fl.",
                "#2G"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 33,
                    "shortest_values": [
                        "#2",
                        "#2A",
                        "#2G",
                        "#5B",
                        "#64A"
                    ],
                    "longest_values": [
                        "c/o Saint Athanasius School",
                        "Joan Weill Center for Dance",
                        "Basement North",
                        "Suite 458 ",
                        "Suite 11-J"
                    ],
                    "average_length": 7.575757575757576
                }
            ]
        },
        {
            "column_name": "Borough",
            "number_non_empty_cells": 83,
            "number_empty_cells": 0,
            "number_distinct_values": 6,
            "frequent_values": [
                "Manhattan",
                "Bronx",
                "Brooklyn",
                "Queens",
                "Jackson Heights"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 83,
                    "shortest_values": [
                        "Bronx",
                        "Queens",
                        "Brooklyn",
                        "New York",
                        "Manhattan"
                    ],
                    "longest_values": [
                        "Jackson Heights",
                        "Manhattan",
                        "New York",
                        "Brooklyn",
                        "Queens"
                    ],
                    "average_length": 8.349397590361447
                }
            ]
        },
        {
            "column_name": "Postcode",
            "number_non_empty_cells": 83,
            "number_empty_cells": 0,
            "number_distinct_values": 43,
            "frequent_values": [
                "10029",
                "10019",
                "10002",
                "10036",
                "10009"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 83,
                    "max_value": 11372,
                    "min_value": 10001,
                    "mean": 10255.385542168675,
                    "stddev": 420.5699755917967
                }
            ]
        },
        {
            "column_name": "Business Phone",
            "number_non_empty_cells": 2,
            "number_empty_cells": 81,
            "number_distinct_values": 2,
            "frequent_values": [
                "(212) 688-6862",
                "(718) 236-8689"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 2,
                    "shortest_values": [
                        "(212) 688-6862",
                        "(718) 236-8689"
                    ],
                    "longest_values": [
                        "(718) 236-8689",
                        "(212) 688-6862"
                    ],
                    "average_length": 14.0
                }
            ]
        },
        {
            "column_name": "Contact Name",
            "number_non_empty_cells": 72,
            "number_empty_cells": 11,
            "number_distinct_values": 71,
            "frequent_values": [
                "Eli Alvarado",
                "Angel Gil Orrios",
                "Sharon Gersten Luckman",
                "Luis Mojica",
                "Gloria DeNard"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 72,
                    "shortest_values": [
                        "Tim Lord",
                        "Rome Neal",
                        "Joe Burgos",
                        "Bob Holman",
                        "Ethel Raim"
                    ],
                    "longest_values": [
                        "Julia L. Gutierrez-Rivera",
                        "Sharon Gersten Luckman",
                        "Dr. Anthony De Jesus",
                        "Antonio Sergio Bessa",
                        "Alvaro Paulino, Jr."
                    ],
                    "average_length": 14.402777777777779
                }
            ]
        },
        {
            "column_name": "Contact Title",
            "number_non_empty_cells": 61,
            "number_empty_cells": 22,
            "number_distinct_values": 22,
            "frequent_values": [
                "Executive Director",
                "Artistic Director",
                "Director",
                "President",
                "General Manager"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 61,
                    "shortest_values": [
                        "COO",
                        "CEO",
                        "Owner",
                        "Director",
                        "President"
                    ],
                    "longest_values": [
                        "Director of Audience Development",
                        "Director of External Affairs",
                        "Acting Director of Programs",
                        "Interim Executive Director",
                        "Executive Assistant"
                    ],
                    "average_length": 15.672131147540984
                }
            ]
        },
        {
            "column_name": "Contact Phone",
            "number_non_empty_cells": 80,
            "number_empty_cells": 3,
            "number_distinct_values": 78,
            "frequent_values": [
                "(212) 722-2600",
                "(718) 842-5223",
                "(212) 831-4333",
                "(212) 571-1555",
                "(212) 695-6134"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 80,
                    "shortest_values": [
                        "(212)665-9460",
                        "(718) 588-8807",
                        "(212) 941-4012",
                        "(212) 677-2203",
                        "(718) 236-8689"
                    ],
                    "longest_values": [
                        "(212) 307-7420 ext. 3004",
                        "(212) 427-2244, ext. 572",
                        "(212) 362-6710, ext. 24",
                        "(212) 410-0030 ext 279",
                        "(718) 589-5819 ext. 11"
                    ],
                    "average_length": 14.7125
                }
            ]
        },
        {
            "column_name": "Contact Fax",
            "number_non_empty_cells": 1,
            "number_empty_cells": 82,
            "number_distinct_values": 1,
            "frequent_values": [
                "(212) 688-6862"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1,
                    "shortest_values": [
                        "(212) 688-6862"
                    ],
                    "longest_values": [
                        "(212) 688-6862"
                    ],
                    "average_length": 14.0
                }
            ]
        },
        {
            "column_name": "Location",
            "number_non_empty_cells": 83,
            "number_empty_cells": 0,
            "number_distinct_values": 76,
            "frequent_values": [
                "107 Suffolk Street\nManhattan, NY 10002\n(40.719521874541, -73.985837319549)",
                "841 Barretto Street\nBronx, NY 10474\n(40.817722398112, -73.890438305651)",
                "1738 Hone Avenue\nBronx, NY 10461\n(40.848048638261, -73.854019625354)",
                "59 61 East 4th Street\nManhattan, NY 10003\n(40.731943947555, -73.98887214913)",
                "1680 Lexington Avenue\nManhattan, NY 10029\n(40.791891803823, -73.946535490866)"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 83,
                    "shortest_values": [
                        "7 Bronx\nNY 10464\n(40.875709096797, -73.812297250418)",
                        "340 Brooklyn\nNY 11234\n(40.61636866748, -73.927732249743)",
                        "1169 Manhattan\nNY 10029\n(40.791610720558, -73.944032281065)",
                        "4 107th\nManhattan, NY 10029\n(40.794910278981, -73.950561021411)",
                        "872 Gerard Ave\nBronx, NY 10452\n(40.827708359088, -73.924780330939)"
                    ],
                    "longest_values": [
                        "1040 Grand Concourse at 165th St\nBronx, NY 10456\n(40.830436680009, -73.907765199504)",
                        "570 Fort Washington Avenue\nManhattan, NY 10033\n(40.854178847572, -73.937182541761)",
                        "2608 Times Square Station\nManhattan, NY 10036\n(40.759346827194, -73.989860554421)",
                        "572 Coney Island Station\nBrooklyn, NY 11224\n(40.643372295795, -73.970088161538)",
                        "2410 Amsterdam Avenue\nManhattan, NY 10033\n(40.847155142524, -73.931588758739)"
                    ],
                    "average_length": 70.95180722891567
                }
            ]
        },
        {
            "column_name": "Latitude",
            "number_non_empty_cells": 75,
            "number_empty_cells": 8,
            "number_distinct_values": 64,
            "frequent_values": [
                "40.718943",
                "40.793072",
                "40.848065",
                "40.766839",
                "40.791881"
            ],
            "data_types": [
                {
                    "type": "REAL",
                    "count": 75,
                    "max_value": 40.855797,
                    "min_value": 40.639512,
                    "mean": 40.76777707999999,
                    "stddev": 0.04494338116393664
                }
            ]
        },
        {
            "column_name": "Longitude",
            "number_non_empty_cells": 75,
            "number_empty_cells": 8,
            "number_distinct_values": 65,
            "frequent_values": [
                "-73.986122",
                "-73.951992",
                "-73.890354",
                "-73.990807",
                "-73.854058"
            ],
            "data_types": [
                {
                    "type": "REAL",
                    "count": 75,
                    "max_value": -73.854058,
                    "min_value": -74.014625,
                    "mean": -73.95936780000001,
                    "stddev": 0.0383618037897073
                }
            ]
        },
        {
            "column_name": "Community Board",
            "number_non_empty_cells": 75,
            "number_empty_cells": 8,
            "number_distinct_values": 12,
            "frequent_values": [
                "4",
                "3",
                "11",
                "2",
                "5"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 75,
                    "max_value": 12,
                    "min_value": 1,
                    "mean": 5.506666666666667,
                    "stddev": 3.332159793420611
                }
            ]
        },
        {
            "column_name": "Council District",
            "number_non_empty_cells": 75,
            "number_empty_cells": 8,
            "number_distinct_values": 19,
            "frequent_values": [
                "1",
                "3",
                "8",
                "4",
                "2"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 75,
                    "max_value": 38,
                    "min_value": 1,
                    "mean": 8.226666666666667,
                    "stddev": 8.729373147915924
                }
            ]
        },
        {
            "column_name": "Census Tract",
            "number_non_empty_cells": 75,
            "number_empty_cells": 8,
            "number_distinct_values": 56,
            "frequent_values": [
                "1402",
                "168",
                "93",
                "172",
                "68"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 75,
                    "max_value": 18502,
                    "min_value": 9,
                    "mean": 1598.1066666666666,
                    "stddev": 4072.6867154196325
                }
            ]
        },
        {
            "column_name": "BIN",
            "number_non_empty_cells": 75,
            "number_empty_cells": 8,
            "number_distinct_values": 64,
            "frequent_values": [
                "1004301",
                "1051499",
                "2005939",
                "2044837",
                "1082642"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 75,
                    "max_value": 4437110,
                    "min_value": 1000000,
                    "mean": 1433843.5066666666,
                    "stddev": 794238.3110155688
                }
            ]
        },
        {
            "column_name": "BBL",
            "number_non_empty_cells": 75,
            "number_empty_cells": 8,
            "number_distinct_values": 64,
            "frequent_values": [
                "1003530054",
                "1016100001",
                "2041040001",
                "2027390015",
                "1004600056"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 75,
                    "max_value": 4014527501,
                    "min_value": 1000220017,
                    "mean": 1400733363.24,
                    "stddev": 767152620.3952767
                }
            ]
        },
        {
            "column_name": "NTA",
            "number_non_empty_cells": 75,
            "number_empty_cells": 8,
            "number_distinct_values": 32,
            "frequent_values": [
                "East Harlem South                                                          ",
                "Midtown-Midtown South                                                      ",
                "Lower East Side                                                            ",
                "Clinton                                                                    ",
                "Upper East Side-Carnegie Hill                                              "
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 75,
                    "shortest_values": [
                        "West Concourse                                                             ",
                        "Clinton Hill                                                               ",
                        "Hamilton Heights                                                           ",
                        "North Side-South Side                                                      ",
                        "Central Harlem South                                                       "
                    ],
                    "longest_values": [
                        "East Tremont                                                               ",
                        "Washington Heights North                                                   ",
                        "Chinatown                                                                  ",
                        "Clinton                                                                    ",
                        "East Harlem South                                                          "
                    ],
                    "average_length": 75.0
                }
            ]
        }
    ],
    "key_column_candidates": []
}