{
    "dataset_name": "9ibi-dfnm",
    "columns": [
        {
            "column_name": "PermitID",
            "number_non_empty_cells": 3888,
            "number_empty_cells": 0,
            "number_distinct_values": 3673,
            "frequent_values": [
                "3623",
                "3595",
                "2467",
                "2460",
                "2616"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 3888,
                    "max_value": 7108,
                    "min_value": 2037,
                    "mean": 4730.748456790124,
                    "stddev": 1396.1440529405984
                }
            ]
        },
        {
            "column_name": "StipulationID",
            "number_non_empty_cells": 3888,
            "number_empty_cells": 0,
            "number_distinct_values": 15,
            "frequent_values": [
                "18",
                "20",
                "17",
                "11",
                "9"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 3888,
                    "max_value": 24,
                    "min_value": 4,
                    "mean": 14.593878600823045,
                    "stddev": 5.153850450161358
                }
            ]
        },
        {
            "column_name": "PermitNumber",
            "number_non_empty_cells": 3888,
            "number_empty_cells": 0,
            "number_distinct_values": 3669,
            "frequent_values": [
                "RIWY-2015328-264",
                "XQAD-20141222-1276",
                "X7BE-2014109-944",
                "BDFM-2014828-873",
                "XQAD-20141222-1275"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 3888,
                    "shortest_values": [
                        "U55S-201812-4",
                        "DB8G-201719-9",
                        "TPMJ-201615-8",
                        "DB8G-201719-6",
                        "DB8G-201719-4"
                    ],
                    "longest_values": [
                        "B2GR-20151122-1076",
                        "QGZG-20151211-1136",
                        "QW9G-20141217-1249",
                        "V7G8-20151123-1097",
                        "S93X-20171227-1006"
                    ],
                    "average_length": 16.034465020576132
                }
            ]
        },
        {
            "column_name": "StipulationCode",
            "number_non_empty_cells": 3888,
            "number_empty_cells": 0,
            "number_distinct_values": 15,
            "frequent_values": [
                "AOL type 3 & 4",
                "AOL Lift tp 3&4",
                "New AOL Stip",
                "Long Stip 14-10",
                "Long Stip 2014"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 3888,
                    "shortest_values": [
                        "eng stip",
                        "Bulk Milk",
                        "do not use",
                        "New AOL Stip",
                        "SSP 111kip 5m"
                    ],
                    "longest_values": [
                        "ShortStip 14-15",
                        "ShortStip 14-10",
                        "Lift Axle Stip:",
                        "Long Stip 14-10",
                        "AOL Lift tp 3&4"
                    ],
                    "average_length": 13.723251028806585
                }
            ]
        },
        {
            "column_name": "StipulationDescription",
            "number_non_empty_cells": 3888,
            "number_empty_cells": 0,
            "number_distinct_values": 15,
            "frequent_values": [
                "Please observe, follow and obey all postings, restrictions and Traffic Rules and Regulations along the truck route you traverse/travel during movement and on all NYC and NYS bridges and elevated structures. This permit does absolve the permittee of any responsibility for damage done to NYC and NYS bridges structural integrity due to this move. Note: ***** Annual overweight permitted vehicles need to be legally-sized; legal dimensions not to exceed: 8 ft wide, 13 ft 6 in high and or 35 ft, single, or 55 ft, tractor trailer, long.  ***** NOTE:   This vehicle is not permitted to travel on any movable or posted bridges throughout NYC",
                "Follow obey all postings, restrictions and Traffic Rules and Regs  along truck route you travel and on all NYC & NYS bridges & structures. This permit does absolve the permittee of responsibility for damage done to NYC and NYS bridges structural integrity due to this move. * Annual overweight permitted vehicles need to be legally-sized; dimensions not to exceed: 8 ft wide, 13 ft 6 in high and or 35 ft, single, or 55 ft, tractor trailer, long. Note: Lift axle must be down at all times when traveling on NYC Streets, not having the lift axle down will render this permit null and void. Max gross \"legal\" wt is 34,000 lbs+1,000 lbs per foot wheelbase; the gross \"legal\" wt is not to exceed 80,000lbs - *** This vehicle is not permitted to travel on any movable or posted bridges throughout NYC",
                "Please observe, follow and obey all postings, restrictions and Traffic Rules and Regulations along the truck route you traverse/travel during movement and on all NYC and NYS bridges and elevated structures.  This permit does absolve the permittee of any responsibility for damage done to NYC and NYS bridges structural integrity due to this move. Note: *** Annual overweight permitted vehicles need to be legally-sized; legal dimensions not to exceed: 8 ft wide, 13 ft 6 in high and or 35 ft, single, or 55 ft, tractor trailer, long.",
                "This permit is only approved based on the cranes axle weight and the spacing submitted to NYCDOT on the permit application.  It is the responsibility of Permittee to adjust the standard vehicle axle weight by removing any parts, such as Counter weight, Outrigger beams, etc. to meet the submitted axle weight. The crane is not permitted to travel on any movable or posted bridges throughout NYC. The crane must occupy 2 lanes on bridges. The crane is not permitted on Brooklyn Bridge. The crane is permitted on Outer Roadways on Williamsburg Bridge and not permitted on Inner Roadways; and permitted on Lower Inner Roadways on Queensboro Bridge and not permitted on Lower Outer Roadways and Upper Roadways. It is permitted on Williamsburg Bridge (OR), Queensboro Bridge (LIR) or Manhattan Bridge only when wind velocity is less than 30 MPH. This self-propelled crane must move with speed less than 10 mph, when the crane is on bridges. The crane is permitted only on the lower Roadway on Manhattan Bridge. The crane is not permitted on Upper Roadway.  Any change in the proposed crane weight or configuration on this permit will not be allowed. The crane must follow and obey all posted signs along the route regarding height restrictions, speed, weight, etc. - as well as all NYC Traffic Rules and Regulations. Obtain all necessary permits from other agencies such as Port Authority, NYSDOT, TBTA, etc. as applicable. Permittee is responsible for any repair for damage incurred to the bridges structure and any appurtenances caused by proposed crossing operations. The Crane must be escorted by vehicle weighting not more than 5000 pounds, 100 ft. behind the Crane. The crane is responsible to keep 100 feet behind the flow traffic. All Vehicles including NYC police shall not be allowed between the escort vehicle and the crane on the bridges.",
                "This permit is only approved based on the cranes axle weight and the spacing submitted to NYCDOT on the permit application.  It is the responsibility of Permittee to adjust the standard vehicle axle weight by removing any parts, such as Counter weight, Outrigger beams, etc. to meet the submitted axle weight. The crane is not permitted to travel on any movable or posted bridges throughout NYC. The crane must occupy 2 lanes on bridges. The crane is not permitted on Brooklyn Bridge. The crane is permitted on Outer Roadways on Williamsburg Bridge and not permitted on Inner Roadways; and permitted on Lower Inner Roadways on Queensboro Bridge and not permitted on Lower Outer Roadways and Upper Roadways. It is permitted on Williamsburg Bridge (OR), Queensboro Bridge (LIR) or Manhattan Bridge only when wind velocity is less than 30 MPH. This self-propelled crane must move with speed less than 5 mph, when the crane is on bridges. The crane is permitted only on the lower Roadway on Manhattan Bridge. The crane is not permitted on Upper Roadway.  Any change in the proposed crane weight or configuration on this permit will not be allowed. The crane must follow and obey all posted signs along the route regarding height restrictions, speed, weight, etc. - as well as all NYC Traffic Rules and Regulations. Obtain all necessary permits from other agencies such as Port Authority, NYSDOT, TBTA, etc. as applicable. Permittee is responsible for any repair for damage incurred to the bridges structure and any appurtenances caused by proposed crossing operations. The Crane must be escorted by vehicle weighting not more than 5000 pounds, 100 ft. behind the Crane. The crane is responsible to keep 100 feet behind the flow traffic. All Vehicles including NYC police shall not be allowed between the escort vehicle and the crane on the bridges."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 3888,
                    "shortest_values": [
                        "Note: Lift axle must be down at all times when traveling on NYC Streets - *not having the lift axle down will render this permit null and void. * Max gross \"legal\" wt is 34,000 lbs+1,000 lbs per foot wheelbase; the gross \"legal\" wt is never to exceed 80,000lbs",
                        "Vehicles over 55 ft long must have clearance lights at 20 ft intervals along both sides when traveling at night. *** Please observe and follow all the engineering stipulations on this OD permit and obey all postings, restrictions and Traffic Rules and Regulations along the route during this move and on all NYC and NYS bridges and elevated structures. This permit does not in any way absolve the permittee of any responsibility for damage done to NYC and NYS bridges structural integrity due to this move.***",
                        "Please observe, follow and obey all postings, restrictions and Traffic Rules and Regulations along the truck route you traverse/travel during movement and on all NYC and NYS bridges and elevated structures.  This permit does absolve the permittee of any responsibility for damage done to NYC and NYS bridges structural integrity due to this move. Note: *** Annual overweight permitted vehicles need to be legally-sized; legal dimensions not to exceed: 8 ft wide, 13 ft 6 in high and or 35 ft, single, or 55 ft, tractor trailer, long.",
                        "Please observe, follow and obey all postings, restrictions and Traffic Rules and Regulations along the truck route you traverse/travel during movement and on all NYC and NYS bridges and elevated structures. This permit does absolve the permittee of any responsibility for damage done to NYC and NYS bridges structural integrity due to this move. Note: ***** Annual overweight permitted vehicles need to be legally-sized; legal dimensions not to exceed: 8 ft wide, 13 ft 6 in high and or 35 ft, single, or 55 ft, tractor trailer, long.",
                        "Please observe, follow and obey all postings, restrictions and Traffic Rules and Regulations along the truck route you traverse/travel during movement and on all NYC and NYS bridges and elevated structures. This permit does absolve the permittee of any responsibility for damage done to NYC and NYS bridges structural integrity due to this move. Note: ***** Annual overweight permitted vehicles need to be legally-sized; legal dimensions not to exceed: 8 ft wide, 13 ft 6 in high and or 35 ft, single, or 55 ft, tractor trailer, long.  ***** NOTE:   This vehicle is not permitted to travel on any movable or posted bridges throughout NYC"
                    ],
                    "longest_values": [
                        "the Lift Axles must be down all the time (7 drive axles) The Permittee must adjust the vehicle axle weight by removing any parts, such as Counter weight, Outrigger beams, etc. to meet the submitted axles weight. Crane is not permitted to travel on movable bridges in NYC; not permitted on posted bridges, in NYC, not permitted on Brooklyn Bridge.  Crane must occupy 2 lanes on bridges. Crane is permitted on Outer Roadways on Williamsburg Bridge and not permitted on Inner Roadways. Crane is permitted on Lower Inner Roadways on Queensboro Bridge. Crane is not permitted on Lower Outer Roadways and Upper Roadways. Crane is permitted on Williamsburg Bridge (OR), Queensboro Bridge (LIR) or Manhattan Bridge only when wind velocity is less than 30 MPH.  Crane must move with speed less than 5 mph (Crawl Speed) when the crane is on bridges. Crane is permitted only on the lower Roadway on Manhattan Bridge. Crane is not permitted on Upper Roadway. Any change in the proposed crane weight or configuration will not be allowed.  The crane must follow and obey all posted signs along the route regarding height restrictions, speed, weight, etc. - - as well as all NYC Traffic Rules and Regulations.  Obtain all necessary permit form other agencies such as PA, NYSDOT, TBTA, etc. as applicable.  Permittee is responsible for any repair for damage incurred to the bridges structure and any appurtenances caused by crossing operations. Crane must be escorted by vehicle weighting not more than 5000 lbs, 100 ft. behind the Crane.Crane is responsible to keep 100 feet behind the flow traffic. All Vehicles including NYC police shall not be allowed between the escort vehicle and the crane on the bridges. It is recommended that the Crane cross City-Bridges, when traffic volume is low. Approval for the Annual permit this crane on the city owned bridges does not obviate SSP Group Inc. of the responsibility for any damage done to the City owned bridges structural integrity, due to this Annual permit moves",
                        "Crane is not permitted to travel on any movable bridges in NYC ; not permitted on posted bridges, not permitted on Brooklyn Bridge. Crane must occupy 2 lanes on bridges. Crane is permitted on Outer Roadways on Williamsburg Bridge and not permitted on Inner Roadways. Crane is permitted on Lower Inner Roadways on 59th St Bridge. Crane is not permitted on Lower Outer Roadways and Upper Roadways. Crane is permitted on Williamsburg Bridge, Queensboro Bridge or Manhattan Bridge only when wind is less than 30 MPH. Crane must move with speed less than 5 mph, when crane is on bridges. Crane is permitted only on the lower Roadway on Manhattan Bridge. Crane is not permitted on Upper Roadway. Changes in the proposed crane wt or configuration reviewed by NYCDOT will not be allowed. Crane must follow and obey all posted signs along the route regarding height restrictions, speed, wt, etc. as well as all NYC Traffic Rules and Regulations. Obtain all permits from other agencies such as PA, NYSDOT, TBTA, etc. as applicable. Permittee is responsible for any repair for damage incurred to the bridges structure and any appurtenances caused by proposed crossing operations. Crane must be escorted by vehicle weighting not more than 5000 lbs, 100 ft. behind the Crane. Crane is responsible to keep 100 ft behind the flow traffic. Vehicles including NYC police shall not be allowed between the escort vehicle and the crane on the bridges. It is recommended that the Crane cross City-Bridges, when traffic volume is low. Permit is only approved based on the cranes axles wt and spacing submitted to NYCDOT via app. It is the responsibility of the Permittee to adjust the standard vehicle axle wt by removing parts, such as Counter wt, Outrigger beams, etc. to meet the submitted axles wt. Approval for this permit of this crane on the NYC bridges does not obviate the Crane company of the responsibility of for any damage done to the City owned bridges structural integrity, due to this Annual permit moves",
                        "Keep all the lift axles down. The Permittee must adjust the vehicle axle weight by removing any parts, such as Counter weight, Outrigger beams, etc. to meet the submitted axles weight. Crane is not permitted to travel on movable bridges in NYC; not permitted on posted bridges, in NYC, not permitted on Brooklyn Bridge.  Crane must occupy 2 lanes on bridges. Crane is permitted on Outer Roadways on Williamsburg Bridge and not permitted on Inner Roadways. Crane is permitted on Lower Inner Roadways on Queensboro Bridge. Crane is not permitted on Lower Outer Roadways and Upper Roadways. Crane is permitted on Williamsburg Bridge (OR), Queensboro Bridge (LIR) or Manhattan Bridge only when wind velocity is less than 30 MPH.  Crane must move with speed less than 10 mph (Crawl Speed) when the crane is on bridges. Crane is permitted only on the lower Roadway on Manhattan Bridge. Crane is not permitted on Upper Roadway. Any change in the proposed crane weight or configuration will not be allowed.  The crane must follow and obey all posted signs along the route regarding height restrictions, speed, weight, etc. - - as well as all NYC Traffic Rules and Regulations.  Obtain all necessary permit form other agencies such as PA, NYSDOT, TBTA, etc. as applicable.  Permittee is responsible for any repair for damage incurred to the bridges structure and any appurtenances caused by crossing operations. Crane must be escorted by vehicle weighting not more than 5000 lbs, 100 ft. behind the Crane.Crane is responsible to keep 100 feet behind the flow traffic. All Vehicles including NYC police shall not be allowed between the escort vehicle and the crane on the bridges. It is recommended that the Crane cross City-Bridges, when traffic volume is low. Approval for the Annual permit this crane on the city owned bridges does not obviate SSP Group Inc. of the responsibility for any damage done to the City owned bridges structural integrity, due to this Annual permit moves.",
                        "This permit is only approved based on the cranes axle weight and the spacing submitted to NYCDOT on the permit application.  It is the responsibility of Permittee to adjust the standard vehicle axle weight by removing any parts, such as Counter weight, Outrigger beams, etc. to meet the submitted axle weight. The crane is not permitted to travel on any movable or posted bridges throughout NYC. The crane must occupy 2 lanes on bridges. The crane is not permitted on Brooklyn Bridge. The crane is permitted on Outer Roadways on Williamsburg Bridge and not permitted on Inner Roadways; and permitted on Lower Inner Roadways on Queensboro Bridge and not permitted on Lower Outer Roadways and Upper Roadways. It is permitted on Williamsburg Bridge (OR), Queensboro Bridge (LIR) or Manhattan Bridge only when wind velocity is less than 30 MPH. This self-propelled crane must move with speed less than 10 mph, when the crane is on bridges. The crane is permitted only on the lower Roadway on Manhattan Bridge. The crane is not permitted on Upper Roadway.  Any change in the proposed crane weight or configuration on this permit will not be allowed. The crane must follow and obey all posted signs along the route regarding height restrictions, speed, weight, etc. - as well as all NYC Traffic Rules and Regulations. Obtain all necessary permits from other agencies such as Port Authority, NYSDOT, TBTA, etc. as applicable. Permittee is responsible for any repair for damage incurred to the bridges structure and any appurtenances caused by proposed crossing operations. The Crane must be escorted by vehicle weighting not more than 5000 pounds, 100 ft. behind the Crane. The crane is responsible to keep 100 feet behind the flow traffic. All Vehicles including NYC police shall not be allowed between the escort vehicle and the crane on the bridges.",
                        "This permit is only approved based on the cranes axle weight and the spacing submitted to NYCDOT on the permit application.  It is the responsibility of Permittee to adjust the standard vehicle axle weight by removing any parts, such as Counter weight, Outrigger beams, etc. to meet the submitted axle weight. The crane is not permitted to travel on any movable or posted bridges throughout NYC. The crane must occupy 2 lanes on bridges. The crane is not permitted on Brooklyn Bridge. The crane is permitted on Outer Roadways on Williamsburg Bridge and not permitted on Inner Roadways; and permitted on Lower Inner Roadways on Queensboro Bridge and not permitted on Lower Outer Roadways and Upper Roadways. It is permitted on Williamsburg Bridge (OR), Queensboro Bridge (LIR) or Manhattan Bridge only when wind velocity is less than 30 MPH. This self-propelled crane must move with speed less than 5 mph, when the crane is on bridges. The crane is permitted only on the lower Roadway on Manhattan Bridge. The crane is not permitted on Upper Roadway.  Any change in the proposed crane weight or configuration on this permit will not be allowed. The crane must follow and obey all posted signs along the route regarding height restrictions, speed, weight, etc. - as well as all NYC Traffic Rules and Regulations. Obtain all necessary permits from other agencies such as Port Authority, NYSDOT, TBTA, etc. as applicable. Permittee is responsible for any repair for damage incurred to the bridges structure and any appurtenances caused by proposed crossing operations. The Crane must be escorted by vehicle weighting not more than 5000 pounds, 100 ft. behind the Crane. The crane is responsible to keep 100 feet behind the flow traffic. All Vehicles including NYC police shall not be allowed between the escort vehicle and the crane on the bridges."
                    ],
                    "average_length": 937.5802469135803
                }
            ]
        }
    ],
    "key_column_candidates": []
}