{
    "dataset_name": "gezn-7mgk",
    "columns": [
        {
            "column_name": "CEQR",
            "number_non_empty_cells": 12206,
            "number_empty_cells": 0,
            "number_distinct_values": 12191,
            "frequent_values": [
                "94DOS003K",
                "10BSA017M",
                "09BSA074K",
                "10BSA014M",
                "09DEP040Q"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 12206,
                    "shortest_values": [
                        "90-119K",
                        "92-009K",
                        "92-031R",
                        "91-166Q",
                        "92-621Y"
                    ],
                    "longest_values": [
                        "03DCLA001X",
                        "03DCLA001Q",
                        "98DCAS001K",
                        "00DCLA001R",
                        "99DCAS001K"
                    ],
                    "average_length": 8.966164181550058
                }
            ]
        },
        {
            "column_name": "Project Name",
            "number_non_empty_cells": 12206,
            "number_empty_cells": 0,
            "number_distinct_values": 11605,
            "frequent_values": [
                "CREATED IN ERROR",
                "83-113 Lorimer St & 112-144 Middleton Street",
                "Regulator Improve-Tide",
                "New York Sports Club",
                "Throop Avenue and Middleton Street"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 12206,
                    "shortest_values": [
                        "BBQ",
                        "Yelo",
                        "CEVF",
                        "Bania",
                        "Camba"
                    ],
                    "longest_values": [
                        "A local law to ( Intro 21A) amend the City Charter to create the Office of Environmental Remediation and to amend the Administrative Code of the City of New York to create a local brownfield cleanup program",
                        "Furnishing and Installation of Light Emitting Diode (LED) Countdown Pedestrian Signal Lenses and the Removal of Existing LED Pedestrian Signal Lenses, Citywide",
                        "A local law to amend (Intro 506A) the administrative code of the City of New York, in relation to the creation of comprehensive wetlands protection strategy",
                        "Sunset Park Study Segment I - Gowanus Connector Hamilton Avenue  Sunset Park Study Segment I  Sunset Park Study Segment I Gowanus Connector Hamilton Avenue",
                        "New York City\u0092s Revised Long-Term Watershed Protection Program in support of the Filtration Avoidance Determination for the Catskill and Delaware System"
                    ],
                    "average_length": 28.57553662133377
                }
            ]
        },
        {
            "column_name": "Project Description",
            "number_non_empty_cells": 11248,
            "number_empty_cells": 958,
            "number_distinct_values": 10702,
            "frequent_values": [
                "Use variance to permit in M1-2 zone, construction of 24 4-story residential buildings, demolish factory complex and parking area",
                "Special Permit (§64-92) to waive bulk regulations for the replacement of homes damaged/destroyed by Hurricane Sandy, on properties which are registered in the NYC Build it Back Program.",
                "Proposed Residential Dwellings in an M1-1 Zone",
                "The relocation of a base station and off street parking For-Hire Vehicles under Chapter 5 of Title 19 of the Administrative Code.",
                "School seat certification for two dwelling units."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 11248,
                    "shortest_values": [
                        "New",
                        "HOV Lane",
                        "Withdrawn",
                        "Teminated",
                        "TERMINATED"
                    ],
                    "longest_values": [
                        "The proposal involves an application by New York City Department of Housing Preservation and Development (\u001aHPD\u001a), on behalf of the project sponsor, Lemor Realty Corp., in partnership with Apex Building Group, for discretionary actions subject to City Planning Commission (\u001aCPC\u001a) approval (collectively, the \u001aProposed Actions\u001a) include designation of an Urban Development Action Area, approval of an Urban Development Action Area Project (\u001aUDAAP\u001a), and the disposition of City-owned property to facilitate the construction of a new 7-story mixed use building containing affordable housing, community facility and retail space (the \u001aProposed Development\u001a) at 263-267 West 126th Street (Block 1932, Lots 5, 7, and 107 \u001a the \u001aProject Area\u001a or \u001aDevelopment Site\u001a) in the Central Harlem neighborhood of Manhattan, Community District 10.. The project sponsor would also request construction financing from HPD, through HPD\u001as Neighborhood Construction Program (NCP) at a later date.  The Project Area is located on the north side of West 126th Street between Frederick Douglass Boulevard and Adam Clayton Powell Jr. Boulevard. The City of New York owns all three lots that constitute the Project Area. The Project Area measures approximately 8,492 square feet (sf) and is currently undeveloped. Currently, the Project Area contains an interim Green Thumb community garden operating under a temporary license agreement with HPD, which allows for garden related activities until the lots are ready for development. The Project Area is currently zoned R7-2/C2-4.     The Proposed Actions would facilitate the Proposed Development of the Project Area with a new 7- story (approximately 75 feet in height) building with a total floor area of approximately 45,613 gross square feet (gsf). The Proposed Development would contain approximately 37 mixed-income affordable rental units containing 11 studios, 12 one-bedroom, 11 two-bedroom, and 3 three-bedroom units, with one unit reserved for a building superintendent. In addition to the residential units, it is currently anticipated that the Proposed Development would contain approximately 1,362 square feet of community facility space for Silicon Harlem\u001as App Youth Leadership Academy (AYLA) on the ground floor, approximately 4,500 square feet of tech incubator space to be used by Silicon Harlem and approximately 1,200 square feet of retail space tentatively programmed as a café.    SUMMARY OF THE PROPOSED ACTIONS    Urban Development Action Area Project (UDAAP)  The Project Area (Block 1932, Lots 5, 7, and 107) would be designated as an Urban Development Action Area and the Proposed Development would be approved as an UDAAP.    Disposition of City Owned Property  HPD, on behalf of the project sponsor, is seeking disposition authority for the currently City-owned Project Area (Block 1932, Lots 5, 7, and 107) to facilitate the construction   of the Proposed Development. The disposition of these three City-owned properties would be approved pursuant to the Uniform Land Use Review Procedure (\u001aULURP\u001a). Block 1932, Lots 5, 7, and 107 are also referred to as the \u001aDisposition Area\u001a in the ULURP application.    According to the Environmental Assessment Statement (EAS), the Proposed Development would be constructed pursuant to the existing R7-2/C2-4 zoning district, and in a single phase with completion and occupancy expected by 2020. In the future absent the Proposed Actions (the \u001aNo-Action\u001a Condition), HPD would maintain ownership of the Project Area, and future redevelopment of the Project Area would not be possible without HPD applying for actions subject to CPC review and approval. Therefore, the EAS assumes that under the No-Action condition, the existing conditions of the Project Area would remain the same.",
                        "The project is located in Great Kills Park, a 307 acre park, which extends from Miller Field to Great Kills Gateway National Recreation Area, along Lower New York Bay. The project area is approximately 34 acres located south of Ebbitts Street (Block 4105 p/o Lot 50 and Block 4108 p/o Lot 45). Although a mapped city park since 1962, the land and beach is generally not publicly accessible. The site contains a collection of approximately 42  1 \u001a 1 ½ story privately occupied seasonal beach bungalows that pre-date the park mapping, a clubhouse, barn, and a number of ancillary garage structures.     The New York State Office of Parks Recreation and Historic Preservation (OPRHP) recently determined that the project area is eligible for listing on the State and National Registers of Historic Places (S/NR eligible).  Pursuant to a written agreement with the Cedar Grove Beach Club, all of the property, including all the bungalows must be vacated no later than September 30, 2010.The proposed project will demolish the majority of these bungalows so that Cedar Grove Beach can be restored and used by the public as the public parkland that it is.  However, some of the bungalows would be set aside a representative sample of the type of building construction on site. These structures would be rehabilitated for public and ancillary park use in order to provide appropriate amenities for park users. The project is divided into three phases: Phase 1 includes the demolition of structures not needed for future park use and restoration of the beach in these areas. Phase 2 includes opening up the site for public access, beach cleaning/opening for public swimming, adaptive reuse of remaining structures on site, bike path installation, and rehabilitation of the existing pick up sport (softball/junior soccer) play area. Phase 3 will include the installation of new fencing/gates along Ebbits Street and construction of a new playground.    As part of Phase 1 of this project, 32 bungalows and 5 ancillary garages will be demolished. This work will include the shutdown and capping of utilities, removal of in-ground and/or above ground oil tanks, septic, sewer etc. Due to the age of the structures the presence of lead and/or asbestos containing materials (ACM) is considered likely. If found, these materials will be properly addressed and disposed of pursuant to all applicable local, state and federal regulations. Lead and/or asbestos abatement work is anticipated to begin on existing site buildings shortly after the properties are vacated.  DPR will also remove remains of foundation and debris on the beach off Ebbitts Street and Cedar Grove Ct. DPR will restore the demolition sites with beach grass and other native plantings.      Phase 2 includes rehabilitation of existing open space resources for public use and adaptive reuse of the remaining buildings on site. Twelve buildings on site will be rehabilitated.   NYCDPR anticipates that they will be adaptively reused as a lifeguard headquarters, park food concession, an East Shore recreation facility, a public comfort station, equipment storage, maintenance and operations headquarters, a caretaker facility, resident engineers\u001a headquarters, and seasonal Park Enforcement Patrol headquarters. In addition, the beach will be cleaned and opened for swimming, the existing junior soccer and pick up play/softball field will be rehabilitated for public use, and bike facilities will be added along the existing Cedar Grove Beach Place.     Phase 3 includes the construction of a new playground and installation of new entry way fencing/gates.",
                        "The New York City Department of Environmental Protection (DEP) Bureau of Environmental Planning and Analysis (BEPA) has reviewed the proposed project to conduct geotechnical investigations and stratigraphic borings at one location on Central Hudson Gas & Electric (CHGE) property approximately 350 feet northwest of Danskammer Road in the Town of Newburgh, Orange County, New York 12550. Access to the site would be via Danskammer Road, owned by LDH Energy.    The purpose of these test wells is to determine the geological and engineering characteristics of the soil and rock for use in planning a route for a new drinking water supply tunnel along the Rondout-West Branch portion of the Delaware Aqueduct.     Prior to the start of any site preparation activities, erosion and sediment controls, primarily including silt fence, would be installed to prevent runoff from disturbed areas from transporting sediment to other parts of the site. No site grading is proposed in association with site preparation for boring RB-15.  Clean gravel would be deposited in localized areas within the work area surrounding the borehole to provide a stabilized surface for drilling equipment, storage tanks, generators, etc. The deposition of clean gravel within the work area surrounding the boring may result in minor disturbance (several inches or less) to the ground surface.    If artesian water pressures are encountered as part of the proposed project, a small amount of groundwater may be discharged into an unnamed stream and Hudson River near the project site. Water would be collected in a sump at the head of the borehole, then pumped to sedimentation tanks for settling fines. The sump area would also be surrounded by sand bags to reduce the potential for water flow out of the area. Sedimentation tanks with a minimum capacity of 20,000 gallons, connected in series if required, will be provided within the work area. The water will be stored in the sedimentation tanks for turbidity analyses.   If the collected water is clear, it will be released in a controlled manner to nearby water bodies. Artesian water would be released in a controlled manner at the weir location in the creek located to the north of the intersection of Danskammer Road and River Road in Newburgh, New York, approximately 1,500 feet from the RB-15 boring location.    Artesian water that does not meet the turbidity requirements will be hauled to an approved disposal facility by a permitted NYSDEC Part 364 waste transporter. The drilling contractor will select an approved disposal facility, such as the facility utilized during the 2011-2012 deep test boring program.    A small amount of grubbing would be required. If removal is necessary, downed trees from CHGE maintenance activities would be disposed of pursuant to NYSDEC Emerald Ash Borer guidelines.    NYSDEC Division of Mineral Resources permits have been submitted, and a Town of Newburgh Clearing and Grading Permit application would be submitted, as well, should the Town assume regulatory jurisdiction over the temporary, minor disturbance. NYSDEC would be consulted regarding the need for a SPDES industrial discharge permit.  Previous program borings encountered artesian pressures but did not require a SPDES permit due to the small, temporary nature of the discharge and the enactment of a proactive monitoring and management plan. No federal permits are required.",
                        "The New York City Department of Environmental Protection (DEP) Bureau of Environmental Planning and Analysis (BEPA) has reviewed the proposed project to conduct geotechnical investigations and stratigraphic borings at one location on CCI property on Danskammer Road in the Town of Newburgh, Orange County, New York. The purpose of these test wells is to determine the geological and engineering characteristics of the soil and rock for use in planning a route for a new drinking water supply tunnel along the Rondout-West Branch portion of the Delaware Aqueduct. The proposed boring is to be located near the entrance to the coal pile area adjacent to the Dynegy Danskammer Generating Station, Town of Newburgh, Ulster County, New York 12550.  Prior to the start of any site preparation activities, erosion and sediment controls, primarily including silt fence, would be installed to prevent runoff from disturbed areas from transporting sediment to other parts of the site. No site grading and only minor brush clearing activities are proposed in association with site preparation for boring RB-16.  Clean gravel would be deposited in localized areas within the work area surrounding the borehole to provide a stabilized surface for drilling equipment, storage tanks, generators, etc.  The deposition of clean gravel within the work area surrounding the boring may result in minor disturbance (several inches or less) to the ground surface. If artesian water pressures are encountered as part of the proposed project, a small amount of groundwater may be discharged into an unnamed stream and Hudson River near the project site. Water would be collected in a sump at the head of the borehole, then pumped to sedimentation tanks for settling fines. The sump area would also be surrounded by sand bags to reduce the potential for water flow out of the area. Sedimentation tanks with a minimum capacity of 20,000 gallons, connected in series if required, will be provided within the work area. The water will be stored in the sedimentation tanks for turbidity analyses. If the collected water is clear, it will be released in a controlled manner to nearby water bodies. Any artesian water would be released in a controlled manner to the Hudson River located approximately 900 feet from the boring location. Artesian water that does not meet the turbidity requirements will be hauled to an approved disposal facility by a permitted NYSDEC Part 364 waste transporter. The drilling contractor will select an approved disposal facility, such as the facility utilized during the 2011-2012 deep test boring program. NYSDEC Division of Mineral Resources permits have been submitted, and a Town of Newburgh Clearing and Grading Permit application would be submitted, as well, should the Town assume regulatory jurisdiction over the temporary, minor disturbance. NYSDEC would be consulted regarding the need for a SPDES industrial discharge permit.  Previous program borings encountered artesian pressures but did not require a SPDES permit due to the small, temporary nature of the discharge and the enactment of a proactive monitoring and management plan. No federal permits are required.",
                        "The proposal involves an application by HPD, on behalf of the project sponsor, East Brooklyn Congregations/Marcal Group/Mlappin & Associates LLC Team, for discretionary actions subject to City Planning Commission (CPC) approval (the \u001aproposed actions\u001a) including:  Urban Development Action Area Project (UDAAP) designation, project approval, and disposition of city-owned property. The actions subject to CPC approval are described further below.  The project sponsor would also seek construction financing through HPD\u001as Neighborhood Construction Program (NCP) at a later date. The project sites are located at 379-383 Howard Avenue, Brooklyn NY (Block 1446, Lots 1 and 3); 1297 East New York Avenue, Brooklyn NY (Block 1476, Lot 34); 581-583 Belmont Avenue, Brooklyn NY (Block 4012, Lots 32 & 34); 223-227 Vermont Street, Brooklyn NY (Block 3706, Lots 13, 13, 14); 190 Essex Street, Brooklyn NY (Block 1446, Lots 1, 3).  The Howard Avenue site is located on northwest corner of the intersection of Howard Avenue and Bergan Street. The East New York Avenue site is located mid-block on New York Avenue, with Lincoln Place to the north, and Howard Avenue to the west.   The Belmont Avenue site is located at the northeast corner of the intersection of Belmont Avenue and Schenck Avenue.  The Vermont Street site is located mid-block on Vermont Street, with Liberty Avenue to the north and Glenmore Avenue to the south.  The Essex Street site is located mid-block on Essex Street, with Fulton Street to the north and Folsom Place to the south. The Howard Avenue site measures approximately 8,217 square feet (sf), the East New York Avenue site measures approximately 4,275sf, the Belmont Avenue site measures approximately 10,000 sf, the Vermont Street site measures approximately 7,950sf, and the Essex Street site measures approximately 9,858sf. Currently all project sites are vacant lots.  Under the proposal, the project sites would be designated as a UDAAP, conveyed to the project sponsor and developed with the proposed project, five residential buildings with combined 70,009 GSF and 79 affordable housing units: new 4-story buildings on the Howard Ave site (approximately 20,593 gross square feet (gsf) with 23 units), the East New York site (9,794 gsf, 10 units), and the Vermont St. site (13,480 gsf, 15 units); and 3-story residential buildings with affordable housing units on the Belmont Ave. site (12,840 gsf, 16 units) and the Essex St. site (13,302 gsf, 15 units). The East New York Avenue site will contain approximately 10 units of affordable housing. An \u001a Designation for noise was mapped on the East New York Avenue project site in connection with the East Lincoln and Vacant Building RFP VI Rezoning (CEQR Number: 92HPD008K, E-41). The proposed project would be constructed in conformance with the project sites\u001a R5 and R6 zoning districts. According to the Environmental Assessment Statement (EAS), the proposed project would be implemented in a single phase and is expected to be completed and operational by 2020. Absent the proposed actions, the EAS assumes that existing conditions would remain at the sites."
                    ],
                    "average_length": 287.5581436699858
                }
            ]
        },
        {
            "column_name": "Borough",
            "number_non_empty_cells": 12157,
            "number_empty_cells": 49,
            "number_distinct_values": 7,
            "frequent_values": [
                "Brooklyn",
                "Manhattan",
                "Queens",
                "Staten Island",
                "Bronx"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 12157,
                    "shortest_values": [
                        "Bronx",
                        "Queens",
                        "Upstate",
                        "Citywide",
                        "Brooklyn"
                    ],
                    "longest_values": [
                        "Staten Island",
                        "Manhattan",
                        "Brooklyn",
                        "Citywide",
                        "Upstate"
                    ],
                    "average_length": 8.19420909763922
                }
            ]
        },
        {
            "column_name": "Lead Agency",
            "number_non_empty_cells": 12206,
            "number_empty_cells": 0,
            "number_distinct_values": 49,
            "frequent_values": [
                "Board of Standards and Appeals",
                "Department of City Planning",
                "Department of Environmental Protection",
                "Department of Housing Preservation & Development",
                "Taxi and Limousine Commission"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 12206,
                    "shortest_values": [
                        "NYC Council",
                        "NYC Fire Department",
                        "Office of the Mayor",
                        "NYC Transit Authority",
                        "NYC Police Department"
                    ],
                    "longest_values": [
                        "NYC Departments of Environmental Protection and City Planning (co-lead)",
                        "Department of Information Technology & Telecommunications",
                        "Deputy Mayor for Housing and Economic Development",
                        "Office of the Manhattan County District Attorney",
                        "Department of Housing Preservation & Development"
                    ],
                    "average_length": 33.09700147468458
                }
            ]
        },
        {
            "column_name": "URL",
            "number_non_empty_cells": 12206,
            "number_empty_cells": 0,
            "number_distinct_values": 12206,
            "frequent_values": [
                "https://a002-ceqraccess.nyc.gov/ceqr/ProjectInformation/ProjectDetail/13427-18DPR004Q",
                "https://a002-ceqraccess.nyc.gov/ceqr/ProjectInformation/ProjectDetail/5745-07TLC030Q",
                "https://a002-ceqraccess.nyc.gov/ceqr/ProjectInformation/ProjectDetail/4793-05DEP051M",
                "https://a002-ceqraccess.nyc.gov/ceqr/ProjectInformation/ProjectDetail/2287-99BSA037X",
                "https://a002-ceqraccess.nyc.gov/ceqr/ProjectInformation/ProjectDetail/9419-13DCP098R"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 12206,
                    "shortest_values": [
                        "https://a002-ceqraccess.nyc.gov/ceqr/ProjectInformation/ProjectDetail/8-86-082M",
                        "https://a002-ceqraccess.nyc.gov/ceqr/ProjectInformation/ProjectDetail/3-82-270M",
                        "https://a002-ceqraccess.nyc.gov/ceqr/ProjectInformation/ProjectDetail/4-83-078M",
                        "https://a002-ceqraccess.nyc.gov/ceqr/ProjectInformation/ProjectDetail/9-86-226Q",
                        "https://a002-ceqraccess.nyc.gov/ceqr/ProjectInformation/ProjectDetail/2-79-069M"
                    ],
                    "longest_values": [
                        "https://a002-ceqraccess.nyc.gov/ceqr/ProjectInformation/ProjectDetail/14049-20DCP038Q",
                        "https://a002-ceqraccess.nyc.gov/ceqr/ProjectInformation/ProjectDetail/10056-14DCP079R",
                        "https://a002-ceqraccess.nyc.gov/ceqr/ProjectInformation/ProjectDetail/12900-17TLC024Q",
                        "https://a002-ceqraccess.nyc.gov/ceqr/ProjectInformation/ProjectDetail/13930-19DEP010M",
                        "https://a002-ceqraccess.nyc.gov/ceqr/ProjectInformation/ProjectDetail/12092-16HPD138M"
                    ],
                    "average_length": 84.21317384892676
                }
            ]
        }
    ],
    "key_column_candidates": []
}