{
    "dataset_name": "mqdy-gu73",
    "columns": [
        {
            "column_name": "Item Number",
            "number_non_empty_cells": 1890,
            "number_empty_cells": 0,
            "number_distinct_values": 766,
            "frequent_values": [
                "23169",
                "22080",
                "15088",
                "08124",
                "20044"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 1889,
                    "max_value": 59006,
                    "min_value": 108,
                    "mean": 11633.61461090524,
                    "stddev": 7231.895702460267
                },
                {
                    "type": "TEXT",
                    "count": 1,
                    "shortest_values": [
                        "#13009"
                    ],
                    "longest_values": [
                        "#13009"
                    ],
                    "average_length": 6.0
                }
            ]
        },
        {
            "column_name": "Product Name",
            "number_non_empty_cells": 1890,
            "number_empty_cells": 0,
            "number_distinct_values": 751,
            "frequent_values": [
                "Spouse A & Spouse B T-shirts",
                "Graphic Tile with NYC Image",
                "Sterling Silver Wedding Band",
                "Brooklyn Tea Pouch",
                "Classic I love NY T-Shirt \u001a Toddlers & Kids"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1890,
                    "shortest_values": [
                        "Mapkins",
                        "NYPD Pen",
                        "DSNY Mug",
                        "Wool Cap",
                        "ESB Charm"
                    ],
                    "longest_values": [
                        "New York's Legal Landmarks: A Guide to Legal Edifices, Institutions, Lore, History, and Curiosities on the City's Streets",
                        "Brooklyn Heights, the rise, and fall, and, rebirth of America\u001as first Suburb is a historical read.",
                        "Picking Up: On the Streets and Behind the Trucks with the Sanitation Workers of New York City",
                        "100 Things Yankees Fans Should Know & Do Before They Die (100 Things...Fans Should Know)",
                        "New York City 2011 Electrical Code- Administrative Provisions and 2008 NEC Amendments"
                    ],
                    "average_length": 25.755555555555556
                }
            ]
        },
        {
            "column_name": "CityStore Exclusive",
            "number_non_empty_cells": 1890,
            "number_empty_cells": 0,
            "number_distinct_values": 2,
            "frequent_values": [
                "No",
                "Yes"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1890,
                    "shortest_values": [
                        "No",
                        "Yes"
                    ],
                    "longest_values": [
                        "Yes",
                        "No"
                    ],
                    "average_length": 2.178835978835979
                }
            ]
        },
        {
            "column_name": "Unit Price",
            "number_non_empty_cells": 1890,
            "number_empty_cells": 0,
            "number_distinct_values": 70,
            "frequent_values": [
                "15.00",
                "5.00",
                "18.00",
                "22.00",
                "28.00"
            ],
            "data_types": [
                {
                    "type": "REAL",
                    "count": 1890,
                    "max_value": 199.0,
                    "min_value": 1.0,
                    "mean": 23.262962962962963,
                    "stddev": 25.11447133797419
                }
            ]
        },
        {
            "column_name": "Color",
            "number_non_empty_cells": 237,
            "number_empty_cells": 1653,
            "number_distinct_values": 27,
            "frequent_values": [
                "Black",
                "White",
                "Blue",
                "Hunter Green",
                "Gray"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 237,
                    "shortest_values": [
                        "Red",
                        "Jade",
                        "Gray",
                        "Navy",
                        "Blue"
                    ],
                    "longest_values": [
                        "Navy with Orange Logo",
                        "Navy with White Logo",
                        "Blue Periwinkle",
                        "Green Apple Pin",
                        "Black and Black"
                    ],
                    "average_length": 6.071729957805907
                }
            ]
        },
        {
            "column_name": "Size",
            "number_non_empty_cells": 641,
            "number_empty_cells": 1249,
            "number_distinct_values": 41,
            "frequent_values": [
                "S",
                "M",
                "L",
                "XL",
                "XXL"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 27,
                    "max_value": 13,
                    "min_value": 2,
                    "mean": 8.0,
                    "stddev": 2.748737083745107
                },
                {
                    "type": "TEXT",
                    "count": 614,
                    "shortest_values": [
                        "S",
                        "L",
                        "M",
                        "XL",
                        "7M"
                    ],
                    "longest_values": [
                        "9.5 x 5 x 1.5, 178 x 228mm",
                        "Women's (4 - 10 ï¿½)",
                        "Womens (7 - 9)",
                        "12 - 18 Months",
                        "Mens (9 - 13)"
                    ],
                    "average_length": 3.4348534201954397
                }
            ]
        },
        {
            "column_name": "Style",
            "number_non_empty_cells": 174,
            "number_empty_cells": 1716,
            "number_distinct_values": 65,
            "frequent_values": [
                "Spouse B",
                "Spouse A",
                "Mr. & Mrs.",
                "Mrs. & Mrs.",
                "Mr. & Mr."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 174,
                    "shortest_values": [
                        "Love",
                        "FDNY",
                        "Yay!",
                        "Taxi",
                        "Bride"
                    ],
                    "longest_values": [
                        "Empire State Building Black & White",
                        "Brooklyn with Bridge background",
                        "Brooklyn Bridge Black & White",
                        "Washington Square Park Magnet",
                        "Empire State Building Color"
                    ],
                    "average_length": 13.28735632183908
                }
            ]
        },
        {
            "column_name": "Category Name",
            "number_non_empty_cells": 1890,
            "number_empty_cells": 0,
            "number_distinct_values": 32,
            "frequent_values": [
                "Wear NYC",
                "NYC Kids",
                "CityStore Exclusives",
                "NYPD . FDNY . DSNY",
                "Stationery"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1890,
                    "shortest_values": [
                        "Gifts",
                        "Books",
                        "History",
                        "NY Food",
                        "NYC Food"
                    ],
                    "longest_values": [
                        "Under $10.00 - Great Gifts",
                        "Posters, Prints and Signs",
                        "Jewelry and Accessories",
                        "Municipal Publications",
                        "Books Make Great Gifts"
                    ],
                    "average_length": 12.684126984126983
                }
            ]
        },
        {
            "column_name": "Description",
            "number_non_empty_cells": 1890,
            "number_empty_cells": 0,
            "number_distinct_values": 697,
            "frequent_values": [
                "Here s a fun gift for the new couple - instead of Brides or Grooms, call them Spouse A and Spouse B. There s a T-shirt for both!    100% Cotton. Comes in sizes S, M, L, XL.",
                "A vintage image. Postcard is 3 1/2 x 5 1 2 inches, just like the postcards of yesteryear!",
                "New York City Iconic Images transferred to tiles, each one unique with display stand included.  Square tile measures 4x4 and rectangle measures 6x3.  Makes a great gift for any home or office.         Rectangle Tiles:    NYC Apollo    Brooklyn with Bridge Background    New York City Color                                                                          Square Tiles:              Wall Street Bull    ESB Color    ESB Black & White    Fearless Girl    Love    Brooklyn Bridge Black & White",
                "Beautiful sterling silver wedding band. Perfect as an expression of your love. Available in sizes 5-13.",
                "The classic I Love NY T-Shirt  for the younger set! Part of the Official I Love NY collection.  Printed in Brooklyn.    100% Cotton. Sizes: 2 T (toddler) XS (2-4) S (6-8) M (10-12) L (14-16)."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 1890,
                    "shortest_values": [
                        "Part of taxi collection. Vinyl.",
                        "All over subway map pencil case.",
                        "Vintage style New York magnet. 2  x 3",
                        "Vintage style Brooklyn magnet. 2  x 3 .",
                        "Lady Liberty magnet. 4 1/2 inches high."
                    ],
                    "longest_values": [
                        "The New York City Fire Code regulates fire safety in the operation and maintenance of all buildings, and establishes design requirements for a wide range of building installations. The Fire Code is a companion code to the New York City Construction Codes and Zoning Resolution, with extensive cross-references to the Building, Mechanical and Electrical Codes.    The Fire Code is newly-amended in 2014 to adopt many of the latest fire safety technologies and standards from the International Fire Code, together with important New York City-specific provisions. The 2014 Fire Code comprehensively amends the emergency preparedness requirements for buildings and occupancies, and makes significant changes in provisions relating to fire apparatus access roads and building frontage spaces; rooftop access and obstructions; rooftop solar panel installations; construction site fire safety standards; fire watch and notification requirements for out-of-service building fire protection systems; building and apartment identification standards; and use of medical oxygen, portable electric space heaters and halogen lamps.    The 2014 Fire Code is an indispensable reference for design professionals, building owners and managers, and others engaged in trades and businesses regulated by the Fire Code, to ensure that buildings or facilities for which they are responsible are lawfully designed, operated and maintained. The Fire Code amendments took effect on March 30, 2014.    Soft Cover. 444 pages",
                        "    The New York City Housing and Vacancy Survey (HVS) is the most comprehensive and reliable housing market survey conducted in any city in the United States. Housing New York City 2008 provides not only a critical snapshot of New York City  housing market in 2008, but also, with data from HVS surveys since 1965, valuable insights into trends and changes in the City  housing market over the last four decades. This comprehensive Report analyzes the City  residential population and households, race/ethnicity, household composition and types, immigration, incomes and the labor market, education, homeownership, vacancies and vacancy rates, rent levels, affordability, housing and neighborhood conditions, crowding and doubling-up, including trends for the City and the 5 boroughs. Maps show local concentrations of population and housing characteristics by census tract. Detailed data is provided for each of 55 areas similar to Community Districts in 30 sub-borough tables.    The CD, in PDF, includes instant links to every chapter, section, table, figure, map and detailed technical document on content and procedures of the HVS. Includes 337 tables, 88 figures and 31 maps. Comes with a color wall map of the City showing Community Districts, Sub-Borough Areas and census tracts.    Useful to policy analysts, planners, scholars and researchers, real estate analysts, developers, service providers in private and non-profit organizations, government agencies and community groups.",
                        "America s largest city generates garbage in torrents - 11,000 tons a day on average. In Picking Up, the anthropologist Robin Nagle introduces us to the men and women of New York City s Department of Sanitation and makes clear why this small army of uniformed workers is the most important labor force on the streets. Seeking to understand every aspect of the Department s mission, Nagle accompanied crews on their routes, questioned supervisors and commissioners, and listened to story after story about blizzards, hazardous wastes, and the insults of everyday New Yorkers. But the more time she spent with the DSNY, the more Nagle realized that observing wasn t quite enough - so she joined the force herself. Driving the hulking trucks, she obtained an insider s perspective on the complex kinships, arcane rules, and obscure lingo unique to the realm of sanitation workers.    Nagle chronicles New York City s four-hundred-year struggle with trash, and traces the city s waste-management efforts from a time when filth overwhelmed the streets to the far more rigorous practices of today, when the Big Apple is as clean as it s ever been.    Throughout, Nagle reveals the many unexpected ways in which sanitation workers stand between our seemingly well-ordered lives and the sea of refuse that would otherwise overwhelm us. In the process, she changes the way we understand cities - and ourselves within them.    By Robin Nagle    304 pages. 8 x 6 inches. Paperback.",
                        "The New York City Housing and Vacancy Survey (HVS) is the most comprehensive and reliable housing market survey conducted in any city in the United States. Housing New York City 2011, by Dr. Moon Wha Lee, provides not only a critical snapshot of New York City s housing market in 2011, but also, with data from HVS surveys since 1965, valuable insights into trends and patterns in the City s housing market over the last four decades.    This comprehensive Report includes 300 tables, 86 figures and 24 maps. It analyzes extensively the City s residential population and households, race/ethnicity, household composition and types, crowding and doubling-up, immigration, incomes and the labor market, education, homeownership, vacancies and vacancy rates, rent levels, affordability, and the condition of housing and neighborhoods, including trends for the City and the 5 boroughs. Maps show local concentrations of population and housing characteristics by census tract. Detailed data are provided for each of 55 areas similar to Community Districts in 30 sub-borough tables.    Useful to policy analysts, planners, scholars and researchers, real estate analysts, developers, service providers in private and non-profit organizations, government agencies and community groups. This CD includes instant links to every chapter, section, table, figure, map and detailed technical documents on the content and procedures of the HVS.    CD-ROM (pdf), 647 pages.",
                        "A fact-filled, alphabetical journey through the five boroughs of the city. A pigeon serves as a tour guide of sorts, appearing on every page in either the small inset illustration or in one of the smaller spot-art drawings located along the bottom of the pages. The format works well to introduce famous landmarks and neighborhoods with descriptive alliterative sentences, such as   Dragons dance by dim sum diners   as an introduction to Chinatown and   Gorgeous gardens grace glass-houses   for commentary on the New York Botanical Garden. Succinct paragraphs of historical information are located under each full-page, highly detailed colored-pencil-and-watercolor illustration. In a much smaller type size, a one-sentence, sometimes quirky, bit of information is imparted as well, as in   Many skyscrapers don t have a 13th floor. No one wants to be on an unlucky floor!   This up-to-date book includes a reference to and inset illustration of the former Twin Towers under the letter T:   Tough times take teamwork.   The book begins with a map and a listing of the 26 landmarks showcased. The endpapers offer a different sort of New York alphabet to readers, featuring small illustrations of interesting trademark items, such as a Nathan s hot dog, a blue box from Tiffany s, and a yellow cab. A wonderful testament to a diverse city and its equally diverse residents.   -School Library Journal, 32 pages."
                    ],
                    "average_length": 310.0994708994709
                }
            ]
        }
    ],
    "key_column_candidates": []
}