{
    "dataset_name": "t9iz-i583",
    "columns": [
        {
            "column_name": "PermitID",
            "number_non_empty_cells": 106511,
            "number_empty_cells": 0,
            "number_distinct_values": 44776,
            "frequent_values": [
                "413506",
                "413488",
                "413757",
                "413078",
                "413260"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 106511,
                    "max_value": 417916,
                    "min_value": 368303,
                    "mean": 393927.5044549389,
                    "stddev": 13753.98209540796
                }
            ]
        },
        {
            "column_name": "StipulationID",
            "number_non_empty_cells": 106511,
            "number_empty_cells": 0,
            "number_distinct_values": 100,
            "frequent_values": [
                "676",
                "603",
                "595",
                "303",
                "305"
            ],
            "data_types": [
                {
                    "type": "INTEGER",
                    "count": 106511,
                    "max_value": 715,
                    "min_value": 7,
                    "mean": 497.99894846541673,
                    "stddev": 219.4043908626615
                }
            ]
        },
        {
            "column_name": "PermitNumber",
            "number_non_empty_cells": 106511,
            "number_empty_cells": 0,
            "number_distinct_values": 44772,
            "frequent_values": [
                "ORP4-2018920-31081",
                "ORP4-2018920-31079",
                "UOGP-2018914-30220",
                "UOGP-2018914-30218",
                "VIOP-2018921-31268"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 106511,
                    "shortest_values": [
                        "CIKG-201812-2",
                        "CIKG-201812-9",
                        "CIKG-201812-8",
                        "CIKG-201812-6",
                        "CIKG-201812-5"
                    ],
                    "longest_values": [
                        "O5V3-20181017-34890",
                        "Q6C2-20171128-47607",
                        "B8G7-20171129-47914",
                        "U914-20171130-48028",
                        "Q6C2-20171128-47717"
                    ],
                    "average_length": 17.74515308278018
                }
            ]
        },
        {
            "column_name": "StipulationCode",
            "number_non_empty_cells": 106511,
            "number_empty_cells": 0,
            "number_distinct_values": 100,
            "frequent_values": [
                "Vehicle Dims",
                "Master 6 14",
                "film April 14",
                "PA-GWB",
                "PA-OUTERBR"
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 106511,
                    "shortest_values": [
                        "QBB",
                        "VZ EB",
                        "PA-GWB",
                        "WBB STIP",
                        "MBB STIP"
                    ],
                    "longest_values": [
                        "Overhang stip n",
                        "Peak 17292Rev-2",
                        "PA new Goethals",
                        "NJ4886-GS1.0 R1",
                        "SPC Full clos 5"
                    ],
                    "average_length": 10.873909737022467
                }
            ]
        },
        {
            "column_name": "StipulationDescription",
            "number_non_empty_cells": 106511,
            "number_empty_cells": 0,
            "number_distinct_values": 97,
            "frequent_values": [
                "NOTE:  * If the vehicle-load combination's overall dimensions and gross weight and axle weights exceed the overall dimensions on this permit and weights submitted - this permit will thus become null and void. *",
                "Please observe and follow the following travel stipulations below as they apply to the dimensions of the vehicle/load combination in your application, accordingly, and please observe and follow all the engineering stipulations on this OD permit and obey all postings, restrictions and Traffic Rules and Regulations along the route during this move and on all NYC and NYS bridges and elevated structures: 1. (167) Vehicles over 10ft wide must have two steady marker lights at each end of the load,  amber in the front and red in the back and 1 flashing amber light on the cab and one flashing amber on the back of the vehicle. 2. (168) Vehicles over 10 ft 6 in wide and/or 65ft long must have a rear escort vehicle equipped with reflective OVERSIZED LOAD signs. 3. (169) Vehicles over 14 feet wide, 100 feet long, 14 feet high and/or more than 100,000 lbs. GVW must have both a lead and a rear escort vehicle with reflective Oversized Load signs on both escort and load vehicles. ***** At 14 feet high or greater the lead vehicle must have a proper height pole attached.4. (170) Vehicles over 55 ft long must have clearance lights at 20 ft intervals along both sides of this vehicle when traveling at night 5. (171) Vehicles over 13 feet, 6 inches high, 14 feet wide, and/or 80 feet long must have a warning sign and two steady yellow lights attached to the rear of the load 6. This permit does not in any way absolve the permittee of any responsibility for damage done to NYC and NYS bridges structural integrity due to this move.",
                "Film Industry vehicles are not permitted on Brooklyn Bridge. Film Industry vehicles must follow and obey all posted signs along the route regarding height restrictions, speed, weight, etc - - as well as all NYC Traffic Rules and Regulations. Film Industry vehicles must obtain all necessary permits from other agencies such as Port Authority, NYSDOT, TBTA, etc. as applicable. Permittee is responsible for any repair for damage incurred caused by proposed crossing operations. Any change in the vehicle configuration on the application is not permitted.",
                "1. Speed Limit:  10 mph   2.  Truck Spacing:  50 feet Clear  3.  Overload Lane:  Outside Curb Lane  4.  No Traffic in Adjacent Lanes   5. Opposing Traffic: Unrestricted  6. Trucker shall call PA Police at 201-346-4102/4107 prior to arriving at GWB",
                "1.  Speed Limit:  10 mph   2.  Truck Spacing:  50 feet Clear     3.   Overload Lane:  Inside Median Lane  4.  No Traffic in Opposing Median Lane     5.  Opposing Traffic: Outside Curb Lane Only    6.  Trucker shall call PA Police at 718-390-2502 prior to arriving at Outerbridge - - ***** NOTE: for greater than 9 ft 5 in wide: *** drivers with vehicle load combinations greater than 9 ft 5 in wide*** MUST contact PA Police before they cross at 718-390-2502, so that PA police escort can be arranged accordingly."
            ],
            "data_types": [
                {
                    "type": "TEXT",
                    "count": 106511,
                    "shortest_values": [
                        "NOTE:CROSSING N.Y.S STRUCTURES AT 5MPH.",
                        "ROBERT F. KENNEDY (RFK) BRIDGE - - OBEY ALL POSTED SIGN RESTRICTIONS WHILE CROSSING THIS BRIDGE",
                        "The permitted crane or vehicle is not allowed to cross weight posted bridges or moveable bridges.",
                        "WILLIAMSBURG BRIDGE STIPULATION:  CROSSING ONLY ALLOWED ON OUTER ROADWAY, RIGHT LANE ONLY.  NOT ALLOWED TO USE INNER ROADWAY.  OBEY ALL POSTED SIGN RESTRICTIONS.",
                        "MANHATTAN BRIDGE STIPULATION:  OBEY ALL POSTED SIGN RESTRICTIONS, INCLUDING FLATBUSH/TILLARY INTERSECTION IN BROOKLYN AND CANAL/CHRYSTIE/BOWERY INTERSECTIONS IN MANHATTAN."
                    ],
                    "longest_values": [
                        "The proposed route will have to cross two city owned bridges, 11th Avenue Viaduct over LIRR BIN 2245010 At the intersection of 34th Street and 11th Avenue only W 34th Street over AMTRAK 30 Street Branch BIN 224501D.  Vehicles including NYC police or other escort vehicles and pedestrian shall not be allowed on the bridges while vehicle is crossing the bridges Full Closure. Each truck must wait for the vehicles in all lanes to be cleared before it begins crossing W 34th Street Ramp and 11th Avenue Viaduct.  The truck company must have escort vehicles behind the truck to keep the Bridges clear of traffic until the truck has completed crossing the Bridges. The permitted trucks must move with speed not more than 5 mph Crawl Speed on the bridges. Vehicles should maintain same speed and does not apply brake while crossing the bridges. Inspect the bridges before the first move, and after the last move. Submit pre and post inspection reports to the City DOT for review and record. The inspection reports will include photographs of the damaged element or member, any cracks or any misalignment at bearing location, etc., if any. Hudson River Valley Engineers, PLLC. and  LPI, Inc. Consulting Engineers will submit as a result of the proposed moves appropriate repair scheme for DOT review as needed. It is required to have permittee consultant engineer be on the site prior to and during the proposed bridges crossing to calibrate the strain gauges and to take their readings. Permittee consultant will submit the first readable strain gauges report after the first 5 moves and another report for the following moves. Two trucks will not travel on the bridges at the same time. Only one truck is approved on the bridges at any time. Do not travel over the bridges if the winds exceed 30 mph. Prior to move Hudson River Valley Engineers, PLLC.,  LPI, Inc. Consulting Engineers will perform a visual inspection of the bridges wearing surfaces and for any pot holes on the bridges please notify Mr. GEORGE KLEIN, P.E., Deputy Chief Engineer- Bureau of Bridge Maintenance, Inspections and operations at (212) 839-4846 for repair of pot holes on the bridges. Hudson River Valley Engineers, PLLC. and LPI, Inc. Consulting Engineers are responsible for any repair for damage incurred to the bridges structure and any appurtenances caused by proposed crossing operations. Follow all posted signs on and before the bridges such as weight, height, speed limit, etc. Follow all applicable procedures with regard to conforming to any constraints in geometric (height, length, etc.) of the roadways on their selected route and obtain any other permit if required. It is also recommended to obtain approval from other appropriate agencies such as Bureau of Traffic and Safety, Street(s)  Roadways, NYSDOT, etc., and follow their suggested recommendations. No substitution will be allowed for the proposed truck, and prior approval for any modification on the transporting truck.  Axles weight should be transferred to each axle as per the attached information. The proposed loading must be verified in the field prior to crossing. It is required to have permittee consultant engineer be on the site prior to and during the proposed bridges crossing to confirm the vertical and horizontal clearances on / under  the Bridge Structure and to confirm wheel placements and load distributions to the Bridges Structures. Vehicle should preferably cross the bridge during nighttime when the traffic volume is low. Follow the consultants recommended additional restrictions, if any. The permitted vehicles are not allowed to cross any weight posted bridges, moveable bridges or any other city owned bridges.  Please note, approval of the above mentioned truck on the subject bridges does not in any way predispose Hudson River Valley Engineers, PLLC., LPI, Inc., and Bay Crane of the responsibility for damage done to the bridges structural integrity, due to this move.",
                        "The proposed route will have to cross two city owned bridges (11th Avenue Viaduct over LIRR (At the intersection of 34th Street and 11th Avenue only); W 34th Street over AMTRAK 30 Street Branch. Vehicles including NYC police or other escort vehicles and pedestrian(s) shall not be allowed on the bridges while vehicle is crossing the bridges (Full Closure). Each truck must wait for the vehicles in all lanes to be cleared before it begins crossing W 34th Street Ramp and 11th Avenue Viaduct.  The truck company must have escort vehicles behind the truck to keep the Bridges clear of traffic until the truck has completed crossing the Bridges. The permitted trucks must move with speed not more than 5 mph (Crawl Speed) on the bridges. Vehicles should maintain same speed and does not apply brake while crossing the bridges. Inspect the bridges before and after the moves. Submit pre and post inspection reports to the City DOT for review and record. The inspection reports will include photographs of the damaged element(s) or member(s), any cracks or any misalignment at bearing location, etc, if any. Hudson River Valley Engineers, PLLC. and  LPI, Inc. Consulting Engineers will submit as a result of the proposed moves appropriate repair scheme for DOT review as needed. It is required to have permittee consultant engineer be on the site prior to and during the proposed bridges crossing to calibrate the strain gauges and to take their readings. Permittee consultant will submit the first readable strain gauges report after the moves. Two trucks will not travel on the bridges at the same time. Only one truck is approved on the bridges at any time. Do not travel over the bridges if the winds exceed 30 mph. Prior to move Hudson River Valley Engineers, PLLC., LPI, Inc. Consulting Engineers will perform a visual inspection of the bridges wearing surfaces and for any potholes on the bridges please notify Mr. GEORGE KLEIN, P.E., Deputy Chief Engineer- Bureau of Bridge Maintenance, Inspections and operations at (212) 839-4846 for repair of pot holes on the bridges. Hudson River Valley Engineers, PLLC. and LPI, Inc. Consulting Engineers are responsible for any repair for damage incurred to the bridges structure and any appurtenances caused by proposed crossing operations. Follow all posted signs on and before the bridges such as weight, height, speed limit, etc. Follow all applicable procedures with regard to conforming to any constraints in geometric (height, length, etc.) of the roadways on their selected route and obtain any other permit if required. It is also recommended to take approval from other appropriate agencies such as Bureau of Traffic and Safety, Street(s) / Roadways, NYSDOT, etc., and follow their suggested recommendations. No substitution will be allowed for the proposed truck, and prior approval for any modification on the transporting truck.  Axles weight should be transferred to each axle as per the attached information.The proposed loading must be verified in the field prior to crossing. It is required to have permittee consultant engineer be on the site prior to and during the proposed bridges crossing to confirm the vertical and horizontal clearances on / under  the Bridge Structure and to confirm wheel placements and load distributions to the Bridges Structures. Vehicle should preferably cross the bridge during nighttime when the traffic volume is low. Follow the consultants recommended additional restrictions, if any. The permitted vehicles are not allowed to cross any weight posted bridges, moveable bridges or any other city owned bridges. Note: approval of the above mentioned truck on the subject bridges does not in any way predispose Hudson River Valley Engineers, PLLC., LPI, Inc. Consulting Engineers and Bay Crane of the responsibility of for any damage done to the bridges structural integrity, due to this move.",
                        "To move a Con Ed Transformer on the selected route the proposed route will have to cross two city owned bridges (Bruckner BLVD over Conrail PT Morris- BIN 2-24109-9; E Tremont Avenue over Metro North- BIN 2-24176-0).  The proposed weight and vehicle configuration of Bay Crane may be permitted to cross the City Bridges as mentioned above with the following restrictions:   Vehicles including NYC police or other escort vehicles and pedestrian(s) shall not be allowed on the bridges while vehicle is crossing the bridges (Full Closure). The permitted vehicle must move with speed not more than 3 mph on the bridges (as per consultant recommendations).Vehicle should maintain same speed and does not apply brake while crossing the bridges.Do not travel over the bridges if the winds exceed 30 mph. Inspect the bridges before move, and after move. Submit pre and post inspection reports to the City DOT for review and record. The inspection reports will include photographs of the damaged element(s) or member(s), any cracks or any misalignment at bearing location, etc, if any. Con-Edison will submit as a result of the move appropriate repair scheme for DOT review. Con Edison and Peak Engineering are responsible for any repair for damage incurred to the bridges structures and any appurtenances caused by proposed crossing operation.Con Edison should be obtain liability insurance, which will have sufficient coverage against any bridge damage, loss of life and property. Prior to move Peak Engineering PLLC.  and Con-Edison will perform a visual inspection of the bridge, and for any pot holes on the bridge please notify Mr. GEORGE KLEIN, P.E., Deputy Chief Engineer- Bureau of Bridge Maintenance, Inspections and operations at (212) 839-4846 for repair of pot holes on the bridges.Must obey posted signs in the selected route.Vehicle should preferably cross the bridges during nighttime when the traffic volume is low. Follow all applicable procedures with regard to conforming to any constraints in geometric (height, length, etc.) of the roadways on their selected route and obtain any other permit if required.It is also recommended to obtain approval from other appropriate agencies such as Bureau of Traffic and Safety, Street(s) / Roadways, NYSDOT, etc., and follow their suggested recommendations. Follow the consultans recommended additional restrictions, if any.The proposed loading must be verified in the field prior to crossing. No substitution will be allowed for the proposed vehicle, and prior approval for any modification on the transporting vehicle.  Axles weight should be transferred to each axle as per the attached tractor-trailer sketch.This permit valid for only one move. It is required to have Con-Edisons Consultant engineer (PEAK Engineering)  be on the site prior to and during the proposed bridge crossing to confirm wheel placements and load distributions to the Bridges Structures. The permitted vehicles are not allowed to cross any weight posted bridges, moveable bridges or any other city owned bridges. Note:, approval of the above mentioned super load tractor-trailer on the subject bridges does not in any way predispose Con-Edison, Bay Crane. and PEAK Engineering of the responsibility for any damage done to the bridges structural integrity, due to this move.",
                        "Vehicles including NYC police or other escort vehicles and pedestrian(s) shall not be allowed on the bridge while vehicle is crossing the bridge (Full Closure). The permitted vehicle must move with speed not more than 3 mph (Crawl Speed) on the bridge (per consultant recommendations). Vehicle should maintain same speed and does not apply brake while crossing the bridge. Do not travel over the bridge if the winds exceed 30 mph. Inspect the bridge before the move, and after the move. Submit pre and post inspection reports to the City DOT for review and record. The inspection reports will include photographs of the damaged element(s) or member(s), any cracks or any misalignment at bearing location, etc, if any. Peak Engineering and Con Edison will submit as a result of the move appropriate repair scheme for DOT review.  Con Edison and Peak Engineering are responsible for any repair for damage incurred to the bridge structure and any appurtenances caused by proposed crossing operation. Con Edison should be obtain liability insurance, which will have sufficient coverage against any bridge damage, loss of life and property. Prior to move Peak Engineering PLLC.  and Con-Edison will perform a visual inspection of the bridge, and for any pot holes on the bridge please notify Mr. GEORGE KLEIN, P.E., Deputy Chief Engineer- Bureau of Bridge Maintenance, Inspections and operations at (212) 839-4846 for repair of pot holes on the bridge. Must obey posted signs in the selected route.  Vehicle should preferably cross the bridge during nighttime when the traffic volume is low.  Follow all applicable procedures with regard to conforming to any constraints in geometric (height, length, etc.) of the roadways on their selected route and obtain any other permit if required. It is also recommended to take approval from other appropriate agencies such as Bureau of Traffic and Safety, Street(s) / Roadways, NYSDOT, etc., and follow their suggested recommendations. Follow the consultants recommended additional restrictions, if any.  The proposed loading must be verified in the field prior to crossing. No substitution will be allowed for the proposed vehicle, and prior approval for any modification on the transporting vehicle.  Axles weight should be transferred to each axle as per the attached tractor-trailer sketch. This permit valid for only one move. It is required to have Con-Edisons Consultant engineer (PEAK Engineering)  be on the site prior to and during the proposed bridge crossing to confirm wheel placements and load distributions to the Bridge Structure. The permitted vehicles are not allowed to cross any weight posted bridges, moveable bridges or any other city owned bridges.  This approval based on the Emergency Situation but NYCDOT will not approve any future super load tractor-trailer for Co Edison on the subject above bridge (W 42nd Street ) before installing strain gages on the bridge structure and start monitoring the stresses on the bridge as per NYCDOT requirements.  Approval of the above mentioned super load tractor-trailer on the subject bridge does not in any way predispose Con-Edison,  Bay Crane Service Inc. and Peak Engineering of the responsibility for any damage done to the bridge structural integrity, due to this move.",
                        "Vehicles including NYC police or other escort vehicles and pedestrian(s) shall not be allowed on the bridge while vehicle is crossing the bridge (Full Closure).The permitted vehicle must move with speed not more than 3 mph (Crawl Speed) on the bridge (per consultant recommendations).Vehicle should maintain same speed and does not apply brake while crossing the bridge.Do not travel over the bridge if the winds exceed 30 mph.Inspect the bridge before the move, and after the move. Submit pre and post inspection reports to the City DOT for review and record. The inspection reports will include photographs of the damaged element(s) or member(s), any cracks or any misalignment at bearing location, etc, if any. Peak Engineering and Con-Edison will submit as a result of the move appropriate repair scheme for DOT review. Con Edison and Peak Engineering are responsible for any repair for damage incurred to the bridge structure and any appurtenances caused by proposed crossing operation.Con Edison should be obtain liability insurance, which will have sufficient coverage against any bridge damage, loss of life and property. Prior to move Peak Engineering PLLC.  and Con-Edison will perform a visual inspection of the bridge, and for any pot holes on the bridge please notify Mr. GEORGE KLEIN, P.E., Deputy Chief Engineer- Bureau of Bridge Maintenance, Inspections and operations at (212) 839-4846 for repair of pot holes on the bridge.Must obey posted signs in the selected route.Vehicle should preferably cross the bridge during nighttime when the traffic volume is low. Follow all applicable procedures with regard to conforming to any constraints in geometric (height, length, etc.) of the roadways on their selected route and obtain any other permit if required.It is also recommended to take approval from other appropriate agencies such as Bureau of Traffic and Safety, Street(s) / Roadways, NYSDOT, etc., and follow their suggested recommendations. Follow the consultants recommended additional restrictions, if any.The proposed loading must be verified in the field prior to crossing.No substitution will be allowed for the proposed vehicle, and prior approval for any modification on the transporting vehicle.  Axles weight should be transferred to each axle as per the attached tractor-trailer sketch.This permit valid for only one move.It is required to have Con-Edisons Consultant engineer (PEAK Engineering)  be on the site prior to and during the proposed bridge crossing to confirm wheel placements and load distributions to the Bridge Structure, The permitted vehicles are not allowed to cross any weight posted bridges, moveable bridges or any other city owned bridges.This approval based on the Emergency Situation but NYCDOT will not approve any future super load tractor-trailer for Co Edison on the subject above bridge (W 42nd Street ) before installing strain gages on the bridge structure and start monitoring the stresses on the bridge as per NYCDOT requirements.  Approval of the above mentioned super load tractor-trailer on the subject bridge does not in any way predispose Con-Edison,  Bay Crane Service Inc. and Peak Engineering of the responsibility for any damage done to the bridge structural integrity, due to this move."
                    ],
                    "average_length": 680.904423017341
                }
            ]
        }
    ],
    "key_column_candidates": []
}